mathlogic/mathlogic.org
#+TODO: X 0 1 2 | OK
#+OPTIONS: tex:verbatim
#+TITLE: Курс математической логики по Штукенбергу Д.Г.

Должно отображаться корректно: x₁,x₂x₃xₙ, θ, ∃, ∑, ∉

Mykhail Volkhov, 2538, 2014Sep-2015Jan
Я не отвечаю за верность написанного - много информации
я придумал сам, много достал из недостоверных источников.

* Базовые понятия
** Формальные системы и модели
   Сделано мной для меня самого, be careful.

   Мы работаем с формальными системами.
   Формальная система определяется сигнатурой, грамматикой,
   набором аксиом и набором правил вывода.
   1. Сигнатура ФС - это (Pr, F, C, Links, Misc, arity):
      * Pr - описывает предикаты (Num + BigLatinChar)
      * F - множество функций (большие заглавные латинские чары)
      * C - описывает константы
      * Links - множество связок ({"->", "∪", " "})
      * Misc - дополнительные элементы ({"(", ")", " "})
      * arity: Foo ∪ Pr ∪ C → N возвращает арность
   2. Грамматика описывает то, как мы можем строить выражения
      в соответствии с нашей сигнатурой.
   3. Аксиомы - выражения в нашей грамматике.
   4. Правила вывода – пары вида (List, List), где List -
      список утверждений. Первый элемент – посылки, второй -
      то, что из них следует.

   Иногда нам хочется что-то посчитать и мы прикручиваем к
   формальной системе модель - корректную структуру с оценкой.
   Структура - это сигнатура с интерпретацией и носителем.
   1. Сигнатура структуры - (R, F, C, arity):
      * Pr - множество символов для предикатов
      * F - функциональных символов
      * С - символов констант
      * arity – функция, определяющая арность Pr ∪ F → N.
   2. Интерпретация - это приписывание символам значения
      и правил действия (отображения из Pr ∪ F ∪ C в носитель)
   3. Носитель - это объединение множеств, в котором обязательно
      присутствует V - множество истинностных значений. Если же
      мы рассматриваем только нульместные предикаты, на этом
      можно остановится, otherwise часто вводится P - предметное
      множество, в которое отображаются элементы из F, C.
   TODO Эта реализация структуры не определяет ничего в районе
   аксиоматики, но аксиоматически заданные структуры существуют
   – например в ФА есть Пеано.
   Если все аксиомы тавтологии, то структура корректна.
   В таком случае она называется моделью.

   Оценку иногда определяют раньше\позже чем модель, мне
   удобно думать о ней, как об отдельной сущности, потому что
   она связывает модель с ФС.
   Оценка - это функция оценки и функция тавтологии.
   1. Функция оценки - отображение из (множества всех формул,
      сгенеренных грамматикой) x (какие-нибудь допаргументы)
      в V модели. Дополнительные аргументы - например оценки
      элементов связки.
   2. Функция тавтологии - отображение из множества формул
      грамматики в {0, 1} - является ли формула тавтологией.
      Тавтология использует функцию оценки. Например, тавтология
      - это выражение, оценка которого на любых аргументах
      возвращает σ ∈ V - какой-то элемент V.

   Когда говорится "сигнатура модели" - имеется в виду ровно она.
   Когда говорится "сигнатура ФС" - имеется в виду скорее всего
   объединение сигнатур, а может только сигнатура самой ФС. Первый
   вариант тут предпочтительней.
* Определения (нужно знать идеально)
  Определения тут зачастую дублицируют то, что написано в самом
  конспекте, поэтому удаление этого блока сэкономит бумагу при
  печати.
** ИВ
   Формальная система с алгеброй Яськовского J₀ в качестве модели, множество
   истинностных значений {0, 1}. Формальная теория нулевого порядка, кванторов
   нету, предикаты - это пропозициональные переменные.
   Аксиомы:
   1. a → b → a
   2. (a → b) → (a → b → c) → (a → c)
   3. a → b → a & b
   4. a & b → a
   5. a & b → b
   6. a → a V b
   7. b → a V b
   8. (a → b) → (c → b) → (a V c → b)
   9. (a → b) → (a → ¬b) → ¬a
   10. ¬¬a → a
** Общезначимость, доказуемость, выводимость
   * Общезначимость формулы - ее свойство в теории с моделью. Общезначимость
     можно определить как угодно, в принципе. Например в ИВ общезначимость -
     это что оценка формулы на любых значениях свободных переменных отображает
     в 1. В модели крипке - существование формулы во всех мирах и т.д.
   * Доказуемость - свойство формулы в теории, значащее, что существует
     доказательство для этой формулы. Доказательство для теории тоже определяется
     по разному (последовательность утверждений, каждое из которых есть аксиома
     или следует по правилу вывода из предыдущих в ИВ, дерево с выводами в S∞)
   * Выводимость - в общем случае часто используется как аналог доказуемости,
     в ИВ это доказуемость из всего, что и ранее + из посылок.
** Теорема о дедукции для ИВ
   Теорема, утверждающая, что из Г, a ⊢ b следует Г ⊢ a → b и наоборот.
   Доказывается вправо поформульным преобразованием, влево
   добавлением 1 формулы. Работает в ИВ, ИИВ, предикатах.
** Теорема о полноте исчисления высказываний
   Типа исчисление предикатов полно относительно классической булевой
   алгебры Яськовского.  Общий ход д-ва: строим док-ва для конкретных
   наборов перменных, 2^n, где n - количество возможных
   переменных. Потом их мерджим.
** ИИВ
   Это такое ИВ, в котором убрали десятую аксиому, а вместо нее
   добавили 10i.
   10i: a → ¬a → b
   Кстати она доказывается и в ИВ
   1. (a → aV¬a) → (a → aV¬a → (¬a → b)) → a → (¬a → b)
   2. a, aV¬a, ¬a ⊢ b
      a
      ¬a
      b → a
      b → ¬a
      (b → a) → (b → ¬a) → ¬b
      ¬b → a
      ¬b → ¬a
      (¬b → a) → (¬b → ¬a) → ¬¬b
      ¬¬b → b
      b
   3. a → (¬a → b)
   А еще в ИИВ главная фишка - недоказуемо A V ¬A (можно подобрать модель).
** Теорема Гливенко
   Если в ИВ доказуемо a, то в ИИВ доказуемо ¬¬a.

   Общий ход д-ва: говорим, что если в ИИВ доказуема F, то в ней же
   доказуема ¬¬F. Доказываем руками двойное отрицание 10 аксиомы и то
   же самое для MP.
** Порядки на множествах
   * Частичный порядок –- рефлексивное, антисимметричное, транзитивное
     отношение.
   * Частично упор. мн-во -- множество с частичным порядком на
     элементах.
   * Линейно упорядоч. мн-во -- множество с частичным порядком, в
     котором два любых элемента сравнимы.
   * Фундированное мн-во -- частично упорядоч. множество, в котором
     каждое непустое подмножество имеет минимальный элемент.
   * Вполне упорядоченное множество -- фундированное множество с
     линейным порядком.
** Решетки (все свойства)
   * Решетка
     Решетка - это (L, +, *) в алгебраическом смысле и (L, ≤) в порядковом.
     Решетку можно определить как алгебраическую структуру через
     аксиомы: коммутативность, ассоциативность, поглощение.
     Решетку можно определить как упорядоченное множество через
     множество с частичным порядком на нем, тогда операции +, * определяются
     как sup и inf:
     sup p = min {u | u ≥ all s ∈ p}
     inf p = max {u | u ≤ all s ∈ p}
     a + b = sup {a, b}
     a * b = inf {a, b}
     Если для двух элементов всегда можно определить a + b и a * b, то такое
     множество назывется решеткой.
   * Дистрибутивная решетка -- решетка, в которой работает дистрибутивность:
     a * (b + c) = (a * b) + (b * c)
   * Импликативная решетка -- всегда существует псевдодополнение b (b → a)
     a → b = max c | c * a ≤ b
     Имеет свойствa, что в ней всегда есть максимальный элемент a → a и что
     она дистрибутивна.
