mathlogic.tex
% Created 2015-01-21 Ср 20:41
\documentclass[11pt]{article}
\usepackage{fontspec}
\setmainfont{Palatino Linotype}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\date{\today}
\title{Курс математической логики по Штукенбергу Д.Г.}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 24.4.1 (Org mode 8.2.10)}}
\begin{document}

\maketitle
\tableofcontents

Должно отображаться корректно: x₁,x₂x₃xₙ, θ, ∃, ∑, ∉

Mykhail Volkhov, 2538, 2014Sep-2015Jan
Я не отвечаю за верность написанного - много информации
я придумал сам, много достал из недостоверных источников.

\section{Базовые понятия}
\label{sec-1}
\subsection{Формальные системы и модели}
\label{sec-1-1}
Сделано мной для меня самого, be careful

Мы работаем с формальными системами.
Формальная система определяется сигнатурой, грамматикой,
набором аксиом и набором правил вывода.
\begin{enumerate}
\item Сигнатура ФС - это (Pr, F, C, Links, Misc, arity):
\begin{itemize}
\item Pr - описывает предикаты (Num + BigLatinChar)
\item F - множество функций (большие заглавные латинские чары)
\item C - описывает константы
\item Links - множество связок (\{"->", "∪", " "\})
\item Misc - дополнительные элементы (\{"(", ")", " "\})
\item arity: Foo ∪ Pr ∪ C → N возвращает арность
\end{itemize}
\item Грамматика описывает то, как мы можем строить выражения
в соответствии с нашей сигнатурой.
\item Аксиомы - выражения в нашей грамматике.
\item Правила вывода – пары вида (List, List), где List -
список утверждений. Первый элемент – посылки, второй -
то, что из них следует.
\end{enumerate}

Иногда нам хочется что-то посчитать и мы прикручиваем к
формальной системе модель - корректную структуру с оценкой.
Структура - это сигнатура с интерпретацией и носителем.
\begin{enumerate}
\item Сигнатура структуры - (R, F, C, arity):
\begin{itemize}
\item Pr - множество символов для предикатов
\item F - функциональных символов
\item С - символов констант
\item arity – функция, определяющая арность Pr ∪ F → N.
\end{itemize}
\item Интерпретация - это приписывание символам значения
и правил действия (отображения из Pr ∪ F ∪ C в носитель)
\item Носитель - это объединение множеств, в котором обязательно
присутствует V - множество истинностных значений. Если же
мы рассматриваем только нульместные предикаты, на этом
можно остановится, otherwise часто вводится P - предметное
множество, в которое отображаются элементы из F, C.
\end{enumerate}
TODO Эта реализация структуры не определяет ничего в районе
аксиоматики, но аксиоматически заданные структуры существуют
– например в ФА есть Пеано.
Если все аксиомы тавтологии, то структура корректна.
В таком случае она называется моделью.

Оценку иногда определяют раньше$\backslash$позже чем модель, мне
удобно думать о ней, как об отдельной сущности, потому что
она связывает модель с ФС.
Оценка - это функция оценки и функция тавтологии.
\begin{enumerate}
\item Функция оценки - отображение из (множества всех формул,
сгенеренных грамматикой) x (какие-нибудь допаргументы)
в V модели. Дополнительные аргументы - например оценки
элементов связки.
\item Функция тавтологии - отображение из множества формул
грамматики в \{0, 1\} - является ли формула тавтологией.
Тавтология использует функцию оценки. Например, тавтология
\begin{itemize}
\item это выражение, оценка которого на любых аргументах
\end{itemize}
возвращает σ ∈ V - какой-то элемент V.
\end{enumerate}

Когда говорится "сигнатура модели" - имеется в виду ровно она.
Когда говорится "сигнатура ФС" - имеется в виду скорее всего
объединение сигнатур, а может только сигнатура самой ФС. Первый
вариант тут предпочтительней.
\section{Определения (нужно знать идеально)}
\label{sec-2}
Определения тут зачастую дублицируют то, что написано в самом
конспекте, поэтому удаление этого блока сэкономит бумагу при
печати.
\subsection{ИВ}
\label{sec-2-1}
Формальная система с алгеброй Яськовского J₀ в качестве модели, множество
истинностных значений \{0, 1\}. Формальная теория нулевого порядка, кванторов
нету, предикаты - это пропозициональные переменные.
Аксиомы:
\begin{enumerate}
\item a → b → a
\item (a → b) → (a → b → c) → (a → c)
\item a → b → a \& b
\item a \& b → a
\item a \& b → b
\item a → a V b
\item b → a V b
\item (a → b) → (c → b) → (a V c → b)
\item (a → b) → (a → ¬b) → ¬a
\item ¬¬a → a
\end{enumerate}
\subsection{Общезначимость, доказуемость, выводимость}
\label{sec-2-2}
\begin{itemize}
\item Общезначимость формулы - ее свойство в теории с моделью. Общезначимость
можно определить как угодно, в принципе. Например в ИВ общезначимость -
это что оценка формулы на любых значениях свободных переменных отображает
в 1. В модели крипке - существование формулы во всех мирах и т.д.
\item Доказуемость - свойство формулы в теории, значащее, что существует
доказательство для этой формулы. Доказательство для теории тоже определяется
по разному (последовательность утверждений, каждое из которых есть аксиома
или следует по правилу вывода из предыдущих в ИВ, дерево с выводами в S∞)
\item Выводимость - в общем случае часто используется как аналог доказуемости,
в ИВ это доказуемость из всего, что и ранее + из посылок.
\end{itemize}
\subsection{Теорема о дедукции для ИВ}
\label{sec-2-3}
Теорема, утверждающая, что из Г, a ⊢ b следует Г ⊢ a → b и наоборот.
Доказывается вправо поформульным преобразованием, влево
добавлением 1 формулы. Работает в ИВ, ИИВ, предикатах.
\subsection{Теорема о полноте исчисления высказываний}
\label{sec-2-4}
Типа исчисление предикатов полно относительно вот той булевой алгебры.
Общий ход д-ва: строим док-ва для конкретных наборов перменных,
2$^{\text{n}}$, где n - количество возможных переменных. Потом их мерджим.
\subsection{ИИВ}
\label{sec-2-5}
Это такое ИВ, в котором убрали десятую аксиому, а вместо нее
добавили 10i.
10i: a → ¬a → b
Кстати она доказывается и в ИВ
\begin{enumerate}
\item (a → aV¬a) → (a → aV¬a → (¬a → b)) → a → (¬a → b)
\item a, aV¬a, ¬a ⊢ b
a
¬a
b → a
b → ¬a
(b → a) → (b → ¬a) → ¬b
¬b → a
¬b → ¬a
(¬b → a) → (¬b → ¬a) → ¬¬b
¬¬b → b
b
\item a → (¬a → b)
\end{enumerate}
А еще в ИИВ главная фишка - недоказуемо A V ¬A (можно подобрать модель).
\subsection{Теорема Гливенко}
\label{sec-2-6}
Если в ИВ доказуемо a, то в ИИВ доказуемо ¬¬a
Общий ход д-ва: говорим, что если в ИИВ доказуема F,
то в ней же доказуема ¬¬F. Доказываем руками двойное
отрицание 10 аксиомы и то же самое для MP.
\subsection{Порядки}
\label{sec-2-7}
Частичный порядок – рефлексивное, антисимметричное, транзитивное
отношение.
Частично упор. мн-во - множество с частичным порядком на элементах.
Линейно упорядоч. мн-во - множество с частичным порядком, в котором
два любых элемента сравнимы.
Фундированное мн-во - частично упорядоч. множество, в котором каждое
непустое подмножество имеет минимальный элемент.
Вполне упорядоченное множество - фундированное множество с линейным
порядком.
\subsection{Решетки (все свойства)}
\label{sec-2-8}
\begin{itemize}
\item Решетка
Решетка - это (L, +, *) в алгебраическом смысле и (L, ≤) в порядковом.
Решетку можно определить как алгебраическую структуру через
аксиомы: коммутативность, ассоциативность, поглощение.
Решетку можно определить как упорядоченное множество через
множество с частичным порядком на нем, тогда операции +, * определяются
как sup и inf:
sup p = min \{u | u ≥ all s ∈ p\}
inf p = max \{u | u ≤ all s ∈ p\}
a + b = sup \{a, b\}
a * b = inf \{a, b\}
Если для двух элементов всегда можно определить a + b и a * b, то такое
множество назывется решеткой.
\item Дистрибутивная решетка -- решетка, в которой работает дистрибутивность:
a * (b + c) = (a * b) + (b * c)
\item Импликативная решетка -- всегда существует псевдодополнение b (b → a)
a → b = max c | c * a ≤ b
Имеет свойствa, что в ней всегда есть максимальный элемент a → a и что
она дистрибутивна.
\end{itemize}
