mathlogic/mathlogic.org
** Булевы\псевдобулевы алгебры
   * Булева алгебра можно определить так:
     1. (L, +, *, -, 0, 1) с выполненными аксиомами - коммутативность,
        ассоциативность, поглощение, две дистрибутивности и a * -a = 0,
        a + -a = 1.
     2. Импликативная решетка над фундированным множеством.

        Тогда мы в ней определим 1 как a → a (традиционно для
        импликативной), отрицание как -a = a → 0, и тогда последняя
        аксиома из предыдущего определения будет свойством:

        a * -a = a * (a → 0) = a * (max c: c * a ≤ 0) = a * 0 = 0

        Насчет второй аксиомы - должно быть 1. То есть лучше как-то
        через аксиомы определять, видимо.

        a + -a = a + (a → 0) = a + (max c: c * a ≤ 0) = a + 0 = a //
        не 1
   * Псевдобулева алгебра - это импликативная решетка над
     фундированным множеством с ¬a = (a → 0)
** Топологическая интерпретация ИИВ
   Булеву алгебру и алгебру Гейтинга можно интерпретировать
   на множестве Rⁿ. Тогда заключения о общезначимости формулы
   можно делать более наглядно.
   Давайте возьмем в качестве множества алгебры все открытые
   подмножества Rⁿ. Определим операции следующим образом:
   1. a + b => a ∪ b
   2. a * b => a ∩ b
   3. a → b => Int(aᶜ ∪ b)
   4. -a => Int(aᶜ)
   5. 0 => ∅
   6. 1 => ⋃{всех мн-в в L}
** Модель Kрипке
   Var = {P, Q, ...}
   Модель Крипке – это <W, ≤, v>, где
   * W - множество "миров"
   * ≤ - частичный порядок на W (отношение достижимости)
   * v: W × Var → {0, 1, _} - оценка перменных на W, монотонна
     (если v(x, P) = 1, x ≤ y, то v(y, P) = 1 – формулу нельзя un'вынудить)

   Правила:
   * W, x ⊨ P ⇐⇒ v(x, P) = 1 если P ∈ Var
   * W, x ⊨ (A & B) ⇐⇒ W, x ⊨ A & W, x ⊨ B
   * W, x ⊨ (A V B) ⇐⇒ W, x ⊨ A V W, x ⊨ B
   * W, x ⊨ (A → B) ⇐⇒ ∀ y ≥ x (W, y ⊨ A ⇒ W, y ⊨ B)
   * W, x ⊨ ¬A ⇐⇒ ∀ y ∈ x (W, x ¬⊨ A)

   В мире разрешается быть не вынужденной переменной и ее отрицанию
   одновремеменно.

   Формула называется тавтологией в ИИВ с моделью Крипке, если она
   истинна (вынуждена) в любом мире любой модели Крипке.
** Вложение Крипке в алгебры Гейтинга
   Возьмем модель Крипке, возьмем какое-то объединение поддеревьев со
   всеми потомками, каждое такое объединение пусть будет входить в
   алгебру Гейтинга. ≤ - отношение "быть подмножеством". Определим 0
   как ∅ (пустое объединение поддеревьев);

   Определим операции:
   1. + = ∪, * = ∩,
   2. a → b = ∪{z ∈ H | z ≤ xᶜ ∪ y}

   Так созданное множество с операциями является импликативной
   решеткой, в которой мы определим -a = a → 0, получим булеву
   алгебру.
** Полнота ИИВ в алгебрах Гейтинга и моделях Крипке
   ИИВ полно относительно алгебр Гейтинга и моделей Крипке.

   Общий ход доказательства первого сводится к вложению в Гейтинга
   алгебры Линденбаума-Тарского, а второго -- к построению
   дизъюнктивного множества всех доказуемых формул, являющегося миром
   Крипке.
** Нетабличность ИИВ
   Не существует полной модели, которая может быть выражена таблицей
   (конечной -– алгебра Гейтинга и Крипке не табличны, так как и там и
   там связки определяются иначе).

   От противного соорудим табличную модель и покажем, что она не
   полна, привев пример большой дизъюнкции из импликаций, для которой
   можно построить модель Крипке в которой она не общезначима.
** Предикаты
   Теория первого порядка, расширяющая исчисление высказываний.
   Добавляются две новые аксиомы
   ∀x.A → A[x:=θ], где θ свободна для подстановки в A
   A[x:=θ] → ∃x.A, -//-

   Правила вывода:
   _A_→_B_
   A → ∀x.B        x не входит сводобно в А

   _A_→_B_
   ∃x.A → B        x не входит свободно в В
** Теорема о дедукции в предикатах
   Аналогично 1 теореме о дедукции в ИВ, но в доказательстве должны
   отсутствовать применения правил для кванторов по переменным
   входящих свободно в выражение γ

   Γ, γ ⊢ a => Γ ⊢ γ → a
** Теорема о полноте исчисления предикатов
   Исчисление предикатов полно (заметим, что относительно любой
   модели). Суть в том, что если предикаты непротиворечивы, то у них
   есть модель. Если у них есть модель, то типа там можно по
   контрпозиции показать ⊨a.
** Теории первого порядка, определение структуры и модели
   Теория первого порядка - это формальная система с кванторами по
   функциональным символам, но не по предикатам. Рукомахательное
   определение – это фс с логикой первого порядка в основе, в которой
   абстрактные предикаты и функциональные символы определяются точно
   (а может такое определение даже лучше).

   Структура по ДГ:
   Структурой теории первого порядка мы назовем упорядоченную тройку
   <D, F, P>, где F — списки оценок для 0-местных, 1-местных и т.д.
   функций, и P = hP 0 , P 1 , ...i — списки оценок для 0-местных,
   1-местных и т.д. предикатов, D — предметное множество.

   Понятие структуры — развитие понятия оценки из исчисления предикатов.
   Но оно касается только нелогических составляющих теории; истинностные
   значения и оценки для связок по-прежнему определяются исчислением
   предикатов, лежащим в основе теории. Для получения оценки формулы
   нам нужно задать структуру, значения всех свободных индивидных
   переменных, и (естественным образом) вычислить результат.

   Структура по-моему:
   Все то же самое определение из ИВ. Мы просто забиваем на предикаты
   в ИВ (не определям их), расширяем нашу сигнатуру (добавляя конкретные
   предикаты и функциональные символы), определяем для нее интерпретацию.

   И как всегда,..
   Модель – это корректная структура (любое доказуемое утверждение должно
   быть в ней общезначимо).
** Аксиоматика Пеано
   Множество N удовлетворяет аксиоматике Пеано, если:
   1. 0 ∈ N
   2. x ∈ N, succ(x) ∈ N
   3. ∄ x ∈ N : (succ(x) = 0)
   4. (succ(a) = c & succ(b) = c) → a = b
   5. P(0) & ∀n.(P(n) → P(succ(n))) → ∀n.P(n)
** Формальная арифметика - аксиомы
   Формальная арифметика - это теория первого порядка, у которой
   сигнатура определена как: (циферки, логические связки, алгебр.
   связки, '), а интерпретацию сейчас будем определять.

   Интерпретация определяет два множества - V, P - истинностные и
   предметные значения. Пусть множество V = {0, 1} по-прежнему.

   P = {всякие штуки, которые мы можем получать из логических связок и
   0}.

   Определим оценки логических связок естественным образом.

   Определим алгебраические связки так:
   +(a, 0) = a
   +(a, b') = (a + b)'
   *(a, 0) = 0
   *(a, b') = a * b + a
*** Аксиомы
    1. a = b → a' = b'
    2. a = b → a = c → b = c
    3. a' = b' → a = b
    4. ¬(a' = 0)
    5. a + b' = (a + b)'
    6. a + 0 = a
    7. a * 0 = 0
    8. a * b' = a * b + a
    9. φ[x:=0] & ∀x.(φ → φ[x:=x']) → φ // φ содержит св.п x
** Рекурсивные функции
   1. Z(x) = 0
   2. N(x) = x + 1
   3. Uₙᵢ(x₁...xₙ) = xᵢ
   4. S<f, g₁...gₙ>(x₁...xₘ) = f(g₁(x₁...xₘ),...gₙ(x₁...xₘ))
   5. R<f, g>(x₁...xₙ, n) = if n = 0
                            then f(x₁...xₙ)
                            else g(x₁...xₙ, n, R<f, g>(x₁...xₙ, n - 1))
   6. μ<f>(x₁...xₙ) - min k : f(x₁...xₙ, k) = 0
** Функция Аккермана
   A(0, n) = n + 1
   A(m, 0) = A(m - 1, 1)
   A(m, n) = A(m - 1, A(m, n - 1))
** Существование рек.ф-й не явл. ф-ей Аккермана (определение конечной леммы)
    Пусть f(n₁...nₖ) - примитивная рекурсинвная функция, k ≥ 0.
    ∃J:f(n₁...nₖ)<A(J, ∑(n₁,...nₖ))
    Доказывается индукцией по рекурсивным функциям.
** Представимость
   Функция f:Nⁿ→N называется представимой в формальной арифметике, если
   существует отношение a(x₁...xₙ₊₁), ее представляющее, причем выполнено
   следующее:
   1. f(a,b,...) = x <=> ⊢ a(a~,b~,...x~)
   2. ∃!x.f(a,b,...x) (вот это свойство вроде бы не обязательно, но ДГ его писал).
