mathlogic.tex
\subsection{Булевы$\backslash$псевдобулевы алгебры}
\label{sec-2-9}
\begin{itemize}
\item Булева алгебра можно определить так:
\begin{enumerate}
\item (L, +, *, -, 0, 1) с выполненными аксиомами - коммутативность,
ассоциативность, поглощение, две дистрибутивности и a * -a = 0,
a + -a = 1.
\item Импликативная решетка над фундированным множеством.
Тогда мы в ней определим 1 как a → a (традиционно для импликативной),
отрицание как -a = a → 0, и тогда последняя аксиома из
предыдущего определения будет свойством:
a * -a = a * (a → 0) = a * (max c: c * a ≤ 0) = a * 0 = 0
Насчет второй аксиомы - должно быть 1. То есть лучше как-то
через аксиомы определять, видимо.
a + -a = a + (a → 0) = a + (max c: c * a ≤ 0) = a + 0 = a // не 1
\end{enumerate}
\item Псевдобулева алгебра - это импликативная решетка над фундированным
множеством с ¬a = (a → 0)
\end{itemize}
\subsection{Топологическая интерпретация ИИВ}
\label{sec-2-10}
Булеву алгебру и алгебру Гейтинга можно интерпретировать
на множестве Rⁿ. Тогда заключения о общезначимости формулы
можно делать более наглядно.
Давайте возьмем в качестве множества алгебры все открытые
подмножества Rⁿ. Определим операции следующим образом:
\begin{enumerate}
\item a + b => a ∪ b
\item a * b => a ∩ b
\item a → b => Int(aᶜ ∪ b)
\item -a => Int(aᶜ)
\item 0 => ∅
\item 1 => ⋃\{всех мн-в в L\}
\end{enumerate}
\subsection{Модель Kрипке}
\label{sec-2-11}
Var = \{P, Q, \ldots{}\}
Модель Крипке – это <W, ≤, v>, где
\begin{itemize}
\item W - множество "миров"
\item ≤ - частичный порядок на W (отношение достижимости)
\item v: W × Var → \{0, 1, \_\} - оценка перменных на W, монотонна
(если v(x, P) = 1, x ≤ y, то v(y, P) = 1 – формулу нельзя un'вынудить)
\end{itemize}

Правила:
\begin{itemize}
\item W, x ⊨ P ⇐⇒ v(x, P) = 1 если P ∈ Var
\item W, x ⊨ (A \& B) ⇐⇒ W, x ⊨ A \& W, x ⊨ B
\item W, x ⊨ (A V B) ⇐⇒ W, x ⊨ A V W, x ⊨ B
\item W, x ⊨ (A → B) ⇐⇒ ∀ y ≥ x (W, y ⊨ A ⇒ W, y ⊨ B)
\item W, x ⊨ ¬A ⇐⇒ ∀ y ∈ x (W, x ¬⊨ A)
\end{itemize}

В мире разрешается быть не вынужденной переменной и ее отрицанию
одновремеменно.
Формула называется тавтологией в ИИВ с моделью Крипке, если она
истинна (вынуждена) в любом мире любой модели Крипке.
\subsection{Вложение Крипке в алгебры Гейтинга}
\label{sec-2-12}
Возьмем модель Крипке, возьмем какое-то объединение поддеревьев
со всеми потомками, каждое такое объединение пусть будет входить
в алгебру Гейтинга. ≤ - отношение "быть подмножеством".
Определим 0 как ∅ (пустое объединение поддеревьев);
Определим операции:
\begin{itemize}
\item = ∪, * = ∩,
\end{itemize}
a → b = ∪\{z ∈ H | z ≤ xᶜ ∪ y\}
Так созданное множество с операциями является импликативной
решеткой, в которой мы определим -a = a → 0, получим булеву алгебру.
\subsection{Полнота ИИВ в алгебрах Гейтинга и моделях Крипке}
\label{sec-2-13}
ИИВ полно относительно алгебр Гейтинга и моделей Крипке.
Общий ход доказательства первого сводится к вложению
в Гейтинга алгебры Линденбаума-Тарского, а второго -
к построению дизъюнктивного множества всех доказуемых
формул, являющегося миром Крипке.
\subsection{Нетабличность ИИВ}
\label{sec-2-14}
Не существует полной модели, которая может быть выражена таблицей
(конечной – алгебра Гейтинга и Крипке не табличны, так как и там и
там связки определяются иначе).
От противного соорудим табличную модель и покажем, что она не полна,
привев пример большой дизъюнкции из импликаций, для которой можно
построить модель Крипке в которой она не общезначима.
\subsection{Предикаты}
\label{sec-2-15}
Теория первого порядка, расширяющая исчисление высказываний.
Добавляются две новые аксиомы
∀x.A → A[x:=θ], где θ свободна для подстановки в A
A[x:=θ] → ∃x.A, -//-

Правила вывода:
\uline{A$_{\text{→}}$$_{\text{B}}$}
A → ∀x.B        x не входит сводобно в А

\uline{A$_{\text{→}}$$_{\text{B}}$}
∃x.A → B        x не входит свободно в В
\subsection{Теорема о дедукции в предикатах}
\label{sec-2-16}
Аналогично 1 теореме о дедукции в ИВ, но в доказательстве должны
отсутствовать применения правил для кванторов по переменным входящих
свободно в выражение γ
Γ, γ ⊢ a => Γ ⊢ γ → a
\subsection{Теорема о полноте исчисления предикатов}
\label{sec-2-17}
Исчисление предикатов полно (заметим, что относительно любой модели).
Суть в том, что если предикаты непротиворечивы, то у них есть модель.
Если у них есть модель, то типа там можно по контрпозиции показать ⊨a.
\subsection{Теории первого порядка, определение структуры и модели}
\label{sec-2-18}
Теория первого порядка - это формальная система с кванторами по
функциональным символам, но не по предикатам. Рукомахательное
определение – это фс с логикой первого порядка в основе, в которой
абстрактные предикаты и функциональные символы определяются точно
(а может такое определение даже лучше).

Структура по ДГ:
Структурой теории первого порядка мы назовем упорядоченную тройку
<D, F, P>, где F — списки оценок для 0-местных, 1-местных и т.д.
функций, и P = hP 0 , P 1 , \ldots{}i — списки оценок для 0-местных,
1-местных и т.д. предикатов, D — предметное множество.

Понятие структуры — развитие понятия оценки из исчисления предикатов.
Но оно касается только нелогических составляющих теории; истинностные
значения и оценки для связок по-прежнему определяются исчислением
предикатов, лежащим в основе теории. Для получения оценки формулы
нам нужно задать структуру, значения всех свободных индивидных
переменных, и (естественным образом) вычислить результат.

Структура по-моему:
Все то же самое определение из ИВ. Мы просто забиваем на предикаты
в ИВ (не определям их), расширяем нашу сигнатуру (добавляя конкретные
предикаты и функциональные символы), определяем для нее интерпретацию.

И как всегда,..
Модель – это корректная структура (любое доказуемое утверждение должно
быть в ней общезначимо).
\subsection{Аксиоматика Пеано}
\label{sec-2-19}
Множество N удовлетворяет аксиоматике Пеано, если:
\begin{enumerate}
\item 0 ∈ N
\item x ∈ N, succ(x) ∈ N
\item ∄ x ∈ N : (succ(x) = 0)
\item (succ(a) = c \& succ(b) = c) → a = b
\item P(0) \& ∀n.(P(n) → P(succ(n))) → ∀n.P(n)
\end{enumerate}
\subsection{Формальная арифметика - аксиомы}
\label{sec-2-20}
Формальная арифметика - это теория первого порядка, у которой
сигнатура определена как: (циферки, логические связки, алгебр.
связки, '), а интерпретацию сейчас будем определять.
Интерпретация определяет два множества - V, P - истинностные и
предметные значения. Пусть множество V = \{0, 1\} по-прежнему.
P = \{всякие штуки, которые мы можем получать из логических связок и 0\}
Определим оценки логических связок естественным образом.
Определим алгебраические связки так:
+(a, 0) = a
+(a, b') = (a + b)'
*(a, 0) = 0
*(a, b') = a * b + a
\subsubsection{Аксиомы}
\label{sec-2-20-1}
\begin{enumerate}
\item a = b → a' = b'
\item a = b → a = c → b = c
\item a' = b' → a = b
\item ¬(a' = 0)
\item a + b' = (a + b)'
\item a + 0 = a
\item a * 0 = 0
\item a * b' = a * b + a
\item φ[x:=0] \& ∀x.(φ → φ[x:=x']) → φ // φ содержит св.п x
\end{enumerate}
\subsection{Рекурсивные функции}
\label{sec-2-21}
Z(x) = 0
N(x) = x + 1
Uₙᵢ(x₁\ldots{}xₙ) = xᵢ
S<f, g₁\ldots{}gₙ>(x₁\ldots{}xₘ) = f(g₁(x₁\ldots{}xₘ),\ldots{}gₙ(x₁\ldots{}xₘ))
R<f, g>(x₁\ldots{}xₙ, n) = if n = 0
f(x₁\ldots{}xₙ)
else g(x₁\ldots{}xₙ, n, R<f, g>(x₁\ldots{}xₙ, n - 1))
μ<f>(x₁\ldots{}xₙ) - минимальное k, такое что f(x₁\ldots{}xₙ, k) = 0
\subsection{Функция Аккермана}
\label{sec-2-22}
A(0, n) = n + 1
A(m, 0) = A(m - 1, 1)
A(m, n) = A(m - 1, A(m, n - 1))
\subsection{Существование рек.ф-й не явл. ф-ей Аккермана (определение конечной леммы)}
\label{sec-2-23}
Пусть f(n₁\ldots{}nₖ) - примитивная рекурсинвная функция, k ≥ 0.
∃J:f(n₁\ldots{}nₖ)<A(J, ∑(n₁,\ldots{}nₖ))
Доказывается индукцией по рекурсивным функциям.
\subsection{Представимость}
\label{sec-2-24}
Функция f:Nⁿ→N называется представимой в формальной арифметике, если
существует отношение a(x₁\ldots{}xₙ₊₁), ее представляющее, причем выполнено
следующее:
\begin{enumerate}
\item f(a,b,\ldots{}) = x <=> ⊢ a(a\textasciitilde{},b\textasciitilde{},\ldots{}x\textasciitilde{})
\item ∃!x.f(a,b,\ldots{}x) (вот это свойство вроде бы не обязательно, но ДГ его писал).
\end{enumerate}
