mathlogic/mathlogic.org
** Выразимость
   Отношение n называется выразимым, если существует предикат N его
   выражающий, такой что
   1. n(x₁...xₙ) истинно => ⊢ N(x₁~, ...xₙ~)
   2. n(x₁...xₙ) ложно => ⊢ ¬N(x₁~, ...xₙ~)
** Лемма о связи представимости и выразимости
   Если n выразимо, то Cₙ представимо.
   Cₙ = 1 если n, и нулю если !n
** Бета-функция Гёделя, Г-последовательность
   β(b, c, i) = kᵢ
   Функция, отображающая конечную последовательность из N (aᵢ) в kᵢ.
   Работает через магию, математику, простые числа и Гёделеву
   последовательность, которая подходит под условия китайской
   теоремы об остатках.
   β(b, c, i) = b % ((i + 1) * c + 1)
** Представимость рек.ф-й в ФА (знать формулы для самых простых)
   Рекурсивные функции представимы в ФА
   1. z(a, b) = (a = a) & (b = 0)
   2. n(a, b) = (a = b')
   3. uₙᵢ = (x₁ = x₁) & ... & (xₙ = xₙ) & (xₙ₊₁ = xᵢ)
   4. s(a₁...aₘ, b) = ∃b₁...∃bₙ(G₁(a₁...aₙ, b₁) & ... & Gn(a₁...aₘ, bₙ)
   5. r(x₁...xₙ, k, a) =
      ∃b∃c(
           ∃k(β(b, c, 0, k) & φ(x₁...xₙ, k))
           & B(b, c, xₙ₊₁, a)
           & ∀k(k<xₙ₊₁ → ∃d∃e(B(b,c,k,d)&B(b,c,k',e)&G(x₁...xₙ,k,d,e))))

   6. m<F>(x₁...xₙ₊₁) = F(x₁...xₙ, xₙ₊₁, 0) & ∀y((y < xₙ₊₁) → ¬F(x₁...xₙ, y, 0))
** Гёделева нумерация (точно)
   | a   |             `a | описание                              |
   |-----+----------------+---------------------------------------|
   | (   |              3 |                                       |
   | )   |              5 |                                       |
   | ,   |              7 |                                       |
   | ¬   |              9 |                                       |
   | →   |             11 |                                       |
   | V   |             13 |                                       |
   | &   |             15 |                                       |
   | ∀   |             17 |                                       |
   | ∃   |             19 |                                       |
   | xₖ  |     21 + 6 * k | переменные                            |
   | fⁿₖ | 23 + 6 *ᵏ * 3ⁿ | n-местные функцион. символы (', +, *) |
   | Pⁿₖ | 25 + 6 *ᵏ * 3ⁿ | n-местные предикаты (=)               |
   |-----+----------------+---------------------------------------|

** Выводимость и рекурсивные функции (че там с Тьюрингом)
   Основные тезисы по вопросу:
   * Emulate(input, prog) = plog(R<f,g>(<`S, input, 0>,  , pb, pc, tb, tc, steps(-//-)), 1) == F
   * Proof(term, proof) = Emulate(proof, MY_PROOFCHECKER) && (plog(proof, len(proof)) = term)
   * Любая представимая в ФА ф-я является рекурсивной
     f(x₁...xₙ) = plog(μ<S<G_φ, Uₙ₊₁,₁,... Uₙ₊₁,ₙ,
     plog(Uₙ₊₁,ₙ₊₁, 1),
     plog(Uₙ₊₁,ₙ₊₁, 2)>>(x₁...xₙ), 1).
     G_φ тут принимает n + 2 аргумента: x₁...xₙ, p, b и возвращает 0 если
     p - доказательство φ(x₁...xₙ, p), представляющего f.
** Непротиворечивость
   Теория непротиворечива, если в ней нельзя одновременно вывести a и
   ¬a.

   Одновременная выводимость ¬a и a эквивалентна выводимости a & ¬a.
** w-непротиворечивость
   Теория ω-непротиворечива, если из ∀φ(x) ⊢φ(x~) следует ⊬
   ∃p¬φ(p). Проще говоря, если мы взяли формулу, то невозможно вывести
   одновременно ∃x¬A(x) и A(0), A(1), ...
** Первая теорема Гёделя о неполноте
   1. Если формальная арифметика непротиворечива, то недоказуемо
      σ(`σ~)
   2. Если формальная арифметика w-непротиворечива, то недоказуемо
      ¬σ(`σ~)
** Первая теорема Гёделя о неполноте в форме Россера
   Если формальная арифметика непротиворечива, то в ней найдется
   такая формула φ, что ⊬φ и ⊬¬φ
** Consis
   Consis - утверждение, формально доказывающее непротиворечивость ФА
   То есть ⊢ Consis => ФА непротиворечива
** Условия Г-Б (наизусть)
   Пусть πg(x, p) выражает Proof(x, p).
   π(x) = ∃t.πg(x, t) действительно показывает,
   что выражение доказуемо, если
   1. ⊢ a => ⊢ π(`a~)
   2. ⊢ π(`a~) → π(`π(`a~)~)
   3. ⊢ π(`a~) → π(`(a → b)~) → π(`b~)
** Лемма о самоприменении
   a(x) - формула, тогда ∃b такой что
   1. ⊢ a(`b~) → b
   2. ⊢ β → a(`b~)
** Вторая теорема Гёделя о неполноте ФА
   Если теория непротиворечива, в ней ⊬ Consis
** Теория множеств
   Теория множеств - теория первого порядка, в которой
   есть единственный предикат ∈ (в ФА был =), есть связка
   ←→, есть пустое множество, операции пересечения и
   объединения.
   x ∩ y = z, тогда ∀t(t ∈ z ←→ t ∈ x & t ∈ y)
   x ∪ y = z, тогда ∀t(t ∈ z ←→ t ∈ x V t ∈ y)
   Dj(x) ∀a∀b(a ∈ x & b ∈ x & a ≠ b → a ∩ b = ∅)
** ZFC
*** Аксиома равенства
    ∀x∀y∀z((x = y & y ∈ z) → x ∈ z)
    Eсли два множества равны, то любой элемент лежащий в первом,
    лежит и во втором
*** Аксиома пары
    ∀x∀y(¬(x=y) → ∃p(x ∈ p & y ∈ p & ∀z(z ∈ p → (x = z V y = z))))
    x ≠ y, тогда сущ. {x, y}
*** Аксиома объединений
    ∀x(∃y(y∈x) → ∃p∀y(y ∈ p ←→ ∃s(y ∈ s & s ∈ x)))
    Eсли x не пусто, то из любого семейства множеств можно
    образовать „кучу-малу“, то есть такое множество p,
    каждый элемент y которого принадлежит по меньшей мере
    одному множеству s данного семейства s x
*** Аксиома степени
    ∀x∃p∀y(y ∈ p ←→ y ∈ x)
    P(x) - множество степени x (не путать с 2ˣ - булеаном)
    Это типа мы взяли наш x, и из его элементов объединением и
    пересечением например понаобразовывали кучу множеств, а потом
    положили их в p.
*** Схема аксиом выделения
    ∀x∃b∀y(y ∈ b ←→ (y ∈ x & φ(y)))
    Для нашего множества x мы можем подобрать множество побольше,
    на котором для всех элементов, являющихся подмножеством x
    выполняется предикат.
*** Аксиома выбора (не входит в ZF по дефолту)
    Если a = Dj(x) и a ≠ 0, то x ∈ a ≠ 0
*** Аксиома бесконечности
    ∃N(∅ ∈ N & ∀x(x ∈ N → x ∪ {x} ∈ N))
*** Аксиома фундирования
    ∀x(x = ∅ V ∃y(y ∈ x & y ∩ x = ∅))
    ∀x(x ≠ ∅ → ∃y(y ∈ x & y ∩ x = ∅))
    Равноценные формулы.

    Я бы сказал, что это звучит как-то типа
    "не существует бесконечно вложенных множеств"
*** Схема аксиом подстановки
    ∀x∃!y.φ(x,y) → ∀a∃b∀c(c ∈ b ←→ (∃d.(d ∈ a & φ(d, c))))
    Пусть формула φ такова, что для при любом x найдется единственный y
    такой, чтобы она была истинна на x, y, тогда для любого a
    найдется множество b, каждому элементу которого c можно сопоставить
    подмножество a и наша функция будет верна на нем и на c
    Типа для хороших функций мы можем найти множество с отображением из
    его элементов в подмножество нашего по предикату.

** Ординальные числа, операции
   * Определение вполне упорядоченного множества (фундированное
     с линейныи порядком).
   * Определение транзитивного множества
     Множество X транзитивно, если
     ∀a∀b((a ∈ b & b ∈ x) → a ∈ x)
   * Ординал - транзитивное вполне упорядоченное отношением ∈ мн-во
   * Верхняя грань множества ординалов S
     C | {C = min(X) & C ∈ X | X = {z | ∀(y∈S)(z ≥ y)}}
     C = Upb(S)
     Upb({∅}) = {∅}
   * Successor ordinal (сакцессорный ординал?)
     Это b = a' = a ∪ {a}
   * Предельны ординал
     Ординал, не являющийся ни 0 ни successor'ом.
   * Недостижимый ординал
     ε - такой ординал, что ε = w^ε
     ε₀ = Upb(w, w^w, w^w^w, w^w^w^w, ...) - минимальный из ε
   * Канторова форма - форма вида ∑(a*w^b+c), где b - ординал, последовательность
     строго убывает по b. Есть слабая канторова форма, где вместо a (a ∈ N)
     пишут a раз w^b. В канторовой форме приятно заниматься сложениями и
     прочим, потому что всякие upb - слишком ниочем.

    x + 0       = x
    x + c'      = (x + c)'
    x + lim(a)  = Upb{x + c | c < a}

    x * 0       = 0
    x * c'      = x * c + x
    x * lim(a)  = Upb{x * c | c < a}

    x ^ 0       = 1
    x ^ c'      = (x ^ c) * x
    x ^ lim(a)  = Upb{x ^ c | c < a}
