mathlogic.tex
\subsection{Выразимость}
\label{sec-2-25}
Отношение n называется выразимым, если существует предикат N его
выражающий, такой что
\begin{enumerate}
\item n(x₁\ldots{}xₙ) истинно => ⊢ N(x₁\textasciitilde{}, \ldots{}xₙ\textasciitilde{})
\item n(x₁\ldots{}xₙ) ложно => ⊢ ¬N(x₁\textasciitilde{}, \ldots{}xₙ\textasciitilde{})
\end{enumerate}
\subsection{Лемма о связи представимости и выразимости}
\label{sec-2-26}
Если n выразимо, то Cₙ представимо.
Cₙ = 1 если n, и нулю если !n
\subsection{Бета-функция Гёделя, Г-последовательность}
\label{sec-2-27}
β(b, c, i) = kᵢ
Функция, отображающая конечную последовательность из N (aᵢ) в kᵢ.
Работает через магию, математику, простые числа и Гёделеву
последовательность, которая подходит под условия китайской
теоремы об остатках.
β(b, c, i) = b \% ((i + 1) * c + 1)
\subsection{Представимость рек.ф-й в ФА (знать формулы для самых простых)}
\label{sec-2-28}
Рекурсивные функции представимы в ФА
\begin{enumerate}
\item z(a, b) = (a = a) \& (b = 0)
\item n(a, b) = (a = b')
\item uₙᵢ = (x₁ = x₁) \& \ldots{} \& (xₙ = xₙ) \& (xₙ₊₁ = xᵢ)
\item s(a₁\ldots{}aₘ, b) = ∃b₁\ldots{}∃bₙ(G₁(a₁\ldots{}aₙ, b₁) \& \ldots{} \& Gn(a₁\ldots{}aₘ, bₙ)
\item r(x₁\ldots{}xₙ, k, a) =
∃b∃c(
     ∃k(β(b, c, 0, k) \& φ(x₁\ldots{}xₙ, k))
     \& B(b, c, xₙ₊₁, a)
     \& ∀k(k<xₙ₊₁ → ∃d∃e(B(b,c,k,d)\&B(b,c,k',e)\&G(x₁\ldots{}xₙ,k,d,e))))

\item m<F>(x₁\ldots{}xₙ₊₁) = F(x₁\ldots{}xₙ, xₙ₊₁, 0) \& ∀y((y < xₙ₊₁) → ¬F(x₁\ldots{}xₙ, y, 0))
\end{enumerate}
\subsection{Гёделева нумерация (точно)}
\label{sec-2-29}
\begin{center}
\begin{tabular}{lrl}
a & `a & описание\\
\hline
( & 3 & \\
) & 5 & \\
, & 7 & \\
¬ & 9 & \\
→ & 11 & \\
V & 13 & \\
\& & 15 & \\
∀ & 17 & \\
∃ & 19 & \\
xₖ & 21 + 6 * k & переменные\\
fⁿₖ & 23 + 6 *ᵏ * 3ⁿ & n-местные функцион. символы (', +, *)\\
Pⁿₖ & 25 + 6 *ᵏ * 3ⁿ & n-местные предикаты (=)\\
\hline
\end{tabular}
\end{center}

\subsection{Выводимость и рекурсивные функции (че там с Тьюрингом)}
\label{sec-2-30}
Основные тезисы по вопросу:
\begin{itemize}
\item Emulate(input, prog) = plog(R<f,g>(<`S, input, 0>,  , pb, pc, tb, tc, steps(-//-)), 1) == F
\item Proof(term, proof) = Emulate(proof, MY$_{\text{PROOFCHECKER}}$) \&\& (plog(proof, len(proof)) = term)
\item Любая представимая в ФА ф-я является рекурсивной
f(x₁\ldots{}xₙ) = plog(μ<S<G$_{\text{φ}}$, Uₙ₊₁,₁,\ldots{} Uₙ₊₁,ₙ,
plog(Uₙ₊₁,ₙ₊₁, 1),
plog(Uₙ₊₁,ₙ₊₁, 2)>>(x₁\ldots{}xₙ), 1).
G$_{\text{φ}}$ тут принимает n + 2 аргумента: x₁\ldots{}xₙ, p, b и возвращает 0 если
p - доказательство φ(x₁\ldots{}xₙ, p), представляющего f.
\end{itemize}
\subsection{Непротиворечивость}
\label{sec-2-31}
Теория непротиворечива, если в ней нельзя одновременно
вывести a и ¬a.
Одновременная выводимоbm ¬a и a эквивалента выводимости
a \& ¬a
\subsection{w-непротиворечивость}
\label{sec-2-32}
Теория ω-непротиворечива, если из ∀φ(x) ⊢φ(x\textasciitilde{}) следует
⊬ ∃p¬φ(p). Проще говоря, если мы взяли
формулу, то невозможно вывести одновременно ∃x¬A(x)
и A(0), A(1), \ldots{}
\subsection{Первая теорема Гёделя о неполноте}
\label{sec-2-33}
\begin{enumerate}
\item Если формальная арифметика непротиворечива, то недоказуемо σ(`σ\textasciitilde{})
\item Если формальная арифметика w-непротиворечива, то недоказуемо ¬σ(`σ\textasciitilde{})
\end{enumerate}
\subsection{Первая теорема Гёделя о неполноте в форме Россера}
\label{sec-2-34}
Если формальная арифметика непротиворечива, то в ней найдется
такая формула φ, что ⊬φ и ⊬¬φ
\subsection{Consis}
\label{sec-2-35}
Consis - утверждение, формально доказывающее непротиворечивость ФА
То есть ⊢ Consis => ФА непротиворечива
\subsection{Условия Г-Б (наизусть)}
\label{sec-2-36}
Пусть πg(x, p) выражает Proof(x, p).
π(x) = ∃t.πg(x, t) действительно показывает,
что выражение доказуемо, если
\begin{enumerate}
\item ⊢ a => ⊢ π(`a\textasciitilde{})
\item ⊢ π(`a\textasciitilde{}) → π(`π(`a\textasciitilde{})\textasciitilde{})
\item ⊢ π(`a\textasciitilde{}) → π(`(a → b)\textasciitilde{}) → π(`b\textasciitilde{})
\end{enumerate}
\subsection{Лемма о самоприменении}
\label{sec-2-37}
a(x) - формула, тогда ∃b такой что
\begin{enumerate}
\item ⊢ a(`b\textasciitilde{}) → b
\item ⊢ β → a(`b\textasciitilde{})
\end{enumerate}
\subsection{Вторая теорема Гёделя о неполноте ФА}
\label{sec-2-38}
Если теория непротиворечива, в ней ⊬ Consis
\subsection{Теория множеств}
\label{sec-2-39}
Теория множеств - теория первого порядка, в которой
есть единственный предикат ∈ (в ФА был =), есть связка
←→, есть пустое множество, операции пересечения и
объединения.
x ∩ y = z, тогда ∀t(t ∈ z ←→ t ∈ x \& t ∈ y)
x ∪ y = z, тогда ∀t(t ∈ z ←→ t ∈ x V t ∈ y)
Dj(x) ∀a∀b(a ∈ x \& b ∈ x \& a ≠ b → a ∩ b = ∅)
