mathlogic/mathlogic.org
** ИИВ, структура, модель
   Сигнатура - (R, F, C, r): R - множество символов для
   предикатов, F - функциональных символов, С - символов
   констант, r – функция, определяющая арность x ∈ R V F.
   Интерпретация - это приписывание символам значения
   и правил действия
   Структура - это носитель M (множство истинностных значений),
   сигнатура и интерпретация над носителем. Если все аксиомы
   верны, то структура корректна. В таком случае она называется
   моделью.
   Выкидываем 10 аксиому, добавляем A→(¬A→B)
   10i: a → ¬a → b
   Кстати она доказывается и в ИВ
   1. (a → aV¬a) → (a → aV¬a → (¬a → b)) → a → (¬a → b)
   2. a, aV¬a, ¬a ⊢ b
      a
      ¬a
      b → a
      b → ¬a
      (b → a) → (b → ¬a) → ¬b
      ¬b → a
      ¬b → ¬a
      (¬b → a) → (¬b → ¬a) → ¬¬b
      ¬¬b → b
      b
   3. a → (¬a → b)
** Опровергаемость исключенного третьего
   Вводим в наше множество истинностных значений Н
   Л < Н < И
   & - max
   V - min
   ¬И=Л, ¬Л=И, ¬Н=Л
   И→x=x, Л→x=И, Н→Л=Л, Н→Н=И, Н→И=И
   1. Все аксиомы ИИВ являются 3-тавтологиями (ручная проверка)
      Значит любая интуиционистски выводимая формула 3-тавтология
   2. q V ¬q = H, значит она невыводима (контрпозиция пред. утв)
** Решетки
   * Решетка
     Решетка - это (L, +, *) в алгебраическом смысле и (L, ≤) в порядковом.
     Решетку можно определить как алгебраическую структуру через
     аксиомы: коммутативность, ассоциативность, поглощение.
     Решетку можно определить как упорядоченное множество через
     множество с частичным порядком на нем, тогда операции +, * определяются
     как sup и inf:
     sup p = min {u | u ≥ all s ∈ p}
     inf p = max {u | u ≤ all s ∈ p}
     a + b = sup {a, b}
     a * b = inf {a, b}
     Если для двух элементов всегда можно определить a + b и a * b, то такое
     множество назывется решеткой.
   * Дистрибутивная решетка -- решетка, в которой работает дистрибутивность:
     a * (b + c) = (a * b) + (b * c)
   * Импликативная решетка -- всегда существует псевдодополнение b (b → a)
     a → b = max c | c * a ≤ b
     Имеет свойствa, что в ней всегда есть максимальный элемент a → a и что
     она дистрибутивна.
#   * Определение нуля и единицы –- вводим их через определение со знаками
#     равенства, а в импликативной это a → a
#     * Пусть a ∈ V, тогда 1 = a → a
#       b: b * a ≤ a
#       Тогда по предыдущему правилу b ≤ a → a
** Лемма о дистрибутивности импликативной решетки
   1. Полезные леммы
      1) Лемма о домножении слева
         b ≤ c ≤ a * c, тогда a * b ≤ a * c
         a * b ≤ b ≤ c ≤ a * c
      2) Лемма о перенесении импликации
         a * b ≤ c => a ≤ b → c
   2. a * (b + c) ≥ a * b + a * c
      1) a * (b + c) ≥ a * b
         a * b ≤ a
         a * b ≤ b ≤ b + c
         a * b ≤ a * (b + c)  (из двух предыдущих)
      2) a * (b + c) ≥ a * c
         a * c ≤ a
         a * c ≤ c ≤ b + c
         a * c ≤ a * (b + c)
      3) a * (b + c) ≥ a * b + a * c (поскольку оно больше и того и другого)
   3. a * (b + c) ≤ a * b + a * c (пусть правая часть - q)
      1) b * a ≤ q (по определению *)
         b ≤ a → q (то самое место где мы пользуемся импликативностью)
      2) c * a ≤ q
         c ≤ a → q
      3) b + c ≤ a → q
         (b + c) * a ≤ q
         a * (b + c) ≤ q = a * b + a * c
   4. a * (b + c) = a * b + a * c
** Алгебра Гейтинга, булева алгебра
   * Булева алгебра можно определить так:
     1. (L, +, *, -, 0, 1) с выполненными аксиомами - коммутативность,
        ассоциативность, поглощение, две дистрибутивности и a * -a = 0,
        a + -a = 1.
     2. Импликативная решетка над фундированным множеством.
        Тогда мы в ней определим 1 как a → a (традиционно для импликативной),
        отрицание как -a = a → 0, и тогда последняя аксиома из
        предыдущего определения будет свойством:
        a * -a = a * (a → 0) = a * (max c: c * a ≤ 0) = a * 0 = 0
        Насчет второй аксиомы - должно быть 1. То есть лучше как-то
        через аксиомы определять, видимо.
        a + -a = a + (a → 0) = a + (max c: c * a ≤ 0) = a + 0 = a // не 1
   * Псевдобулева алгебра - это импликативная решетка над фундированным
     множеством с ¬a = (a → 0)
** Алгебра Линденбаума-Тарского
   V - множество формул ИИВ
   * Порядок для решетки:
     a ≤ b ↔ a |- b
     a ~ b ↔ a |- b & b |- a
   * Дополняяем множество V:
     0: a & ¬a = ⊥
     1: a → a = T
   * Операции в алгебра:
     *: a & b
     +: a V b
     →: a → b
     -: ¬a
   * Эта алгебра является алгеброй Гейтинга, поскольку для нее
     выполняются -a * a = 0 (по определению), а 0: ∀ x : x ≤ 0
     в ней это ∀ x (x – формула ИИВ) : ⊥ ⊢ x (из лжи следует все что угодно):
     a & ¬a
     a & ¬a → a
     a & ¬a → ¬a
     (b → a) → (b → ¬a) → ¬b (ну или 10i в ИИВ)
** Теорема о полноте ИИВ относительно алгебры Гейтингa
   Давайте возьмем в качестве Гейтинга алгебру Л-Т. Она нормальная
   себе такая структура (модель, наверное, несложно проверить):
   Пользуемся стандартной топологической интерпретацией
   (& = *, V = +, → = →, ¬ = -)
   Алгебра
   * Доказательство полноты
     a - обшезначимо
     [a] = 1
     1 ≤ [a]
     x → x ⊢ a (по определению алгебры Л-Т)
     x → x доказума и так, значит
     ⊢ a
   * Дойдем до 1 ≤ [a], значит A → A ⊢ a
** Дизъюнктивность ИИВ
   Мы доказываем, что если ⊢ aVb, то ⊢a или ⊢b
   * Юзанем алгебру Гёделя Г(A) (γ – функция преобразования a → a_godel):
     Мы можем ее обернуть над любой Гейтинговой алгеброй, возьмем Л-Т.
     Алгебра Гёделя строится с помощью γ. γ(a) = b значит, что
     в алгебре A элементу а соответствует элемент b из алгебры Гёделя.
     Порядок сохраняется естественным образом (я не очень точно знаю
     как, но предполагается, что a ≤ b, a и b сравнимы - γ(a) ≤ γ(b),
     они сравнимы. Ну и такое). Гёделева алгебра добавляет один элемент w.
     γ(1) = w
     γ(x) = x
     Таким образом Г(А) = А∪{w}, порядок в Г(А):
     * a≤w если a!=1
     * a≤b ←→ a≤ₐa (сравнение обычных элементов как и раньше)
     * w≤1
     Связки определяем через таблицы:

     |--------+-----+--------|
     | x + y  | y=1 | y=γ(v) |
     |--------+-----+--------|
     | x=1    |   1 | 1      |
     | x=γ(u) |   1 | γ(u+v) |
     |--------+-----+--------|

     |--------+---------+---------|
     | x * y  | y=1     | y=γ(v)  |
     |--------+---------+---------|
     | x=1    | 1       | γ(x*ₐv) |
     | x=γ(u) | γ(u*ₐy) | γ(u*ₐv) |
     |--------+---------+---------|

     |--------+-----+---------|
     | x → y  | y=1 | y=γ(v)  |
     |--------+-----+---------|
     | x=1    |   1 | γ(x→ₐv) |
     | x=γ(u) |   1 | u→ₐv    |
     |--------+-----+---------|

     |--------+--------|
     | x      | ¬x     |
     |--------+--------|
     | x=1    | γ(¬ₐx) |
     | x=γ(u) | ¬ₐu    |
     |--------+--------|

   * Докажем, что Гёделева алгебра является Гейтинговой.
     Для этого нужно доказать, что в ней выполняется коммутативность,
     ассоциативность и законы поглощения (это альтернативное определение
     эквивалентно заданию множества с фундированным порядком).
     1. Коммутативность
        1) A * B = B * A
        2) A + B = B + A
     2. Ассоциативность
        1) A * (B * C) = (A * B) * C
        2) A + (B + C) = (A + B) + C
     3. Поглощение
        1) A * (A + B) = A
        2) A + (A * B) = A
     Внимательноe прослеживание свойств связок подтверждает тот факт,
     что Гёделева алгебра есть алгебра Гейтинга.
     Нужно также учитывать тот факт, что внутренняя алгебра тоже Гейтингова.
   * Если ⊢ a V b, то [a V b]ₗ = 1, [a V b]_Г = 1, тогда по определению
     связки + в Гёделевской [a]_Г = 1 или [b]_Г = 1, тогда оно такое же
     и в Линденбауме-Тарском, а Л-Т полно, то есть ⊢a или ⊢b.
