mathlogic.tex
\section{Ticket 3: ИИВ}
\label{sec-5}
\subsection{ИИВ, структура, модель}
\label{sec-5-1}
Сигнатура - (R, F, C, r): R - множество символов для
предикатов, F - функциональных символов, С - символов
констант, r – функция, определяющая арность x ∈ R V F.
Интерпретация - это приписывание символам значения
и правил действия
Структура - это носитель M (множство истинностных значений),
сигнатура и интерпретация над носителем. Если все аксиомы
верны, то структура корректна. В таком случае она называется
моделью.
Выкидываем 10 аксиому, добавляем A→(¬A→B)
10i: a → ¬a → b
Кстати она доказывается и в ИВ
\begin{enumerate}
\item (a → aV¬a) → (a → aV¬a → (¬a → b)) → a → (¬a → b)
\item a, aV¬a, ¬a ⊢ b
a
¬a
b → a
b → ¬a
(b → a) → (b → ¬a) → ¬b
¬b → a
¬b → ¬a
(¬b → a) → (¬b → ¬a) → ¬¬b
¬¬b → b
b
\item a → (¬a → b)
\end{enumerate}
\subsection{Опровергаемость исключенного третьего}
\label{sec-5-2}
Вводим в наше множество истинностных значений Н
Л < Н < И
\& - max
V - min
¬И=Л, ¬Л=И, ¬Н=Л
И→x=x, Л→x=И, Н→Л=Л, Н→Н=И, Н→И=И
\begin{enumerate}
\item Все аксиомы ИИВ являются 3-тавтологиями (ручная проверка)
Значит любая интуиционистски выводимая формула 3-тавтология
\item q V ¬q = H, значит она невыводима (контрпозиция пред. утв)
\end{enumerate}
\subsection{Решетки}
\label{sec-5-3}
\begin{itemize}
\item Решетка
Решетка - это (L, +, *) в алгебраическом смысле и (L, ≤) в порядковом.
Решетку можно определить как алгебраическую структуру через
аксиомы: коммутативность, ассоциативность, поглощение.
Решетку можно определить как упорядоченное множество через
множество с частичным порядком на нем, тогда операции +, * определяются
как sup и inf:
sup p = min \{u | u ≥ all s ∈ p\}
inf p = max \{u | u ≤ all s ∈ p\}
a + b = sup \{a, b\}
a * b = inf \{a, b\}
Если для двух элементов всегда можно определить a + b и a * b, то такое
множество назывется решеткой.
\item Дистрибутивная решетка -- решетка, в которой работает дистрибутивность:
a * (b + c) = (a * b) + (b * c)
\item Импликативная решетка -- всегда существует псевдодополнение b (b → a)
a → b = max c | c * a ≤ b
Имеет свойствa, что в ней всегда есть максимальный элемент a → a и что
она дистрибутивна.
\end{itemize}
\subsection{Лемма о дистрибутивности импликативной решетки}
\label{sec-5-4}
\begin{enumerate}
\item Полезные леммы
\begin{enumerate}
\item Лемма о домножении слева
b ≤ c ≤ a * c, тогда a * b ≤ a * c
a * b ≤ b ≤ c ≤ a * c
\item Лемма о перенесении импликации
a * b ≤ c => a
\end{enumerate}
\item a * (b + c) ≥ a * b + a * c
\begin{enumerate}
\item a * (b + c) ≥ a * b
a * b ≤ a
a * b ≤ b ≤ b + c
a * b ≤ a * (b + c)  (из двух предыдущих)
\item a * (b + c) ≥ a * c
a * c ≤ a
a * c ≤ c ≤ b + c
a * c ≤ a * (b + c)
\item a * (b + c) ≥ a * b + a * c (поскольку оно больше и того и другого)
\end{enumerate}
\item a * (b + c) ≤ a * b + a * c (пусть правая часть - q)
\begin{enumerate}
\item b * a ≤ q (по определению *)
b ≤ a → q (то самое место где мы пользуемся импликативностью)
\item c * a ≤ q
c ≤ a → q
\item b + c ≤ a → q
(b + c) * a ≤ q
a * (b + c) ≤ q = a * b + a * c
\end{enumerate}
\item a * (b + c) = a * b + a * c
\end{enumerate}
\subsection{Алгебра Гейтинга, булева алгебра}
\label{sec-5-5}
\begin{itemize}
\item Булева алгебра можно определить так:
\begin{enumerate}
\item (L, +, *, -, 0, 1) с выполненными аксиомами - коммутативность,
ассоциативность, поглощение, две дистрибутивности и a * -a = 0,
a + -a = 1.
\item Импликативная решетка над фундированным множеством.
Тогда мы в ней определим 1 как a → a (традиционно для импликативной),
отрицание как -a = a → 0, и тогда последняя аксиома из
предыдущего определения будет свойством:
a * -a = a * (a → 0) = a * (max c: c * a ≤ 0) = a * 0 = 0
Насчет второй аксиомы - должно быть 1. То есть лучше как-то
через аксиомы определять, видимо.
a + -a = a + (a → 0) = a + (max c: c * a ≤ 0) = a + 0 = a // не 1
\end{enumerate}
\item Псевдобулева алгебра - это импликативная решетка над фундированным
множеством с ¬a = (a → 0)
\end{itemize}
\subsection{Алгебра Линденбаума-Тарского}
\label{sec-5-6}
V - множество формул ИИВ
\begin{itemize}
\item Порядок для решетки:
a ≤ b ↔ a |- b
a \textasciitilde{} b ↔ a |- b \& b |- a
\item Дополняяем множество V:
0: a \& ¬a = ⊥
1: a → a = T
\item Операции в алгебра:
*: a \& b
+: a V b
→: a → b
-: ¬a
\item Эта алгебра является алгеброй Гейтинга, поскольку для нее
выполняются -a * a = 0 (по определению), а 0: ∀ x : x ≤ 0
в ней это ∀ x (x – формула ИИВ) : ⊥ ⊢ x (из лжи следует все что угодно):
a \& ¬a
a \& ¬a → a
a \& ¬a → ¬a
(b → a) → (b → ¬a) → ¬b (ну или 10i в ИИВ)
\end{itemize}
\subsection{Теорема о полноте ИИВ относительно алгебры Гейтингa}
\label{sec-5-7}
Давайте возьмем в качестве Гейтинга алгебру Л-Т. Она нормальная
себе такая структура (модель, наверное, несложно проверить):
Пользуемся стандартной топологической интерпретацией
(\& = *, V = +, → = →, ¬ = -)
Алгебра
\begin{itemize}
\item Доказательство полноты
a - обшезначимо
[a] = 1
1 ≤ [a]
x → x ⊢ a (по определению алгебры Л-Т)
x → x доказума и так, значит
⊢ a
\item Дойдем до 1 ≤ [a], значит A → A ⊢ a
\end{itemize}
\subsection{Дизъюнктивность ИИВ}
\label{sec-5-8}
Мы доказываем, что если ⊢ aVb, то ⊢a или ⊢b
\begin{itemize}
\item Юзанем алгебру Гёделя Г(A) (γ – функция преобразования a → a$_{\text{godel}}$):
Мы можем ее обернуть над любой Гейтинговой алгеброй, возьмем Л-Т.
Алгебра Гёделя строится с помощью γ. γ(a) = b значит, что
в алгебре A элементу а соответствует элемент b из алгебры Гёделя.
Порядок сохраняется естественным образом (я не очень точно знаю
как, но предполагается, что a ≤ b, a и b сравнимы - γ(a) ≤ γ(b),
они сравнимы. Ну и такое). Гёделева алгебра добавляет один элемент w.
γ(1) = w
γ(x) = x
Таким образом Г(А) = А∪\{w\}, порядок в Г(А):
\begin{itemize}
\item a≤w если a!=1
\item a≤b ←→ a≤ₐa (сравнение обычных элементов как и раньше)
\item w≤1
\end{itemize}
Связки определяем через таблицы:

\begin{center}
\begin{tabular}{lrl}
\hline
x + y & y=1 & y=γ(v)\\
\hline
x=1 & 1 & 1\\
x=γ(u) & 1 & γ(u+v)\\
\hline
\end{tabular}
\end{center}

\begin{center}
\begin{tabular}{lll}
\hline
x * y & y=1 & y=γ(v)\\
\hline
x=1 & 1 & γ(x*ₐv)\\
x=γ(u) & γ(u*ₐy) & γ(u*ₐv)\\
\hline
\end{tabular}
\end{center}

\begin{center}
\begin{tabular}{lrl}
\hline
x → y & y=1 & y=γ(v)\\
\hline
x=1 & 1 & γ(x→ₐv)\\
x=γ(u) & 1 & u→ₐv\\
\hline
\end{tabular}
\end{center}

\begin{center}
\begin{tabular}{ll}
\hline
x & ¬x\\
\hline
x=1 & γ(¬ₐx)\\
x=γ(u) & ¬ₐu\\
\hline
\end{tabular}
\end{center}

\item Докажем, что Гёделева алгебра является Гейтинговой.
Для этого нужно доказать, что в ней выполняется коммутативность,
ассоциативность и законы поглощения (это альтернативное определение
эквивалентно заданию множества с фундированным порядком).
\begin{enumerate}
\item Коммутативность
\begin{enumerate}
\item A * B = B * A
\item A + B = B + A
\end{enumerate}
\item Ассоциативность
\begin{enumerate}
\item A * (B * C) = (A * B) * C
\item A + (B + C) = (A + B) + C
\end{enumerate}
\item Поглощение
\begin{enumerate}
\item A * (A + B) = A
\item A + (A * B) = A
\end{enumerate}
\end{enumerate}
Внимательноe прослеживание свойств связок подтверждает тот факт,
что Гёделева алгебра есть алгебра Гейтинга.
Нужно также учитывать тот факт, что внутренняя алгебра тоже Гейтингова.
\item Если ⊢ a V b, то [a V b]ₗ = 1, [a V b]$_{\text{Г}}$ = 1, тогда по определению
связки + в Гёделевской [a]$_{\text{Г}}$ = 1 или [b]$_{\text{Г}}$ = 1, тогда оно такое же
и в Линденбауме-Тарском, а Л-Т полно, то есть ⊢a или ⊢b.
\end{itemize}
