mathlogic/mathlogic.org
** Теорема Гливенко
   1. Заметим, что если А доказуемо в ИИВ, то ¬¬А тоже доказуемо.
      A
      A → ¬A → A
      ¬A → A
      ¬A → ¬A (как обычно)
      (¬A → A) → (¬A → ¬A) → ¬¬A
      Значит если А - аксиома по схеме 1-9, то ¬¬A доказуемо в ИИВ
   2. Пусть выражение А получилось по 10 схеме классического ИВ
      F = ¬¬A → A
      Докажем:
      A → ¬¬A → A (акс. 1)
      ¬(¬¬A → A) → ¬A (к/поз)
      ¬A → ¬¬A → A (акс. 10и)
      ¬(¬¬A → A) → ¬¬A (к/поз)
      (¬(¬¬A → A) → ¬A) → (¬(¬¬A → A) → ¬¬A) → ¬¬(¬¬A → A) (акс. 9)
      ¬¬(¬¬A → A) (2x m.p.)
   3. Делаем индукцию по длине доказательства в ИВ:
      1. А - аксиома, !!(А) доказывается по пункту 1-2
      2. MP
         A
         A → B
         B

         В ИИВ имеем
         ¬¬(A)
         ¬¬(A → B)
         (¬B → ¬A) → (¬B → ¬¬A) → ¬¬B

         ¬¬A, ¬¬(A → B), ¬B ⊢ ¬A
         (A → ¬(A → B)) → (A → ¬¬(A → B)) → ¬A

         ¬¬A, ¬¬(A → B), ¬B, A ⊢ ¬(A → B)
         ((A → B) → B) → ((A → B) → ¬B) → ¬(A → B)

         ¬¬A, ¬¬(A → B), ¬B, A, A → B ⊢ B
         A
         A → B
         B
** Топологическая интерпретация
   Булеву алгебру и алгебру Гейтинга можно интерпретировать
   на множестве Rⁿ. Тогда заключения о общезначимости формулы
   можно делать более наглядно.
   Давайте возьмем в качестве множества алгебры все открытые
   подмножества Rⁿ. Определим операции следующим образом:
   1. a + b => a ∪ b
   2. a * b => a ∩ b
   3. a → b => Int(aᶜ ∪ b)
   4. -a => Int(aᶜ)
   5. 0 => ∅
   6. 1 => ⋃{всех мн-в в L}
* Ticket 4: ИИВ2
** Модели Крипке
   Var = {P, Q, ...}
   Модель Крипке – это <W, ≤, v>, где
   * W - множество "миров"
   * ≤ - частичный порядок на W (отношение достижимости)
   * v: W × Var → {0, 1} - оценка перменных на W, монотонна
     (если v(x, P) = 1, x ≤ y, то v(y, P) = 1 – формулу нельзя un'вынудить)
   Правила:
   * W, x ⊨ P ⇐⇒ v(x, P) = 1 если P ∈ Var
   * W, x ⊨ (A & B) ⇐⇒ W, x ⊨ A & W, x ⊨ B
   * W, x ⊨ (A V B) ⇐⇒ W, x ⊨ A V W, x ⊨ B
   * W, x ⊨ (A → B) ⇐⇒ ∀ y ≥ x (W, y ⊨ A ⇒ W, y ⊨ B)
   * W, x ⊨ ¬A ⇐⇒ ∀ y ∈ x (W, x ¬⊨ A)

   В мире разрешается быть не вынужденной переменной и ее отрицанию
   одновремеменно.
   Формула называется тавтологией в ИИВ с моделью Крипке, если она
   истинна (вынуждена) в любом мире любой модели Крипке.
** Корректность ИИВ относительно моделей Крипке
   Если формула выводима в ИИВ, то она истинна по шкале Крипке
   Проверим MP и аксиомы (что они истинны во всех мирах)
   1. MP
      По определению импликации в моделях Крипке, если в мире
      вынуждено A, A→B, то вынуждено и B.
   2. Аксиомы
      1) A → (B → A)
         Пусть где-нибудь вынуждена A, в силу
         монотонности она вынуждена везде правее, тогда если
         там где-то будет B, то B → A тоже будет вынуждено
      2) (A → B) → ((A → (B → C)) → (A → C))
         Пусть где-нибудь вынуждено A → B, докажем, что если
         где-то есть A → B, то там есть и ((A → (B → C)) → (A → C)).
         1. В мире вынуждено A, B; тогда если правее вынуждено
            A → (B → C), то вынуждено C по монотонности A, B; значит
            Везде правее A → (B → C) есть A, B, C, значит вынуждено A → C;
         2. В мире не вынуждено ни A, ни B, тогда если не вынуждено
            A → (B → C), то A → C тоже не может быть вынуждено, потому что
            ни A, ни B, ни C там нет.
      3) A → (¬A → B)
         1. Если вынуждена А, то вынуждена ¬A → B
            Если вынуждена А, то не вынуждена ¬A, тогда ¬A → B
            можно вынудить вне зависимости от вынужденности B.
         2. Если не вынуждена А, то что угодно нас устроит.
      4) etc (как-то легко на уровне)
** X Вложение Крипке в Гейтинга (Д-во псевдодоп-я)
   Нарисуем модель Крипке, возьмем какое-то объединение поддеревьев
   со всеми потомками, каждое такое объединение пусть будет входить
   в алгебру Гейтинга. ≤ - отношение "быть подмножеством".
   Определим операции:
   + = ∪, * = ∩,
   Докажем, что с ними все ок:
   ≤ - частичный порядок.
   1. Антисимметричность - a ∈ b & b ∈ a => a = b
   2. Транзитивность - a ∈ b, b ∈ c => a ∈ c
   3. Рефлексивность - ∀ a (a ∈ a)

   +, * замкнуты. Объединение сохраняет свойства поддеревьев, а
   пересечение может быть либо пустым, либо поддеревом одного из
   аргументов, в любом случае все ок. Можно пользоваться строгим условием
   монотонности миров.

   Докажем, что + - это sup, * - inf.
   1. sup
      a + b ≤ x <=> a ≤ x & b ≤ x - верхняя граница
      a ∪ b ⊂ x <=> a ⊂ x & b ⊂ x - выполняется
   2. inf
      x ≤ a * b <=> x ≤ a & x ≤ b - нижняя граница
      x ⊂ a ∩ b <=> x ⊂ a & x ⊂ b - выполняется

   Определим 0 как ∅;
   a → b = ∪T(x, y), где T(x, y) = {z ∈ H | z ≤ xᶜ ∪ y}
   Доказать, что a → b - псевдодополнение,
   a ≤ b → c ~ a * b ≤ c
   -->   TODO

   Докажем, что если в Крипке что-то общезначимо, то оно общезначимо
   и в созданной алгебре Гейтинга.
   Делается индукцией по структуре. А - булева алгебра, М - модель крипке
   ⊨ₘ a <=> ⊨ₐ a
   Пусть оценка a в нашей алгебре Гейтинга - это множествo, являющеeся
   объединением всех поддеревьев миров, в которых вынуждено а. Общезначимо
   значит равно объединению всех множеств V в нашей алгебре.
   Если переменная в Крипке тавтология, то она вынуждена во всех мирах,
   значит ее оценка в Гейтинге = 1
   Нужно еще проверить все связки.
** Полнота ИИВ в моделях Крипке
   1. Докажем для дизъюнктивных множество такое:
      Пусть дизъюнктивная множество M – это такое, что если в
      формальной системе M⊢aVb, то a ∈ M или b ∈ M.
      (inb4: носитель модели крипке является дизъюнктивным мн-м, поскольку
      если в ИИВ доказано aVb, то оно по корректности вынуждено во всех
      мирах, а значит вынуждено одно из двух, а значит принадлежит множеству
      вынужденных формул шкал Крипке)
      * В дизъюнктивном множестве, если G ⊢ a, то a ∈ G.
        Пусть это не так.
        В нашем множестве мы можем иметь что угодно. a → a V ¬a,
        тогда G ⊢ a V ¬a. Пусть a ¬∈ G, тогда по дизъюнктивности M ¬a ∈ G.
        Но тогда мы можем доказать a&¬a.
   2. Возьмем множество всех дизъюнктивных множеств с формулами из ИИВ.
      Мы можем это сделать, потому что ИИВ дизъюнктивно.
      Для любого элемента Wᵢ a, a ∈ Wᵢ значит что в этом мире а вынуждено.
      Построим дерево с порядком "быть подмножеством".
      Докажем, что это множество – модель крипке.
      Проверим 5 свойств (про монотонности всякие и вынужденности)
      1) W, x ⊨ P ←→ v(x, P) = 1 если P ∈ Var
         Монотонности выполняются по построению дерева
      2) W, x ⊨ (A & B) ←→ W, x ⊨ A & W, x ⊨ B
         W ⊢ A (через A & B → A), значит A ∈ W, B аналогично
      3) W, x ⊨ (A V B) ←→ W, x ⊨ A V W, x ⊨ B
         По дизъюнктивности (если лежит в W, значит из него доказуемо)
      4) W, x ⊨ (A → B) ←→ ∀ y ≥ x (W, y ⊨ A ⇒ W, y ⊨ B)
         W ⊢ A → B. Пусть в W есть А, тогда докажем B (MP) и оно тоже в нем
         Пусть есть B, тогда все уже хорошо
      5) W, x ⊨ ¬A ←→ ∀ y ∈ x (W, x ¬⊨ A)
         Если вдруг где-то нашлось A, то оно доказуемо, значит мы сможем
         доказать A & ¬A
   3. ⊨a, тогда Wᵢ⊨a, но для W₀ - дизъюнктивного множества всех доказуемых
      формул W, W₀⊨a. W₀ такое, что что бы не было
      доказуемо из W₀, оно тоже лежит в нем. Поскольку a тавтология, то
      a была доказана и попала в W₀ не случайно.
