mathlogic.tex
\subsection{Теорема Гливенко}
\label{sec-5-9}
\begin{enumerate}
\item Заметим, что если А доказуемо в ИИВ, то ¬¬А тоже доказуемо.
A
A → ¬A → A
¬A → A
¬A → ¬A (как обычно)
(¬A → A) → (¬A → ¬A) → ¬¬A
Значит если А - аксиома по схеме 1-9, то ¬¬A доказуемо в ИИВ
\item Пусть выражение А получилось по 10 схеме классического ИВ
F = ¬¬A → A
Докажем:
A → ¬¬A → A (акс. 1)
¬(¬¬A → A) → ¬A (к/поз)
¬A → ¬¬A → A (акс. 10и)
¬(¬¬A → A) → ¬¬A (к/поз)
(¬(¬¬A → A) → ¬A) → (¬(¬¬A → A) → ¬¬A) → ¬¬(¬¬A → A) (акс. 9)
¬¬(¬¬A → A) (2x m.p.)
\item Делаем индукцию по длине доказательства в ИВ:
\begin{enumerate}
\item А - аксиома, !!(А) доказывается по пункту 1-2
\item MP
A
A → B
B

В ИИВ имеем
¬¬(A)
¬¬(A → B)
(¬B → ¬A) → (¬B → ¬¬A) → ¬¬B

¬¬A, ¬¬(A → B), ¬B ⊢ ¬A
(A → ¬(A → B)) → (A → ¬¬(A → B)) → ¬A

¬¬A, ¬¬(A → B), ¬B, A ⊢ ¬(A → B)
((A → B) → B) → ((A → B) → ¬B) → ¬(A → B)

¬¬A, ¬¬(A → B), ¬B, A, A → B ⊢ B
A
A → B
B
\end{enumerate}
\end{enumerate}
\subsection{Топологическая интерпретация}
\label{sec-5-10}
Булеву алгебру и алгебру Гейтинга можно интерпретировать
на множестве Rⁿ. Тогда заключения о общезначимости формулы
можно делать более наглядно.
Давайте возьмем в качестве множества алгебры все открытые
подмножества Rⁿ. Определим операции следующим образом:
\begin{enumerate}
\item a + b => a ∪ b
\item a * b => a ∩ b
\item a → b => Int(aᶜ ∪ b)
\item -a => Int(aᶜ)
\item 0 => ∅
\item 1 => ⋃\{всех мн-в в L\}
\end{enumerate}
\section{Ticket 4: ИИВ2}
\label{sec-6}
\subsection{Модели Крипке}
\label{sec-6-1}
Var = \{P, Q, \ldots{}\}
Модель Крипке – это <W, ≤, v>, где
\begin{itemize}
\item W - множество "миров"
\item ≤ - частичный порядок на W (отношение достижимости)
\item v: W × Var → \{0, 1\} - оценка перменных на W, монотонна
(если v(x, P) = 1, x ≤ y, то v(y, P) = 1 – формулу нельзя un'вынудить)
\end{itemize}
Правила:
\begin{itemize}
\item W, x ⊨ P ⇐⇒ v(x, P) = 1 если P ∈ Var
\item W, x ⊨ (A \& B) ⇐⇒ W, x ⊨ A \& W, x ⊨ B
\item W, x ⊨ (A V B) ⇐⇒ W, x ⊨ A V W, x ⊨ B
\item W, x ⊨ (A → B) ⇐⇒ ∀ y ≥ x (W, y ⊨ A ⇒ W, y ⊨ B)
\item W, x ⊨ ¬A ⇐⇒ ∀ y ∈ x (W, x ¬⊨ A)
\end{itemize}

В мире разрешается быть не вынужденной переменной и ее отрицанию
одновремеменно.
Формула называется тавтологией в ИИВ с моделью Крипке, если она
истинна (вынуждена) в любом мире любой модели Крипке.
\subsection{Корректность ИИВ относительно моделей Крипке}
\label{sec-6-2}
Если формула выводима в ИИВ, то она истинна по шкале Крипке
Проверим MP и аксиомы (что они истинны во всех мирах)
\begin{enumerate}
\item MP
По определению импликации в моделях Крипке, если в мире
вынуждено A, A→B, то вынуждено и B.
\item Аксиомы
\begin{enumerate}
\item A → (B → A)
Пусть где-нибудь вынуждена A, в силу
монотонности она вынуждена везде правее, тогда если
там где-то будет B, то B → A тоже будет вынуждено
\item (A → B) → ((A → (B → C)) → (A → C))
Пусть где-нибудь вынуждено A → B, докажем, что если
где-то есть A → B, то там есть и ((A → (B → C)) → (A → C)).
\begin{enumerate}
\item В мире вынуждено A, B; тогда если правее вынуждено
A → (B → C), то вынуждено C по монотонности A, B; значит
Везде правее A → (B → C) есть A, B, C, значит вынуждено A → C;
\item В мире не вынуждено ни A, ни B, тогда если не вынуждено
A → (B → C), то A → C тоже не может быть вынуждено, потому что
ни A, ни B, ни C там нет.
\end{enumerate}
\item A → (¬A → B)
\begin{enumerate}
\item Если вынуждена А, то вынуждена ¬A → B
Если вынуждена А, то не вынуждена ¬A, тогда ¬A → B
можно вынудить вне зависимости от вынужденности B.
\item Если не вынуждена А, то что угодно нас устроит.
\end{enumerate}
\item etc (как-то легко на уровне)
\end{enumerate}
\end{enumerate}
\subsection{{\bfseries\sffamily X} Вложение Крипке в Гейтинга (Д-во псевдодоп-я)}
\label{sec-6-3}
Нарисуем модель Крипке, возьмем какое-то объединение поддеревьев
со всеми потомками, каждое такое объединение пусть будет входить
в алгебру Гейтинга. ≤ - отношение "быть подмножеством".
Определим операции:
\begin{itemize}
\item = ∪, * = ∩,
\end{itemize}
Докажем, что с ними все ок:
≤ - частичный порядок.
\begin{enumerate}
\item Антисимметричность - a ∈ b \& b ∈ a => a = b
\item Транзитивность - a ∈ b, b ∈ c => a ∈ c
\item Рефлексивность - ∀ a (a ∈ a)
\end{enumerate}

+, * замкнуты. Объединение сохраняет свойства поддеревьев, а
пересечение может быть либо пустым, либо поддеревом одного из
аргументов, в любом случае все ок. Можно пользоваться строгим условием
монотонности миров.

Докажем, что + - это sup, * - inf.
\begin{enumerate}
\item sup
a + b ≤ x <=> a ≤ x \& b ≤ x - верхняя граница
a ∪ b ⊂ x <=> a ⊂ x \& b ⊂ x - выполняется
\item inf
x ≤ a * b <=> x ≤ a \& x ≤ b - нижняя граница
x ⊂ a ∩ b <=> x ⊂ a \& x ⊂ b - выполняется
\end{enumerate}

Определим 0 как ∅;
a → b = ∪T(x, y), где T(x, y) = \{z ∈ H | z ≤ xᶜ ∪ y\}
Доказать, что a → b - псевдодополнение,
a ≤ b → c \textasciitilde{} a * b ≤ c
-->   TODO

Докажем, что если в Крипке что-то общезначимо, то оно общезначимо
и в созданной алгебре Гейтинга.
Делается индукцией по структуре. А - булева алгебра, М - модель крипке
⊨ₘ a <=> ⊨ₐ a
Пусть оценка a в нашей алгебре Гейтинга - это множествo, являющеeся
объединением всех поддеревьев миров, в которых вынуждено а. Общезначимо
значит равно объединению всех множеств V в нашей алгебре.
Если переменная в Крипке тавтология, то она вынуждена во всех мирах,
значит ее оценка в Гейтинге = 1
Нужно еще проверить все связки.
\subsection{Полнота ИИВ в моделях Крипке}
\label{sec-6-4}
\begin{enumerate}
\item Докажем для дизъюнктивных множество такое:
Пусть дизъюнктивная множество M – это такое, что если в
формальной системе M⊢aVb, то a ∈ M или b ∈ M.
(inb4: носитель модели крипке является дизъюнктивным мн-м, поскольку
если в ИИВ доказано aVb, то оно по корректности вынуждено во всех
мирах, а значит вынуждено одно из двух, а значит принадлежит множеству
вынужденных формул шкал Крипке)
\begin{itemize}
\item В дизъюнктивном множестве, если G ⊢ a, то a ∈ G.
Пусть это не так.
В нашем множестве мы можем иметь что угодно. a → a V ¬a,
тогда G ⊢ a V ¬a. Пусть a ¬∈ G, тогда по дизъюнктивности M ¬a ∈ G.
Но тогда мы можем доказать a\&¬a.
\end{itemize}
\item Возьмем множество всех дизъюнктивных множеств с формулами из ИИВ.
Мы можем это сделать, потому что ИИВ дизъюнктивно.
Для любого элемента Wᵢ a, a ∈ Wᵢ значит что в этом мире а вынуждено.
Построим дерево с порядком "быть подмножеством".
Докажем, что это множество – модель крипке.
Проверим 5 свойств (про монотонности всякие и вынужденности)
\begin{enumerate}
\item W, x ⊨ P ←→ v(x, P) = 1 если P ∈ Var
Монотонности выполняются по построению дерева
\item W, x ⊨ (A \& B) ←→ W, x ⊨ A \& W, x ⊨ B
W ⊢ A (через A \& B → A), значит A ∈ W, B аналогично
\item W, x ⊨ (A V B) ←→ W, x ⊨ A V W, x ⊨ B
По дизъюнктивности (если лежит в W, значит из него доказуемо)
\item W, x ⊨ (A → B) ←→ ∀ y ≥ x (W, y ⊨ A ⇒ W, y ⊨ B)
W ⊢ A → B. Пусть в W есть А, тогда докажем B (MP) и оно тоже в нем
Пусть есть B, тогда все уже хорошо
\item W, x ⊨ ¬A ←→ ∀ y ∈ x (W, x ¬⊨ A)
Если вдруг где-то нашлось A, то оно доказуемо, значит мы сможем
доказать A \& ¬A
\end{enumerate}
\item ⊨a, тогда Wᵢ⊨a, но для W₀ - дизъюнктивного множества всех доказуемых
формул W, W₀⊨a. W₀ такое, что что бы не было
доказуемо из W₀, оно тоже лежит в нем. Поскольку a тавтология, то
a была доказана и попала в W₀ не случайно.
\end{enumerate}
