mathlogic/mathlogic.org
** ИИВ не таблично
   Под этим мы подразумеваем, что не существует полной модели,
   которая может быть выражена таблицей (конечной – алгебра Гейтинга
   и Крипке не табличны, так как и там и там связки определяются иначе).
   От противного соорудим табличную модель и покажем, что она не полна.
   В ИВ мы обычно пользуемся алгеброй J₀ Яськовского (хз почему так названа)
   - это V={0, 1}, 0 ≤ 1
   Пусть имеется V = {...}, |V| = n - множество истинностных значений.
   Пусть размер больше 2. Тогда построим формулу:
   ⋃_(1≤j<i≤n+1)(aᵢ→aⱼ);
   1. Общезначимость.
      По принципу Дирихле (количество таких формул - c(n, 2) ≥ n)
      В какой-то формуле встретятся два одинаковых значения и она будет верна,
      тогда все выражение будет истинно.
   2. Недоказуемость
      1) J₀ - алгебра Яськовского
         Определим последовательность алгебр Lₙ, L₀ = J₀,
         Lₙ=Γ(Lₙ₋₁) - Гёделева алгебра
         Таким образом Lₙ - упорядоченное множество {0, ω₁, ω₂,...1}
         Пусть f - оценка в Lₙ, действующая по таким правилам на нашу формулу:
         f(a₁) = 0, f(aₙ₊₁) = 1, f(aᵢ) = wᵢ
         при j<i f(aᵢ → aⱼ) = f(aᵢ) → f(aⱼ) = f(aⱼ) ≠ 1
         Поскольку ИИВ полно относительно алгебры Гейтинга (Lₙ псевдобулева),
         то формула недоказуема
      2) Строим модель Крипке как вершину с n+1 сыновьями, в которых вынуждено
         по одной переменной. Тогда если в вершине вынуждена формула,
         то хотя бы один элемент связки должен быть вынужден, но там везде
         по одной переменной и импликация не работает.
* Ticket 5: логика 2 порядка
** Определения исчисления предикатов, грамматика
   Описываем грамматику (goto конспект ДГ)
   Описываем модель – предметное множество, формулы для
   функциональных символов и предикатов, задать свободные
   переменные.
   f: [f]:Dⁿ→D
   P: [P]:Dᵐ→V
   x: [x]:D
   (+ немного очевидные формальные правила как делать
   оценку - если ∀xP, то [...] = 1, если для любого x
   P == 1 и так далее)

   Добавляются две новые аксиомы
   ∀x.A → A[x:=θ], где θ свободна для подстановки в A
   A[x:=θ] → ∃x.A, -//-

   Новое правило вывода:
   A ⊢ ∀x.A    GEN

   Мы это правило представляем в виде двух утверждений (второй неочевидно откуда)
   _A_→_B_
   A → ∀x.B

   _A_→_B_
   ∃x.A → B

   переход от 1 к Gen легко доказать
   A
   A → ⊤ → A
   ⊤ → A
   ⊤ → ∀x.A
   ∀x.A

   Переход от Gen к 1
   A → B ⊢ A → ∀x.B
   ???

   В общем-то нам нет необходимости думать о том, как делать переход,
   но вопрос интересный (теорему Генцена о непротиворечивости ФА
   можно видоизменить с GEN на наши два правила)
** Теорема о дедукции
   → Если нужно переместить последнее предположение вправо,
   то рассматриваем случаи -- старая аксиома или предположение,
   MP, это самое выражение, две новых аксиомы с условиями выполнимости,
   два новых правила с условиями выполнимости.
   1. Старая аксиома или предположение
      A
      A → a → A
      a → A
   2. MP
      a → A (по индукции)
      ...
      a → A → B (по индукции)
      ...
      (a → A) → (a → A → B) → (a → B)
      (a → A → B) → (a → B)
      a → B
   3. A → A умеем доказывать
   4. Новые аксиомы как старые, только проверяем условие
   5. ∃x.A → B - первое новое правило вывода, проверяем условие
      1) Вспомогательная лемма: (a → (b → c)) → (b → (a → c))
         a → (b → c), b, a ⊢ c
         a → b → c
         b → c
         c
      2) a → A → B (в первоначальном доказательстве было A → B)
         ...
         (a → A → B) → (A → a → B)
         A → a → B
         ∃x.A → a → B (это же правило вывода)
         (∃x.A → a → B) → (a → ∃x.A → B)
         a → ∃x.A → B
   6. A → ∀x.B - второе новое правило вывода, проверяем условие
      1) Вспомагательная лемма 1: (a & b → c) → (a → b → c)
         a & b → c, a, b ⊢ c
         a
         b
         a → b → a & b
         b → a & b
         a & b
         a & b → c
         c
      2) Вспомагательная лемма 2: (a → b → c) → (a & b → c)
         a → b → c, a & b ⊢ c
         a & b → a
         a
         a & b → b
         b
         b → c
         c
      3) a → A → B
         ...
         (a → A → B) → (a & A → B)
         a & A → B
         a & A → ∀x.B
         (a & A → ∀x.B) → (a → A → ∀x.B)
         a → A → ∀x.B

   ← Если нужно переместить влево, то перемещаем, добавляем
   A→B (последнее)
   A    (перемещенное)
   B
   (тут все как в ИВ)
** Корректность исчисления предикатов
   * Лемма о корректности подстановки
     [a]^(x:=[θ]) = [a(x:=[θ])]

     Структурная индукция по a:
     База: Пусть a - это предикат, тогда из способа оценки предиката
     понятно, что [P(θ,..)]=[P(x,...)]^(x:=[θ])
     Индукционный переход:
     1. a → b, a & b, a V b, ¬a
        1) a & b:
           [a & b]^(x:=[θ]) = [a[x:=θ]] & [b[x:=θ]] = [a[x:=θ] & b[x:=θ]] =
           [(a & b)[x=[θ]]]
        2) аналогично, TODO
     2. ∀y.a, ∃y.a
        1) [∀y.a]^(x:=[θ]) =? [∀y.a[x:=θ]]
           Если x входит в ∀y.a связанно, то вообще никакой роли
           наша подстановка в оценке не играет.
           Значит пусть входит свободно.
           Поскольку θ свободна для подстановки вместо x в a, то
           в θ не входит свободно y - оценка θ не меняется.
           По предположению индукции [a]^(x:=[θ]) = [a[x:=θ]].
           Из свободности для подстановки θ следует еще и
           [a]^(x:=[θ], y:=v) = [a[x:=θ]]^(y:=v), значит оценки полных
           формул с кванторами тоже будут совпадать
        2) ∃ аналогично, TODO

   С помощью леммы проводим аналогичные рассуждения, как для ИВ.
   Рассматриваем только новые аксиомы и правила вывода:
   1. ∀x.a → a[x:=θ]
      Пусть это не тавтология, тогда ∀x.a = И, a[x:=θ] = Л.
      При любом x выполнено a, но с x=θ нет. Противоречие
   2. a[x:=θ] → ∃x.a
      аналогично, TODO
   3. a → b; a → ∀x.b
      a → b истинно по предположению индукции. Пусть a → ∀x.b ложь, тогда
      a = И, ∀x.b = Л, но b = (∀x.b)@θ, значит это есть частный случай, а
      он верен. противоречие
   4. a → b; ∃x.a → b
      аналогично, TODO
* Ticket 6: полнота исч. пред.
  А почему собственно наше множество Г какое-то отношение
  имеет к предикатам?
** Свойства противоречивости
   Противоречивая теория – теория, в которой можно
   вывести p, ¬p.
   * Лемма: теория противоречива ↔ в ней выводится a & ¬a
     ← если выводится a & ¬a, то противоречива – очевидно
     через аксиомы &
     → если противоречива, то выводится a & ¬a
     a
     ¬a
     a → ¬a → (a & ¬a)
   Заметим, что всякое подмножество непрот непротиворечиво.
   Заметим, что всякое бесконечное прот. множество содержит
   конечное противоречивое подмножество ввиду конечности
   вывода.
   Совместное множество – множество с моделью (все формулы
   множества верны в какой-либо интерпретации).
** Лемма 1: о дополнении непр. мн-ва до полного
   Для всякого непротиворечивого множества Г
   замкнутых формул сигнатуры σ существует множество Г',
   являющееся к тому же полным, имеющее ту же сигнатуру
   и содержащее Г.

   Для не более чем счетных сигнатур:
   Давайте добавлять недостающие формулы в Г - если есть
   формула a, добавим a или ¬a в зависимости от того,
   является ли Г∪a или Γ∪¬a противоречивым или нет (выберем
   непротиворечивый вариант). Одно всегда верно, потому
   что:
    1) Г∪a, Γ∪¬a противоречивы обе. Тогда Γ противоречиво.
    2) Г∪a, Γ∪¬a непротиворечивы обе. a → ¬a → a&¬a. →←

   Общий случай:
   Лемма Цорна гласит, что частично упор. мн-во, в котором
   каждая цепь имеет верхнюю грань, содержит максимальный
   элемент.
   Рассмотрим частично упорядоченное множество с элементами
   непротиворечивыми множествами, а отношение ≤ - это
   быть подмножеством. Тогда в силу не более чем счетности
   любой цепи по предыдущему случаю каждая цепь имеет
   верхнюю границу. По лемме Цорна наше множество содержит
   максимальный элемент. Этот элемент полон (если нет,
   то можем в него добавить a или ¬a
