mathlogic.tex
\subsection{ИИВ не таблично}
\label{sec-6-5}
Под этим мы подразумеваем, что не существует полной модели,
которая может быть выражена таблицей (конечной – алгебра Гейтинга
и Крипке не табличны, так как и там и там связки определяются иначе).
От противного соорудим табличную модель и покажем, что она не полна.
В ИВ мы обычно пользуемся алгеброй J₀ Яськовского (хз почему так названа)
\begin{itemize}
\item это V=\{0, 1\}, 0 ≤ 1
\end{itemize}
Пусть имеется V = \{\ldots{}\}, |V| = n - множество истинностных значений.
Пусть размер больше 2. Тогда построим формулу:
⋃$_{\text{(1≤j<i≤n+1)}}$(aᵢ→aⱼ);
\begin{enumerate}
\item Общезначимость.
По принципу Дирихле (количество таких формул - c(n, 2) ≥ n)
В какой-то формуле встретятся два одинаковых значения и она будет верна,
тогда все выражение будет истинно.
\item Недоказуемость
\begin{enumerate}
\item J₀ - алгебра Яськовского
Определим последовательность алгебр Lₙ, L₀ = J₀,
Lₙ=Γ(Lₙ₋₁) - Гёделева алгебра
Таким образом Lₙ - упорядоченное множество \{0, ω₁, ω₂,\ldots{}1\}
Пусть f - оценка в Lₙ, действующая по таким правилам на нашу формулу:
f(a₁) = 0, f(aₙ₊₁) = 1, f(aᵢ) = wᵢ
при j<i f(aᵢ → aⱼ) = f(aᵢ) → f(aⱼ) = f(aⱼ) ≠ 1
Поскольку ИИВ полно относительно алгебры Гейтинга (Lₙ псевдобулева),
то формула недоказуема
\item Строим модель Крипке как вершину с n+1 сыновьями, в которых вынуждено
по одной переменной. Тогда если в вершине вынуждена формула,
то хотя бы один элемент связки должен быть вынужден, но там везде
по одной переменной и импликация не работает.
\end{enumerate}
\end{enumerate}
\section{Ticket 5: логика 2 порядка}
\label{sec-7}
Как разрешается конфликт с другим правилом вывода?
\subsection{Определения исчисления предикатов, грамматика (Gen ←→ 1,2 ПВ)}
\label{sec-7-1}
Описываем грамматику (goto конспект ДГ)
Описываем модель – предметное множество, формулы для
функциональных символов и предикатов, задать свободные
переменные.
f: [f]:Dⁿ→D
P: [P]:Dᵐ→V
x: [x]:D
(+ немного очевидные формальные правила как делать
оценку - если ∀xP, то [\ldots{}] = 1, если для любого x
P == 1 и так далее)

Добавляются две новые аксиомы
∀x.A → A[x:=θ], где θ свободна для подстановки в A
A[x:=θ] → ∃x.A, -//-

Новое правило вывода:
A ⊢ ∀x.A    GEN

Мы это правило представляем в виде двух утверждений (второй неочевидно откуда)
\uline{A$_{\text{→}}$$_{\text{B}}$}
A → ∀x.B

\uline{A$_{\text{→}}$$_{\text{B}}$}
∃x.A → B

переход от 1 к Gen легко доказать
A
A → ⊤ → A
⊤ → A
⊤ → ∀x.A
∀x.A

Переход от Gen к 1
A → B ⊢ A → ∀x.B
???

В общем-то нам нет необходимости думать о том, как делать переход,
но вопрос интересный (теорему Генцена о непротиворечивости ФА
можно видоизменить с GEN на наши два правила)
\subsection{Теорема о дедукции}
\label{sec-7-2}
→ Если нужно переместить последнее предположение вправо,
то рассматриваем случаи -- старая аксиома или предположение,
MP, это самое выражение, две новых аксиомы с условиями выполнимости,
два новых правила с условиями выполнимости.
\begin{enumerate}
\item Старая аксиома или предположение
A
A → a → A
a → A
\item MP
a → A (по индукции)
\ldots{}
a → A → B (по индукции)
\ldots{}
(a → A) → (a → A → B) → (a → B)
(a → A → B) → (a → B)
a → B
\item A → A умеем доказывать
\item Новые аксиомы как старые, только проверяем условие
\item ∃x.A → B - первое новое правило вывода, проверяем условие
\begin{enumerate}
\item Вспомогательная лемма: (a → (b → c)) → (b → (a → c))
a → (b → c), b, a ⊢ c
a → b → c
b → c
c
\item a → A → B (в первоначальном доказательстве было A → B)
\ldots{}
(a → A → B) → (A → a → B)
A → a → B
∃x.A → a → B (это же правило вывода)
(∃x.A → a → B) → (a → ∃x.A → B)
a → ∃x.A → B
\end{enumerate}
\item A → ∀x.B - второе новое правило вывода, проверяем условие
\begin{enumerate}
\item Вспомагательная лемма 1: (a \& b → c) → (a → b → c)
a \& b → c, a, b ⊢ c
a
b
a → b → a \& b
b → a \& b
a \& b
a \& b → c
c
\item Вспомагательная лемма 2: (a → b → c) → (a \& b → c)
a → b → c, a \& b ⊢ c
a \& b → a
a
a \& b → b
b
b → c
c
\item a → A → B
\ldots{}
(a → A → B) → (a \& A → B)
a \& A → B
a \& A → ∀x.B
(a \& A → ∀x.B) → (a → A → ∀x.B)
a → A → ∀x.B
\end{enumerate}
\end{enumerate}

← Если нужно переместить влево, то перемещаем, добавляем
A→B (последнее)
A    (перемещенное)
B
(тут все как в ИВ)
\subsection{Корректность исчисления предикатов}
\label{sec-7-3}
\begin{itemize}
\item Лемма о корректности подстановки
[a]$^{\text{(x:=[θ])}}$ = [a(x:=[θ])]

Структурная индукция по a:
База: Пусть a - это предикат, тогда из способа оценки предиката
понятно, что [P(θ,..)]=[P(x,\ldots{})]$^{\text{(x:=[θ])}}$
Индукционный переход:
\begin{enumerate}
\item a → b, a \& b, a V b, ¬a
\begin{enumerate}
\item a \& b:
[a \& b]$^{\text{(x:=[θ])}}$ = [a[x:=θ]] \& [b[x:=θ]] = [a[x:=θ] \& b[x:=θ]] =
[(a \& b)[x=[θ]]]
\item аналогично, TODO
\end{enumerate}
\item ∀y.a, ∃y.a
\begin{enumerate}
\item\relax [∀y.a]$^{\text{(x:=[θ])}}$ =? [∀y.a[x:=θ]]
Если x входит в ∀y.a связанно, то вообще никакой роли
наша подстановка в оценке не играет.
Значит пусть входит свободно.
Поскольку θ свободна для подстановки вместо x в a, то
в θ не входит свободно y - оценка θ не меняется.
По предположению индукции [a]$^{\text{(x:=[θ])}}$ = [a[x:=θ]].
Из свободности для подстановки θ следует еще и
[a]$^{\text{(x:=[θ], y:=v)}}$ = [a[x:=θ]]$^{\text{(y:=v)}}$, значит оценки полных
формул с кванторами тоже будут совпадать
\item ∃ аналогично, TODO
\end{enumerate}
\end{enumerate}
\end{itemize}

С помощью леммы проводим аналогичные рассуждения, как для ИВ.
Рассматриваем только новые аксиомы и правила вывода:
\begin{enumerate}
\item ∀x.a → a[x:=θ]
Пусть это не тавтология, тогда ∀x.a = И, a[x:=θ] = Л.
При любом x выполнено a, но с x=θ нет. Противоречие
\item a[x:=θ] → ∃x.a
аналогично, TODO
\item a → b; a → ∀x.b
a → b истинно по предположению индукции. Пусть a → ∀x.b ложь, тогда
a = И, ∀x.b = Л, но b = (∀x.b)@θ, значит это есть частный случай, а
он верен. противоречие
\item a → b; ∃x.a → b
аналогично, TODO
\end{enumerate}
\section{Ticket 6: полнота исч. пред.}
\label{sec-8}
А почему собственно наше множество Г какое-то отношение
имеет к предикатам?
\subsection{Свойства противоречивости}
\label{sec-8-1}
Противоречивая теория – теория, в которой можно
вывести p, ¬p.
\begin{itemize}
\item Лемма: теория противоречива ↔ в ней выводится a \& ¬a
← если выводится a \& ¬a, то противоречива – очевидно
через аксиомы \&
→ если противоречива, то выводится a \& ¬a
a
¬a
a → ¬a → (a \& ¬a)
\end{itemize}
Заметим, что всякое подмножество непрот непротиворечиво.
Заметим, что всякое бесконечное прот. множество содержит
конечное противоречивое подмножество ввиду конечности
вывода.
Совместное множество – множество с моделью (все формулы
множества верны в какой-либо интерпретации).
\subsection{Лемма 1: о дополнении непр. мн-ва до полного}
\label{sec-8-2}
Для всякого непротиворечивого множества Г
замкнутых формул сигнатуры σ существует множество Г',
являющееся к тому же полным, имеющее ту же сигнатуру
и содержащее Г.

Для не более чем счетных сигнатур:
Давайте добавлять недостающие формулы в Г - если есть
формула a, добавим a или ¬a в зависимости от того,
является ли Г∪a или Γ∪¬a противоречивым или нет (выберем
непротиворечивый вариант). Одно всегда верно, потому
что:
\begin{enumerate}
\item Г∪a, Γ∪¬a противоречивы обе. Тогда Γ противоречиво.
\item Г∪a, Γ∪¬a непротиворечивы обе. a → ¬a → a\&¬a. →←
\end{enumerate}

Общий случай:
Лемма Цорна гласит, что частично упор. мн-во, в котором
каждая цепь имеет верхнюю грань, содержит максимальный
элемент.
Рассмотрим частично упорядоченное множество с элементами
непротиворечивыми множествами, а отношение ≤ - это
быть подмножеством. Тогда в силу не более чем счетности
любой цепи по предыдущему случаю каждая цепь имеет
верхнюю границу. По лемме Цорна наше множество содержит
максимальный элемент. Этот элемент полон (если нет,
то можем в него добавить a или ¬a
