mathlogic/mathlogic.org
** Условие о интерпретации непротиворечивого мн-ва
   Будем называть интерпретацией непротиворечивого множества
   формул функцию оценки, тождественно равную 1 на элементах
   из этого множества.
   Будем говорить, что Г ⊨ a, если она тождественна в любой
   модели Г.
** Лемма 2: если Г ⊢ a, то Г ⊨ a
   Механическая проверка аксиом
** Лемма 3: если у Г есть модель, то Г непротиворечиво
   Пусть Г имеет модель, но противоречиво, тогда из Г
   выводится a, ¬a, по корректности Г ⊨ a, ¬a, но формула
   и ее отрицание не могут быть общезначиыми одновременно.
** Лемма 4: о модели бескванторного непротив. мн-ва формул
   Пусть Г - полное непротиворечивое множество
   *бескванторных* формул. Тогда существует модель для Г.

   Построим модель структурной индукцией по формулам.
   Предметное множество - строки, содержащие выражения.
   То есть какое-нибудь f₁(c, b, f₅(c₅)) = "f₁(c, b, f₅(c₅))"
   Мы не хотим заниматься подсчетом, а предпочитаем оставлять
   то, что нужно вычислить как отдельную функцию.
   Рассмотрим формулу - предикат. Его оценка истина, если
   он принадлежит носителю, ложна если его отрицание в носителе
   (в предметном множестве).
   Элементы всегда входят противоречиво (элемент не вдохит со
   своим отрицанием.
   Связки определим естественным образом.
   Докажем, что γ ∈ Γ <=> γ истинна  (Γ - предметное множество)
    * База
      Если атомарная формула лежит в Г, то она истинна по опр.
      Если атомарная формула истинна, то лежит в Г
    * Переход
      1) a & b
         если a & b лежит в Г, то оно истинно по определению.
         если [a & b] = 1
         1. [a & b] = И, покажем a & b ∈ Γ
            Пусть [a & b] = И, тогда по таблице истинности
            [a] = [b] = И, тогда a, b лежат в Г по предполож.
            тогда a → b → a & b лежит в модели
         2. [a & b] = Л, покажем !(a & b) ∈ Г
            a ложь или b ложь по таблице истинности. Пусть
            a ложь, тогда
            ¬a ∈ Г. (a & b) → ¬a, (a & b) → a, 9 акс.
      2) a V b
         1. [a V b] = И
            [а] = И, [b] = И, они лежат в множестве, a → a V b
         2. [a V b] = Л
            ¬a, ¬b лежат в множестве, тогда 9 акс.
      3) Аналогично
** Теорема Гёделя о полноте исчисления предикатов
   Γ - непротиворечивое множество формул, тогда Г имеет модель
*** Построение Г*
    Нам нужно построить из нашего множества формул множество
    безкванторных формул, для этого определим такую операцию
    избавления от 1 квантора:
    Построим новый язык, отличающийся от нашего контантами,
    там будут dᵢⱼ, где первый индекс - это поколение, второй
    – нумерационный.
    Возьмем непротиворечивое множество формул Γᵢ и пополним
    его, получив непротиворечивое множество формул Γᵢ₊₁, такое
    что Гᵢ ⊂ Γᵢ₊₁.
    Возьмем формулу γ ∈ Γᵢ.
    1. Не содержит кванторов. Ничего не делаем
    2. γ = ∀x.a. Возьмем все константы, использующиеся в Γᵢ -
       это будут cᵢ и dₐⱼ, где a ≤ i, занумеруем их θ₁, θ₂,...
       и добавим формулы a₁=a[x:=θ₁],... к Γᵢ₊₁
    3. γ = ∃x.a. Возьмем новую константу dᵢ₊₁ⱼ и добавим
       a[x:=dᵢ₊₁,ⱼ]
    Заметим, что сами формулы с кванторами мы не выкидываем -
    ведь в будущем появятся новые формулы, и процесс для уже
    использованных кванторных формул нужно будет повторить.
    Покажем, что полученные множества остаются непротиворечивыми.
    Гᵢ непротиворечиво, а Γᵢ₊₁ противоречиво, тогда Γᵢ₊₁ ⊢ a&¬a,
    тогда выпишем конечное доказательство, найдем посылки,
    новые в Γᵢ₊₁, которых нету в Γᵢ, выпишем их и впихнем направо
    по теореме о дедукции:
    Гᵢ ⊢ γ₁ → γ₂ → γ₃ → ...→ γₙ → b&¬b
    Новые посылки у нас получаются только из пунктов 2 и 3.
    1. γ₁ = a[x:=θ] из ∀x.a
       ∀x.a → a[x:=θ]
       ∀x.a
       a[x:=θ]
       ...
       a[x:=θ]→(γ₂ → ...γₙ → b&¬b)
       γ₂ → ... → b&¬b
    2. γ₁ = a[x:=dᵢ₊₁,ₖ] из ∃x.a выберем переменную, не участвующую
       в выводе противоречия - z. заменим все вхождения dᵢ₊₁,ₖ
       в д-ве на z. поскольку dₖ - константа, мы можем делать такие
       замены. Поскольку z - константа, специально введенная
       для замены и раньше не встречавшаяся, то она отсутствует
       в γ₂,... + мы можем правильно выбрать b, чтобы она в нем
       отсутствовала. Значит мы можем применить правило вывода с ∃
       a[x:=z] → (γ₂ → ... → b&¬b)
       ∃z.a[x:=z] → ...             правило вывода
       ∃x.a                         из Γᵢ
       ∃z.a[x:=z]
       γ₂ → ... → b&¬b
    Возьмем Г₀ = Γ. Γ* = ∪Γᵢ. Г* также не противоречиво, потому что
    д-во использует конечное количество предположений, добавленных
    на каком-то шаге j максимум, значит множество Γⱼ тоже противоречиво,
    что невозможно по условию.
*** Доказательство того, что дополненное бескв.подмн-во Γ* - модель для Г
    Выделим в Г* бескванторное подмножество G.
    Пополним его по лемме 1 (там где лемма цорна, можем дополнить)
    модель сделаем из него по лемме о бескванторной модели.
    Покажем, что это модель для всего Г*, а значит и для Γ.
    Рассмотрим γ ∈ Γ*, покажем, что [γ] = И.
    * База
      Формула не содержит кванторов. Истинность гарантируется леммой о
      бескванторном множестве.
    * Переход
      Пусть G это модель для любой формулы из Γ* с r кванторами,
      покажем что она остается моделью для r+1 квантора.
      1. γ = ∀x.a
         Покажем, что формула истинна для любого t ∈ D.
         По построению подели есть такое θ, что t = "θ" (string).
         По построению Γ* начиная с шага p+1 мы добавляем формулы
         вида a[x:=k], где k - конструкция из констант и ф.симв.
         Также каждая константа (cᵢ или dᵢⱼ) из θ добавлена на
         некотором шаге sₖ. То есть будет шаг l=max(max(sₖ), p),
         на котором θ обретет смысл и в Γₗ₊₁ будет присутствовать
         a[x:=θ]. В формуле a на один квантор меньше, значит она
         истинна по предположению индукции.
      2. γ = ∃x.a По построению Г* как только добавили a к Гᵢ, так
         сразу в следующем мире Гᵢ₊₁ появляется a[x:=dᵢ₊₁,ₖ]. Значит
         формула истинна на значении "dᵢ₊₁,k", то есть истинна.
** Следствие – если ⊨a, то ⊢a
   * Пусть Г⊬a, тогда по полноте множества Г, Γ⊢¬a, но
     у Г есть модель, в которой Г⊨¬a. То есть Г⊭a.
     Но Г по построению то же, что и модель теории, то есть
     все рассуждения Г ⊢ a равноценны в предикатах ⊢ a.
   * Пусть ⊬a, тогда пусть Γ={¬a}
     1. Г непротиворечиво
        Пусть Г противоречиво, значит ∀b Γ ⊢ b, Γ ⊢ ¬b;
        1. ¬a ⊢ b, ¬a ⊢ b;
        2. ¬a ⊢ a, ¬a ⊢ ¬a;
        3. ⊢ ¬a → a, ¬a → ¬a
        4. ⊢ (¬a → a) → (¬a → ¬a) → ¬¬a
        5. ⊢ ¬¬a → a
        6. ⊢ a          →← а недоказуемо по условию.
     2. Г подходит под условие теоремы Гёделя о полноти
        исчисления предикатов, то есть у Г есть модель.
        Тогда в ней оценка [¬a] = 1, значит оценка [a] = 0,
        то есть ⊭a. Мы доказали мета-контрпозицию ⊬a => ⊭a.
* Ticket 7: ФА
** Структуры и модели, теория первого порядка
   Теория первого порядка - это формальная система с кванторами по
   функциональным символам, но не по предикатам. Рукомахательное
   определение – это фс с логикой первого порядка в основе, в которой
   абстрактные предикаты и функциональные символы определяются точно
   (а может такое определение даже лучше).

   Структура по ДГ:
   Структурой теории первого порядка мы назовем упорядоченную тройку
   <D, F, P>, где F — списки оценок для 0-местных, 1-местных и т.д.
   функций, и P = hP 0 , P 1 , ...i — списки оценок для 0-местных,
   1-местных и т.д. предикатов, D — предметное множество.

   Понятие структуры — развитие понятия оценки из исчисления предикатов.
   Но оно касается только нелогических составляющих теории; истинностные
   значения и оценки для связок по-прежнему определяются исчислением
   предикатов, лежащим в основе теории. Для получения оценки формулы
   нам нужно задать структуру, значения всех свободных индивидных
   переменных, и (естественным образом) вычислить результат.

   Структура по-моему:
   Все то же самое определение из ИВ. Мы просто забиваем на предикаты
   в ИВ (не определям их), расширяем нашу сигнатуру (добавляя конкретные
   предикаты и функциональные символы), определяем для нее интерпретацию.

   И как всегда,..
   Модель – это корректная структура (любое доказуемое утверждение должно
   быть в ней общезначимо).
** Аксиомы Пеано
   Множество N удовлетворяет аксиоматике Пеано, если:
   1. 0 ∈ N
   2. x ∈ N, succ(x) ∈ N
   3. ∄ x ∈ N : (S(x) = 0)
   4. (succ(a) = c & succ(b) = c) → a = b
   5. P(0) & ∀n.(P(n) → P(succ(n))) → ∀n.P(n)
