mathlogic.tex
\subsection{Условие о интерпретации непротиворечивого мн-ва}
\label{sec-8-3}
Будем называть интерпретацией непротиворечивого множества
формул функцию оценки, тождественно равную 1 на элементах
из этого множества.
Будем говорить, что Г ⊨ a, если она тождественна в любой
модели Г.
\subsection{Лемма 2: если Г ⊢ a, то Г ⊨ a}
\label{sec-8-4}
Механическая проверка аксиом
\subsection{Лемма 3: если у Г есть модель, то Г непротиворечиво}
\label{sec-8-5}
Пусть Г имеет модель, но противоречиво, тогда из Г
выводится a, ¬a, по корректности Г ⊨ a, ¬a, но формула
и ее отрицание не могут быть общезначиыми одновременно.
\subsection{Лемма 4: о модели бескванторного непротив. мн-ва формул}
\label{sec-8-6}
Пусть Г - полное непротиворечивое множество
\textbf{бескванторных} формул. Тогда существует модель для Г.

Построим модель структурной индукцией по формулам.
Предметное множество - строки, содержащие выражения.
То есть какое-нибудь f₁(c, b, f₅(c₅)) = "f₁(c, b, f₅(c₅))"
Мы не хотим заниматься подсчетом, а предпочитаем оставлять
то, что нужно вычислить как отдельную функцию.
Рассмотрим формулу - предикат. Его оценка истина, если
он принадлежит носителю, ложна если его отрицание в носителе
(в предметном множестве).
Элементы всегда входят противоречиво (элемент не вдохит со
своим отрицанием.
Связки определим естественным образом.
Докажем, что γ ∈ Γ <=> γ истинна  (Γ - предметное множество)
\begin{itemize}
\item База
Если атомарная формула лежит в Г, то она истинна по опр.
Если атомарная формула истинна, то лежит в Г
\item Переход
\begin{enumerate}
\item a \& b
если a \& b лежит в Г, то оно истинно по определению.
если [a \& b] = 1
\begin{enumerate}
\item\relax [a \& b] = И, покажем a \& b ∈ Γ
Пусть [a \& b] = И, тогда по таблице истинности
[a] = [b] = И, тогда a, b лежат в Г по предполож.
тогда a → b → a \& b лежит в модели
\item\relax [a \& b] = Л, покажем !(a \& b) ∈ Г
a ложь или b ложь по таблице истинности. Пусть
a ложь, тогда
¬a ∈ Г. (a \& b) → ¬a, (a \& b) → a, 9 акс.
\end{enumerate}
\item a V b
\begin{enumerate}
\item\relax [a V b] = И
[а] = И, [b] = И, они лежат в множестве, a → a V b
\item\relax [a V b] = Л
¬a, ¬b лежат в множестве, тогда 9 акс.
\end{enumerate}
\item Аналогично
\end{enumerate}
\end{itemize}
\subsection{Теорема Гёделя о полноте исчисления предикатов}
\label{sec-8-7}
Γ - непротиворечивое множество формул, тогда Г имеет модель
\subsubsection{Построение Г*}
\label{sec-8-7-1}
Нам нужно построить из нашего множества формул множество
безкванторных формул, для этого определим такую операцию
избавления от 1 квантора:
Построим новый язык, отличающийся от нашего контантами,
там будут dᵢⱼ, где первый индекс - это поколение, второй
– нумерационный.
Возьмем непротиворечивое множество формул Γᵢ и пополним
его, получив непротиворечивое множество формул Γᵢ₊₁, такое
что Гᵢ ⊂ Γᵢ₊₁.
Возьмем формулу γ ∈ Γᵢ.
\begin{enumerate}
\item Не содержит кванторов. Ничего не делаем
\item γ = ∀x.a. Возьмем все константы, использующиеся в Γᵢ -
это будут cᵢ и dₐⱼ, где a ≤ i, занумеруем их θ₁, θ₂,\ldots{}
и добавим формулы a₁=a[x:=θ₁],\ldots{} к Γᵢ₊₁
\item γ = ∃x.a. Возьмем новую константу dᵢ₊₁ⱼ и добавим
a[x:=dᵢ₊₁,ⱼ]
\end{enumerate}
Заметим, что сами формулы с кванторами мы не выкидываем -
ведь в будущем появятся новые формулы, и процесс для уже
использованных кванторных формул нужно будет повторить.
Покажем, что полученные множества остаются непротиворечивыми.
Гᵢ непротиворечиво, а Γᵢ₊₁ противоречиво, тогда Γᵢ₊₁ ⊢ a\&¬a,
тогда выпишем конечное доказательство, найдем посылки,
новые в Γᵢ₊₁, которых нету в Γᵢ, выпишем их и впихнем направо
по теореме о дедукции:
Гᵢ ⊢ γ₁ → γ₂ → γ₃ → \ldots{}→ γₙ → b\&¬b
Новые посылки у нас получаются только из пунктов 2 и 3.
\begin{enumerate}
\item γ₁ = a[x:=θ] из ∀x.a
∀x.a → a[x:=θ]
∀x.a
a[x:=θ]
\ldots{}
a[x:=θ]→(γ₂ → \ldots{}γₙ → b\&¬b)
γ₂ → \ldots{} → b\&¬b
\item γ₁ = a[x:=dᵢ₊₁,ₖ] из ∃x.a выберем переменную, не участвующую
в выводе противоречия - z. заменим все вхождения dᵢ₊₁,ₖ
в д-ве на z. поскольку dₖ - константа, мы можем делать такие
замены. Поскольку z - константа, специально введенная
для замены и раньше не встречавшаяся, то она отсутствует
в γ₂,\ldots{} + мы можем правильно выбрать b, чтобы она в нем
отсутствовала. Значит мы можем применить правило вывода с ∃
a[x:=z] → (γ₂ → \ldots{} → b\&¬b)
∃z.a[x:=z] → \ldots{}             правило вывода
∃x.a                         из Γᵢ
∃z.a[x:=z]
γ₂ → \ldots{} → b\&¬b
\end{enumerate}
Возьмем Г₀ = Γ. Γ* = ∪Γᵢ. Г* также не противоречиво, потому что
д-во использует конечное количество предположений, добавленных
на каком-то шаге j максимум, значит множество Γⱼ тоже противоречиво,
что невозможно по условию.
\subsubsection{Доказательство того, что дополненное бескв.подмн-во Γ* - модель для Г}
\label{sec-8-7-2}
Выделим в Г* бескванторное подмножество G.
Пополним его по лемме 1 (там где лемма цорна, можем дополнить)
модель сделаем из него по лемме о бескванторной модели.
Покажем, что это модель для всего Г*, а значит и для Γ.
Рассмотрим γ ∈ Γ*, покажем, что [γ] = И.
\begin{itemize}
\item База
Формула не содержит кванторов. Истинность гарантируется леммой о
бескванторном множестве.
\item Переход
Пусть G это модель для любой формулы из Γ* с r кванторами,
покажем что она остается моделью для r+1 квантора.
\begin{enumerate}
\item γ = ∀x.a
Покажем, что формула истинна для любого t ∈ D.
По построению подели есть такое θ, что t = "θ" (string).
По построению Γ* начиная с шага p+1 мы добавляем формулы
вида a[x:=k], где k - конструкция из констант и ф.симв.
Также каждая константа (cᵢ или dᵢⱼ) из θ добавлена на
некотором шаге sₖ. То есть будет шаг l=max(max(sₖ), p),
на котором θ обретет смысл и в Γₗ₊₁ будет присутствовать
a[x:=θ]. В формуле a на один квантор меньше, значит она
истинна по предположению индукции.
\item γ = ∃x.a По построению Г* как только добавили a к Гᵢ, так
сразу в следующем мире Гᵢ₊₁ появляется a[x:=dᵢ₊₁,ₖ]. Значит
формула истинна на значении "dᵢ₊₁,k", то есть истинна.
\end{enumerate}
\end{itemize}
\subsection{Следствие – если ⊨a, то ⊢a}
\label{sec-8-8}
\begin{itemize}
\item Пусть Г⊬a, тогда по полноте множества Г, Γ⊢¬a, но
у Г есть модель, в которой Г⊨¬a. То есть Г⊭a.
Но Г по построению то же, что и модель теории, то есть
все рассуждения Г ⊢ a равноценны в предикатах ⊢ a.
\item Пусть ⊬a, тогда пусть Γ=\{¬a\}
\begin{enumerate}
\item Г непротиворечиво
Пусть Г противоречиво, значит ∀b Γ ⊢ b, Γ ⊢ ¬b;
\begin{enumerate}
\item ¬a ⊢ b, ¬a ⊢ b;
\item ¬a ⊢ a, ¬a ⊢ ¬a;
\item ⊢ ¬a → a, ¬a → ¬a
\item ⊢ (¬a → a) → (¬a → ¬a) → ¬¬a
\item ⊢ ¬¬a → a
\item ⊢ a          →← а недоказуемо по условию.
\end{enumerate}
\item Г подходит под условие теоремы Гёделя о полноти
исчисления предикатов, то есть у Г есть модель.
Тогда в ней оценка [¬a] = 1, значит оценка [a] = 0,
то есть ⊭a. Мы доказали мета-контрпозицию ⊬a => ⊭a.
\end{enumerate}
\end{itemize}
