mathlogic/mathlogic.org
*** Аккерманн не примитивно-рекурсивен
    Пусть f(n₁...nₖ) - примитивная рекурсинвная функция, k ≥ 0.
    ∃J:f(n₁...nₖ)<A(J, ∑(n₁,...nₖ))

    ]n~ = (n₁...nₖ)
    Индукция по рекурсивным функциям
    * База:
      f(n~) - N или Z или Uₖⱼ
      1. f(n~) = N, k = 1; Пусть J=1, по (i) и лемме 3c
         f(n) = N(n) = n + 1 = A(0, n) < A(1, n) = A(J, n) = A(J, ∑(n~))
      2. f(n~) = Z, k = 1;
         f(n) = 0 < A(J, n) (потому что A ≥ 1) = A(J, ∑(n~))
      3. f(n~) = Uₖⱼ; k = k; Пусть J=1
         f(n₁...nₖ) = Uₖⱼ(n₁...nₖ) = nⱼ
         Пусть nⱼ = 0, тогда f(n) = 0 < A(J, ∑(n~)) для любого нормального J
         Пусть nⱼ > 0, тогда f(n) = (nⱼ - 1) + 1 = A(0, nⱼ - 1) < A(1, n)
         = A(J, ∑(n~))
    * Переход
      1. Предположим, что f(n~) = S<h, g₁...gₘ>(n~) = h(g₁(n~),...gₘ(n~))
         По предположению индукции существует J₀ для h, J₁...Jₘ для g₁...gₘ.
         f(n~) = h(g₁(n~),..)
         < A(J₀, ∑{i=1..m}(n~))            по выбору J₀
         < A(J₀, ∑(A(Jᵢ, ∑(n~))))           по выбору Jᵢ и строгой монотонности
         // J* = max(J₁..Jₘ) + 4(m - 1)
         < A(J₀, A(J*, ∑(n~)))             по лемме 4 примененной m-1 раз
         < A(J₀, A(J*+1, ∑(n~)))           по монотонности
         ≤ A(J₀, A(max(J₀, J*) + 1, ∑(n~))) по монотонности
         ≤ A(max(J₀, J*) + 1, ∑(n~) + 1)   (iii)
         = A(max(J₀, J*) + 2, ∑(n~))       по лемме 3b
         Тогда пусть j=max(J₀, J*) + 2
      2. Пусть f(n~) = R<h,g>(n~)
         f(n₁...nₖ, 0) = h(n₁...nₖ)
         f(n₁...nₖ, m+1) = g(n₁...nₖ, m, f(n₁...nₖ, m))
         По предположению имеем J₀ (h), J₁ (g).
         ] J = max(J₀, J₁) + 4
         1) f(n~, 0)
            ≤ f(n~, 0) + ∑(n~)
            = h(n~) + ∑(n~)
            < A(J₀, ∑(n~)) + ∑(n~)
            < A(J₀ + 4, ∑(n~))                   по лемме 5
            < A(J, ∑(n~))                       по монотонности
            = A(J, ∑(n~) + 0)
         2) f(n~, k + 1)
            = g(n~, k, f(n~, k))
            < A(J₁, ∑(n~) + k + f(n~, k))        по выбору J₁
            < A(J₁, ∑(n~) + k + 1 + f(n~, k))    по монотонности
            = A(J₁, A(0, ∑(n~) + k) + f(n~, k))  (i)
            < A(J₁, A(0, ∑(n~) + k) + H(J, ∑(n~)+k)) по предположению
            < A(J₁, A(J, ∑(n~)+k)+A(J, ∑(n~) + k)) по монотонности (J > 0)
            = A(J₁, 2 * [A(J, ∑(n~) + k)])
            < A(J₁, 2 * [A(J, ∑(n~) + k)] + 3)
            = A(J₁, A(2, A(J, ∑(n~) + k)))        по лемме 1
            < A(J₁, A(J₁ + 1, A(J, ∑(n~) + k)))   по строгой монотонности (J₁ > 2)
            = A(J₁ + 1, A(J, ∑(n~) + k) + 1)      (iii)
            ≤ A(J₁ + 2, A(J, ∑(n~) + k))
            < A(J - 1, A(J, ∑(n~) + k))           по монот. J > max(..) + 4
            = A(J, ∑(n~) + (k + 1))               (iii), J != 0
*** Аккерманн рекурсивен
    Можем сказать, что он рекурсивный, потому что мы можем
    его написать на компьютере, а тьюринг выражается в рекурсивных функциях.
* Ticket 9: представимость
** Функции, их представимость
   Арифметическая функция - это отображение f: N₀ⁿ → N₀
   Арифметическое отношение - это P ∈ N₀ⁿ
   Если k ∈ N₀, то k~ = 0'''''..., где количество штрихов
   есть k.
   * Арифметическое отношение R ∈ N₀ⁿ выразимо в ФА, если
     ∃a с n свободными переменными:
     a(x₁...xₙ), такая что
     1. Eсли R(k₁...kₙ), то ⊢ a(k₁~...kₙ~)
     2. Eсли ¬R(k₁..kₙ), то ⊢ ¬a(k₁~...kₙ~)
   * C_R - функция, равная 1, если R, и равная 0, если ¬R
   * ∃!y.φ(y) = ∃y.φ(y) & ∀a∀b(φ(a) & φ(b) → a = b)
   * f: N₀ⁿ → N₀ представима в ФА, если ∃a(x₁...xₙ₊₁), что
     ∀x₁...xₙ+₁:
     1. f(x₁...xₙ) = xₙ₊₁ <=> ⊢a(x₁~,...xₙ₊₁~)
     2. ∃!b(a(x₁~...xₙ~, b))
** Теорема о связи представимости и выразимости
   R выразимо <=> Cᵣ представимо
   → a выражает R
   (a → (xₙ₊₁=0')) & (¬a → (xₙ₊₁=0))
   представляет Cᵣ
   По выразимости R ⊢ a; тогда ⊤→a→⊤ => a→⊤
   По 10i, перенесенной к нам a → (¬a → ⊥)
   правило с единственностью вроде понятно (хотя руками помахал, да)
   ← Cᵣ представимо → R выразимо
   Пусть представлять Cᵣ будет
   a(x₁....xₙ,xₙ₊₁)
   Тогда определим, какая формула выражает R:
   a(...., 1)
   Из представимости:
     * ∃b.a(x₁...xₙ₊₁)
     * ∀x∀y(a(...x) & a(... y) → x = y)
     * если Cᵣ(x₁...xₙ) = 1, то ⊢ a(x₁...xₙ,1)
     * если Cᵣ(...) = 0, то ⊢ a(..,0)

   Докажем выводимость
     1. Покажем, что если R(x₁...xₙ), то ⊢ a(x₁...xₙ, 1)
        Из представимости прямо ровно.
     2. Покажем, что если ¬R(x₁....xₙ), то ⊢ ¬a(x₁...xₙ, 1)
        по единственности

        ∀x∀y(a(x₁...xₙ, x) & a(x₁...xₙ, y) → x = y)
        a(x₁...xₙ, 0) & a(x₁...xₙ, 1) → (0 = 1) (спустя две акс. и 2 MP)
        дедукцию
        a(x₁...xₙ, 0) & a(x₁...xₙ, 1) ⊢ ⊥
        a(x₁...xₙ, 0) & a(x₁...xₙ, 1) → a(x₁...xₙ, 0)
        a(x₁...xₙ, 0)
        ¬a(x₁...xₙ, 0)                          по представимости
        a(x₁...xₙ, 0) → (¬a(x₁...xₙ, 0) → ¬a(x₁...xₙ, 1)) (10i в ИИВ, доказуема в предикатах)
        ¬a(x₁...xₙ, 1)
        хотим ¬a(x₁...xₙ, 1)
** beta-функция Гёделя, китайская теорема об остатках
   β(b,c,i) = b % (1 + c(1 + i)),
   где %(a, b) = d, ∀m.(d + m * b = a), m≥0, 0≤d≤b
*** Китайская теорема об остатках
    n₁...nₖ - попарно взаимно простые инты
    r₁...rₖ - любые целые, что 0 ≤ rᵢ < nᵢ
    ∀i∃b  rᵢ = b % nₖ
*** Гёделева Г-последовательность
    Гᵢ = (i + 1) * c + 1
    Γ(c) = 1*c + 1, 2*c + 1, 3*c + 1,...(n+1)*c + 1

    Докажем, что Г(c) подходит на роль n₁...nₖ в китайской
    теореме об остатках. Выделим последовательность размера
    n: k₁...kₙ.
    Чтобы это выполнялось возьмем c = (max(k₁...kₙ))!
**** В Г любые два элемента попарно взаимно простые
     Пусть Γᵢ ⋮ Γⱼ имеют общий делитель p > 1. Мы можем его разложить
     на простые множители и взять какой-нибудь простой (любое число
     раскладывается на простые множители).
     Тогда (Γᵢ - Γⱼ) ⋮ p, (c * (i - j)) ⋮ p. Заметим, что ¬(c ⋮ p),
     потому что иначе Γᵢ = 1 + c * (i + 1) ⋮ p и c * (i + 1) ⋮ p,
     а они отличаются на единицу. Тогда (i - j) ⋮ p, но c = m! m > n,
     а i - j < n, значит c ⋮ p. →←
**** Каждое kᵢ < Гᵢ
     kᵢ ≤ c < 1 + c * (i + 1) = Γᵢ
*** Лемма о β-функции
    Увидим, что β(b,c,i) считает остаток от деления b на
    (i + 1) * c + 1 - элемент Геделевой последовательности.
    * <a₀...aₙ>∈N → ∃b∃c(aₖ=β(b,i,c)) - β-функция кодирует
      последовательность натуральных чисел и может
      доставать по индексу i

      a₀...aₙ  - последовательность натуральных чисел
      тогда существует такое c, что Г = 1*c+1, 2*c+1,...
      если c ≥ max(a₀...aₙ), то aₖ < (i+1)*c+1
      Но по свойству Г элементы попарно взаимно просты
      тогда сравнения
      a₀ % (0+1)*c+1
      a₁ % (1+1)*c+1
      .............
      aₙ % (n+1)*c+1
      имеют общее решение b по китайской теореме об остатках
      тогда aᵢ = b % (i+1)*c + 1
      но это и есть β-функция
      aᵢ = β(b,c,i)
