mathlogic.tex
\subsubsection{Аккерманн не примитивно-рекурсивен}
\label{sec-10-3-10}
Пусть f(n₁\ldots{}nₖ) - примитивная рекурсинвная функция, k ≥ 0.
∃J:f(n₁\ldots{}nₖ)<A(J, ∑(n₁,\ldots{}nₖ))

]n\textasciitilde{} = (n₁\ldots{}nₖ)
Индукция по рекурсивным функциям
\begin{itemize}
\item База:
f(n\textasciitilde{}) - N или Z или Uₖⱼ
\begin{enumerate}
\item f(n\textasciitilde{}) = N, k = 1; Пусть J=1, по (i) и лемме 3c
f(n) = N(n) = n + 1 = A(0, n) < A(1, n) = A(J, n) = A(J, ∑(n\textasciitilde{}))
\item f(n\textasciitilde{}) = Z, k = 1;
f(n) = 0 < A(J, n) (потому что A ≥ 1) = A(J, ∑(n\textasciitilde{}))
\item f(n\textasciitilde{}) = Uₖⱼ; k = k; Пусть J=1
f(n₁\ldots{}nₖ) = Uₖⱼ(n₁\ldots{}nₖ) = nⱼ
Пусть nⱼ = 0, тогда f(n) = 0 < A(J, ∑(n\textasciitilde{})) для любого нормального J
Пусть nⱼ > 0, тогда f(n) = (nⱼ - 1) + 1 = A(0, nⱼ - 1) < A(1, n)
= A(J, ∑(n\textasciitilde{}))
\end{enumerate}
\item Переход
\begin{enumerate}
\item Предположим, что f(n\textasciitilde{}) = S<h, g₁\ldots{}gₘ>(n\textasciitilde{}) = h(g₁(n\textasciitilde{}),\ldots{}gₘ(n\textasciitilde{}))
По предположению индукции существует J₀ для h, J₁\ldots{}Jₘ для g₁\ldots{}gₘ.
f(n\textasciitilde{}) = h(g₁(n\textasciitilde{}),..)
< A(J₀, ∑\{i=1..m\}(n\textasciitilde{}))            по выбору J₀
< A(J₀, ∑(A(Jᵢ, ∑(n\textasciitilde{}))))           по выбору Jᵢ и строгой монотонности
// J* = max(J₁..Jₘ) + 4(m - 1)
< A(J₀, A(J*, ∑(n\textasciitilde{})))             по лемме 4 примененной m-1 раз
< A(J₀, A(J*+1, ∑(n\textasciitilde{})))           по монотонности
≤ A(J₀, A(max(J₀, J*) + 1, ∑(n\textasciitilde{}))) по монотонности
≤ A(max(J₀, J*) + 1, ∑(n\textasciitilde{}) + 1)   (iii)
= A(max(J₀, J*) + 2, ∑(n\textasciitilde{}))       по лемме 3b
Тогда пусть j=max(J₀, J*) + 2
\item Пусть f(n\textasciitilde{}) = R<h,g>(n\textasciitilde{})
f(n₁\ldots{}nₖ, 0) = h(n₁\ldots{}nₖ)
f(n₁\ldots{}nₖ, m+1) = g(n₁\ldots{}nₖ, m, f(n₁\ldots{}nₖ, m))
По предположению имеем J₀ (h), J₁ (g).
] J = max(J₀, J₁) + 4
\begin{enumerate}
\item f(n\textasciitilde{}, 0)
≤ f(n\textasciitilde{}, 0) + ∑(n\textasciitilde{})
= h(n\textasciitilde{}) + ∑(n\textasciitilde{})
< A(J₀, ∑(n\textasciitilde{})) + ∑(n\textasciitilde{})
< A(J₀ + 4, ∑(n\textasciitilde{}))                   по лемме 5
< A(J, ∑(n\textasciitilde{}))                       по монотонности
= A(J, ∑(n\textasciitilde{}) + 0)
\item f(n\textasciitilde{}, k + 1)
= g(n\textasciitilde{}, k, f(n\textasciitilde{}, k))
< A(J₁, ∑(n\textasciitilde{}) + k + f(n\textasciitilde{}, k))        по выбору J₁
< A(J₁, ∑(n\textasciitilde{}) + k + 1 + f(n\textasciitilde{}, k))    по монотонности
= A(J₁, A(0, ∑(n\textasciitilde{}) + k) + f(n\textasciitilde{}, k))  (i)
< A(J₁, A(0, ∑(n\textasciitilde{}) + k) + H(J, ∑(n\textasciitilde{})+k)) по предположению
< A(J₁, A(J, ∑(n\textasciitilde{})+k)+A(J, ∑(n\textasciitilde{}) + k)) по монотонности (J > 0)
= A(J₁, 2 * [A(J, ∑(n\textasciitilde{}) + k)])
< A(J₁, 2 * [A(J, ∑(n\textasciitilde{}) + k)] + 3)
= A(J₁, A(2, A(J, ∑(n\textasciitilde{}) + k)))        по лемме 1
< A(J₁, A(J₁ + 1, A(J, ∑(n\textasciitilde{}) + k)))   по строгой монотонности (J₁ > 2)
= A(J₁ + 1, A(J, ∑(n\textasciitilde{}) + k) + 1)      (iii)
≤ A(J₁ + 2, A(J, ∑(n\textasciitilde{}) + k))
< A(J - 1, A(J, ∑(n\textasciitilde{}) + k))           по монот. J > max(..) + 4
= A(J, ∑(n\textasciitilde{}) + (k + 1))               (iii), J != 0
\end{enumerate}
\end{enumerate}
\end{itemize}
\subsubsection{Аккерманн рекурсивен}
\label{sec-10-3-11}
Можем сказать, что он рекурсивный, потому что мы можем
его написать на компьютере, а тьюринг выражается в рекурсивных функциях.
\section{Ticket 9: представимость}
\label{sec-11}
\subsection{Функции, их представимость}
\label{sec-11-1}
Арифметическая функция - это отображение f: N₀ⁿ → N₀
Арифметическое отношение - это P ∈ N₀ⁿ
Если k ∈ N₀, то k\textasciitilde{} = 0'''''\ldots{}, где количество штрихов
есть k.
\begin{itemize}
\item Арифметическое отношение R ∈ N₀ⁿ выразимо в ФА, если
∃a с n свободными переменными:
a(x₁\ldots{}xₙ), такая что
\begin{enumerate}
\item Eсли R(k₁\ldots{}kₙ), то ⊢ a(k₁\textasciitilde{}\ldots{}kₙ\textasciitilde{})
\item Eсли ¬R(k₁..kₙ), то ⊢ ¬a(k₁\textasciitilde{}\ldots{}kₙ\textasciitilde{})
\end{enumerate}
\item C$_{\text{R}}$ - функция, равная 1, если R, и равная 0, если ¬R
\item ∃!y.φ(y) = ∃y.φ(y) \& ∀a∀b(φ(a) \& φ(b) → a = b)
\item f: N₀ⁿ → N₀ представима в ФА, если ∃a(x₁\ldots{}xₙ₊₁), что
∀x₁\ldots{}xₙ+₁:
\begin{enumerate}
\item f(x₁\ldots{}xₙ) = xₙ₊₁ <=> ⊢a(x₁\textasciitilde{},\ldots{}xₙ₊₁\textasciitilde{})
\item ∃!b(a(x₁\textasciitilde{}\ldots{}xₙ\textasciitilde{}, b))
\end{enumerate}
\end{itemize}
\subsection{Теорема о связи представимости и выразимости}
\label{sec-11-2}
R выразимо <=> Cᵣ представимо
→ a выражает R
(a → (xₙ₊₁=0')) \& (¬a → (xₙ₊₁=0))
представляет Cᵣ
По выразимости R ⊢ a; тогда ⊤→a→⊤ => a→⊤
По 10i, перенесенной к нам a → (¬a → ⊥)
правило с единственностью вроде понятно (хотя руками помахал, да)
← Cᵣ представимо → R выразимо
Пусть представлять Cᵣ будет
a(x₁\ldots{}.xₙ,xₙ₊₁)
Тогда определим, какая формула выражает R:
a(\ldots{}., 1)
Из представимости:
\begin{itemize}
\item ∃b.a(x₁\ldots{}xₙ₊₁)
\item ∀x∀y(a(\ldots{}x) \& a(\ldots{} y) → x = y)
\item если Cᵣ(x₁\ldots{}xₙ) = 1, то ⊢ a(x₁\ldots{}xₙ,1)
\item если Cᵣ(\ldots{}) = 0, то ⊢ a(..,0)
\end{itemize}

Докажем выводимость
\begin{enumerate}
\item Покажем, что если R(x₁\ldots{}xₙ), то ⊢ a(x₁\ldots{}xₙ, 1)
Из представимости прямо ровно.
\item Покажем, что если ¬R(x₁\ldots{}.xₙ), то ⊢ ¬a(x₁\ldots{}xₙ, 1)
по единственности

∀x∀y(a(x₁\ldots{}xₙ, x) \& a(x₁\ldots{}xₙ, y) → x = y)
a(x₁\ldots{}xₙ, 0) \& a(x₁\ldots{}xₙ, 1) → (0 = 1) (спустя две акс. и 2 MP)
дедукцию
a(x₁\ldots{}xₙ, 0) \& a(x₁\ldots{}xₙ, 1) ⊢ ⊥
a(x₁\ldots{}xₙ, 0) \& a(x₁\ldots{}xₙ, 1) → a(x₁\ldots{}xₙ, 0)
a(x₁\ldots{}xₙ, 0)
¬a(x₁\ldots{}xₙ, 0)                          по представимости
a(x₁\ldots{}xₙ, 0) → (¬a(x₁\ldots{}xₙ, 0) → ¬a(x₁\ldots{}xₙ, 1)) (10i в ИИВ, доказуема в предикатах)
¬a(x₁\ldots{}xₙ, 1)
хотим ¬a(x₁\ldots{}xₙ, 1)
\end{enumerate}
\subsection{beta-функция Гёделя, китайская теорема об остатках}
\label{sec-11-3}
β(b,c,i) = b \% (1 + c(1 + i)),
где \%(a, b) = d, ∀m.(d + m * b = a), m≥0, 0≤d≤b
\subsubsection{Китайская теорема об остатках}
\label{sec-11-3-1}
n₁\ldots{}nₖ - попарно взаимно простые инты
r₁\ldots{}rₖ - любые целые, что 0 ≤ rᵢ < nᵢ
∀i∃b  rᵢ = b \% nₖ
\subsubsection{Гёделева Г-последовательность}
\label{sec-11-3-2}
Гᵢ = (i + 1) * c + 1
Γ(c) = 1*c + 1, 2*c + 1, 3*c + 1,\ldots{}(n+1)*c + 1

Докажем, что Г(c) подходит на роль n₁\ldots{}nₖ в китайской
теореме об остатках. Выделим последовательность размера
n: k₁\ldots{}kₙ.
Чтобы это выполнялось возьмем c = (max(k₁\ldots{}kₙ))!
\begin{enumerate}
\item В Г любые два элемента попарно взаимно простые
\label{sec-11-3-2-1}
Пусть Γᵢ ⋮ Γⱼ имеют общий делитель p > 1. Мы можем его разложить
на простые множители и взять какой-нибудь простой (любое число
раскладывается на простые множители).
Тогда (Γᵢ - Γⱼ) ⋮ p, (c * (i - j)) ⋮ p. Заметим, что ¬(c ⋮ p),
потому что иначе Γᵢ = 1 + c * (i + 1) ⋮ p и c * (i + 1) ⋮ p,
а они отличаются на единицу. Тогда (i - j) ⋮ p, но c = m! m > n,
а i - j < n, значит c ⋮ p. →←
\item Каждое kᵢ < Гᵢ
\label{sec-11-3-2-2}
kᵢ ≤ c < 1 + c * (i + 1) = Γᵢ
\end{enumerate}
\subsubsection{Лемма о β-функции}
\label{sec-11-3-3}
Увидим, что β(b,c,i) считает остаток от деления b на
(i + 1) * c + 1 - элемент Геделевой последовательности.
\begin{itemize}
\item <a₀\ldots{}aₙ>∈N → ∃b∃c(aₖ=β(b,i,c)) - β-функция кодирует
последовательность натуральных чисел и может
доставать по индексу i

a₀\ldots{}aₙ  - последовательность натуральных чисел
тогда существует такое c, что Г = 1*c+1, 2*c+1,\ldots{}
если c ≥ max(a₀\ldots{}aₙ), то aₖ < (i+1)*c+1
Но по свойству Г элементы попарно взаимно просты
тогда сравнения
a₀ \% (0+1)*c+1
a₁ \% (1+1)*c+1
\ldots{}\ldots{}\ldots{}\ldots{}.
aₙ \% (n+1)*c+1
имеют общее решение b по китайской теореме об остатках
тогда aᵢ = b \% (i+1)*c + 1
но это и есть β-функция
aᵢ = β(b,c,i)
\end{itemize}
