mathlogic/mathlogic.org
*** Представимость β-функции Гёделя в ФА
    β-функция представима в ФА отношением
    B(b,c,i,d) = ∃q((b = q * (1 + c * (i + 1)) + d) & (d < 1 + c * (i + 1)))
    Пусть 1 + c * (i + 1) = z
    Докажем условия представимости:
    1. Эквивалентность
       1) β(b,c,i) = d, тогда ⊢ B(b,c,i,d)
          b = z * (1 + c * (i + 1))    (это и следующее - из леммы о β) P
          d < 1 + c * (i + 1)                                           Q
          P → Q → P & Q
          P & Q
          P & Q → ∃q.(P & Q) [z:= q]
          ∃q.(P & Q)
       2) Пусть ⊢ B(b,c,i,d), тогда
          ∃q.(P & Q)
          подберем такое q (по лемме)
          P & Q → P
          P & Q → Q
          P
          Q
          значит β(b,c,i) = d
    2. Единственность
       Следует из леммы.
** Теорема о представимости рекурсивных функций Z, N, U
   1. Z
      Z(a, b) = (b = 0)
      * Z(a) = b верно, тогда b = 0
        b = 0
      * (b = 0)
        b = 0
        тогда Z(0) = 0, все ок
      * ∃y.φ(y) & ∀a∀b(φ(a) & φ(b) → a = b)
        Тоже как-то несложно
   2. N
      N(a, b) = (a = b')
      * N(a) = b, тогда a = b'
        a = b'
      * a = b', тогда
        N(a) = b
      * Третье не хочу
   3. Uₙᵢ
      Uₙᵢ(x₁...xₙ) = (x₁ = x₁) & (x₂ = x₂) & ... & (xₙ₊₁ = xᵢ)
      * U(..) = xᵢ, тогда xₙ₊₁ = x₁
        x₁ = x₁ доказывается
        ...
        xₙ = xₙ доказывается
        xₙ₊₁ = x₁ по условию
        объединяем все &
      * (x₁ = x₁) & ....
        вытаскиваем каждый элемент и тогда видим, что
        проекция делает ровно то, что должна.
      * ∃q.(xₙ₊₁ = q)
        ХЗ
      * ∀a∀b(x(...a)&x(....b) → a = b)
        Для конкретных a, b обявляем a = b - ⊤, тогда выводим
        из него конъюнкцию и навешиваем два квантора
** Теорема о представимости S
   Eсли f и g₁...gₙ представимы, то S<f, g₁...gₙ> представима
   Пусть F, G₁...Gₙ представляют их.
   S(a₁...aₘ, b) = ∃b₁...∃bₙ(G₁(a₁...aₙ, b₁) & ... & Gn(a₁...aₘ, bₙ)
   & F(b₁...bₙ, b))
   * Пусть S(a₁...aₙ) = b, тогда существуют такие b₁...bₙ, что #каждый аргумент#
     Поскольку f,g₁...gₙ представимы, то доказуемы по представимости
     f(b₁...bₙ, b)
     g₁(a₁...aₙ, b₁)
     ...
     gₙ(a₁...aₙ, bₙ)
     g₁ & g₂ & ... & gₙ & f    объединили &     "P"
     "P" → ∃b₁."P[b₁:=b₁]" + MP
     ...
     Ну и навесили кванторы, да.
   * Пусть верна формула с кванторами. Тогда она и есть уже то, что надо
   * не могу, да и вообще нигде это свойство не доказывается
** Теорема о представимости R
   Пусть f, g представимы F, G. Тогда R<f,g> представима.
   f: Nⁿ→N, g:Nⁿ⁺²→N
   r(x₁...xₙ, k, a) =
      ∃b∃c(
           ∃k(β(b, c, 0, k) & φ(x₁...xₙ, k))
           & B(b, c, xₙ₊₁, a)
           & ∀k(k<xₙ₊₁ → ∃d∃e(B(b,c,k,d)&B(b,c,k',e)&G(x₁...xₙ,k,d,e))))
   Единственная возможность осознать -- внимательно прочесть формулу.
   Тут β-функция используется в качестве функии отображения нашего шага
   вычисления рекурсии в результат, типа
   0 - F(...)
   1 - G(...)
   ...
   n - G(...)
** Теорема о представимости μ
   f: Nⁿ⁺¹→N представима F, тогда μ<f> представима M
   Μ<F>(x₁...xₙ₊₁) = F(x₁...xₙ, xₙ₊₁, 0) & ∀y((y < xₙ₊₁) → ¬F(x₁...xₙ, y, 0))
   * μ<f>(x₁...xₙ) = xₙ₊₁, тогда xₙ₊₁ - минимальное k, такое что f(x₁..xₙ,k) = 0
     то есть имеем
     F(x₁...xₙ, xₙ₊₁, 0)
     ∀x.(k < x → ¬F(x₁...xₙ, k, 0))
     Просто объединим конъюнкцией
   * обратно ей же и разъединим
* Ticket 10: Тьюринг
** Арифметические отношения, их выразимость
   * Арифметическое отношение R ∈ N₀ⁿ выразимо в ФА, если
     ∃a с n свободными переменными:
     a(x₁...xₙ), такая что
     1. Eсли R(k₁...kₙ), то ⊢ a(k₁~...kₙ~)
     2. Eсли ¬R(k₁..kₙ), то ⊢ ¬a(k₁~...kₙ~)
** Гёделева нумерация
   | a   |             `a | описание                              |
   |-----+----------------+---------------------------------------|
   | (   |              3 |                                       |
   | )   |              5 |                                       |
   | ,   |              7 |                                       |
   | ¬   |              9 |                                       |
   | →   |             11 |                                       |
   | V   |             13 |                                       |
   | &   |             15 |                                       |
   | ∀   |             17 |                                       |
   | ∃   |             19 |                                       |
   | xₖ  |     21 + 6 * k | переменные                            |
   | fⁿₖ | 23 + 6 *ᵏ * 3ⁿ | n-местные функцион. символы (', +, *) |
   | Pⁿₖ | 25 + 6 *ᵏ * 3ⁿ | n-местные предикаты (=)               |
   |-----+----------------+---------------------------------------|

   Последовательность значков будем составлять так:
   a₁...aₙ - наши простые числа, соответствующие char'ам, тогда
   p₁^(a₁) * p₂^(a₂),...pₙ^(aₙ) - геделев нумерал стринга, составленного
   из чаров.

   Если a - выражение, то `a - выражение в Геделевой форме (на
   практике пишут квадратные скобочки без нижних их половинок)
   Тогда если a - выражение, `a~ - это элемент предметного множества
   ФА, соответствующий нолику с количеством черточек, равным `a.

   Доказательство - это последовательность простых чисел, возведенная
   в геделевы нумералы выражений, являющихся составляющими док-ва, по
   порядку. Аналогично с составлением строки из символов.

   Тогда определим следующие функции операций с нумералами:
   * plog(a, b) = max n : a % bⁿ = 0
     Иногда вместо b стоит P_b, где P_b - простое число с индексом b.
     Функция берет геделев нумерал и достает у него i-й элем. последов.
   * len = max n : a % pₙ
     Возвращает длину строки\д-ва
   * s@t = p₁^(plog(s, 1)) * ... * pₗₑₙ₍ₛ₎^(plog(s, len(s))) *
     pₗₑₙ₍ₛ₎₊₁^(plog(t, 1)) * ... * pₗₑₙ₍ₛ₎₊ₗₑₙ₍ₜ₎^(plog(t, len(t)))
     Конкатенация строк
** Машина Тьюринга
   Машина тьюринга состоит из ленты, головки, регистра состояния и конечной
   таблицы состояний
   Более формально, это 7-кортеж: <Q, Γ, b, ∑, δ, q₀, F>
   Конечный список состояний, конечный алфавит, пустой символ из алфавита,
   символы, которые мы можем писать (из Γ \ b), функция таблицы состояний,
   начальное состояние из Q, конечное состояние из Q.
   * Лента - бесконечный двусвязный список, в каждой ячейке которого
     содержится символ из конечного алфавита, в котором также есть
     пустой символ (тут и далее  ), которым изначально заполнена вся
     лента
   * Головка может находиться над элементом, писать в него и читать из
     него символ. Может двигаться влево-вправо (или двигать ленту, неважно)
   * Регистр состояния хранит состояние - элемент из конечного множества
     состояний машины. Есть особые состояния - стартовое и конечные.
   * Таблица состяний - таблица, хранящая данные о функции смены
     состояния - foo: Γ × Q → Γ × Q × {left, this, right}.
     Функция берет текущее состояние, читает символ на головке, потом
     получает тройку, пишет новый символ, перемещается по третьему
     элементу, выставляет новое состояние. Если состояние конечное, то
     она останавливается.
   Мы будем придерживаться нотации <_, _,  , _, _, S, F>.
** Проблема останова
   Дано описание процедуры и входные данные. Функция P(a, b) определяет,
   остановится ли a на входных данных b. Существует ли P?
   * Проблема останова неразрешима на машине Тьюринга:
     Пусть P существует.
     Тогда S(x) = P(x, x) остановится ли функция на своем же коде
     MyProg(x) = if S(x) then while(true){} else 1
     Рассмотрим MyProg(`MyProg)
     Если оно остановится, то первое условие выполнено, тогда оно не остановится
     И наоборот.
     Значит, P не существует.
** Выводимость и рек. функции - Тьюринг
