mathlogic.tex
\subsubsection{Представимость β-функции Гёделя в ФА}
\label{sec-11-3-4}
β-функция представима в ФА отношением
B(b,c,i,d) = ∃q((b = q * (1 + c * (i + 1)) + d) \& (d < 1 + c * (i + 1)))
Пусть 1 + c * (i + 1) = z
Докажем условия представимости:
\begin{enumerate}
\item Эквивалентность
\begin{enumerate}
\item β(b,c,i) = d, тогда ⊢ B(b,c,i,d)
b = z * (1 + c * (i + 1))    (это и следующее - из леммы о β) P
d < 1 + c * (i + 1)                                           Q
P → Q → P \& Q
P \& Q
P \& Q → ∃q.(P \& Q) [z:= q]
∃q.(P \& Q)
\item Пусть ⊢ B(b,c,i,d), тогда
∃q.(P \& Q)
подберем такое q (по лемме)
P \& Q → P
P \& Q → Q
P
Q
значит β(b,c,i) = d
\end{enumerate}
\item Единственность
Следует из леммы.
\end{enumerate}
\subsection{Теорема о представимости рекурсивных функций Z, N, U}
\label{sec-11-4}
\begin{enumerate}
\item Z
Z(a, b) = (b = 0)
\begin{itemize}
\item Z(a) = b верно, тогда b = 0
b = 0
\item (b = 0)
b = 0
тогда Z(0) = 0, все ок
\item ∃y.φ(y) \& ∀a∀b(φ(a) \& φ(b) → a = b)
Тоже как-то несложно
\end{itemize}
\item N
N(a, b) = (a = b')
\begin{itemize}
\item N(a) = b, тогда a = b'
a = b'
\item a = b', тогда
N(a) = b
\item Третье не хочу
\end{itemize}
\item Uₙᵢ
Uₙᵢ(x₁\ldots{}xₙ) = (x₁ = x₁) \& (x₂ = x₂) \& \ldots{} \& (xₙ₊₁ = xᵢ)
\begin{itemize}
\item U(..) = xᵢ, тогда xₙ₊₁ = x₁
x₁ = x₁ доказывается
\ldots{}
xₙ = xₙ доказывается
xₙ₊₁ = x₁ по условию
объединяем все \&
\item (x₁ = x₁) \& \ldots{}.
вытаскиваем каждый элемент и тогда видим, что
проекция делает ровно то, что должна.
\item ∃q.(xₙ₊₁ = q)
ХЗ
\item ∀a∀b(x(\ldots{}a)\&x(\ldots{}.b) → a = b)
Для конкретных a, b обявляем a = b - ⊤, тогда выводим
из него конъюнкцию и навешиваем два квантора
\end{itemize}
\end{enumerate}
\subsection{Теорема о представимости S}
\label{sec-11-5}
Eсли f и g₁\ldots{}gₙ представимы, то S<f, g₁\ldots{}gₙ> представима
Пусть F, G₁\ldots{}Gₙ представляют их.
S(a₁\ldots{}aₘ, b) = ∃b₁\ldots{}∃bₙ(G₁(a₁\ldots{}aₙ, b₁) \& \ldots{} \& Gn(a₁\ldots{}aₘ, bₙ)
\& F(b₁\ldots{}bₙ, b))
\begin{itemize}
\item Пусть S(a₁\ldots{}aₙ) = b, тогда существуют такие b₁\ldots{}bₙ, что \#каждый аргумент\#
Поскольку f,g₁\ldots{}gₙ представимы, то доказуемы по представимости
f(b₁\ldots{}bₙ, b)
g₁(a₁\ldots{}aₙ, b₁)
\ldots{}
gₙ(a₁\ldots{}aₙ, bₙ)
g₁ \& g₂ \& \ldots{} \& gₙ \& f    объединили \&     "P"
"P" → ∃b₁."P[b₁:=b₁]" + MP
\ldots{}
Ну и навесили кванторы, да.
\item Пусть верна формула с кванторами. Тогда она и есть уже то, что надо
\item не могу, да и вообще нигде это свойство не доказывается
\end{itemize}
\subsection{Теорема о представимости R}
\label{sec-11-6}
Пусть f, g представимы F, G. Тогда R<f,g> представима.
f: Nⁿ→N, g:Nⁿ⁺²→N
r(x₁\ldots{}xₙ, k, a) =
   ∃b∃c(
        ∃k(β(b, c, 0, k) \& φ(x₁\ldots{}xₙ, k))
        \& B(b, c, xₙ₊₁, a)
        \& ∀k(k<xₙ₊₁ → ∃d∃e(B(b,c,k,d)\&B(b,c,k',e)\&G(x₁\ldots{}xₙ,k,d,e))))
Единственная возможность осознать -- внимательно прочесть формулу.
Тут β-функция используется в качестве функии отображения нашего шага
вычисления рекурсии в результат, типа
0 - F(\ldots{})
1 - G(\ldots{})
\ldots{}
n - G(\ldots{})
\subsection{Теорема о представимости μ}
\label{sec-11-7}
f: Nⁿ⁺¹→N представима F, тогда μ<f> представима M
Μ<F>(x₁\ldots{}xₙ₊₁) = F(x₁\ldots{}xₙ, xₙ₊₁, 0) \& ∀y((y < xₙ₊₁) → ¬F(x₁\ldots{}xₙ, y, 0))
\begin{itemize}
\item μ<f>(x₁\ldots{}xₙ) = xₙ₊₁, тогда xₙ₊₁ - минимальное k, такое что f(x₁..xₙ,k) = 0
то есть имеем
F(x₁\ldots{}xₙ, xₙ₊₁, 0)
∀x.(k < x → ¬F(x₁\ldots{}xₙ, k, 0))
Просто объединим конъюнкцией
\item обратно ей же и разъединим
\end{itemize}
\section{Ticket 10: Тьюринг}
\label{sec-12}
\subsection{Арифметические отношения, их выразимость}
\label{sec-12-1}
\begin{itemize}
\item Арифметическое отношение R ∈ N₀ⁿ выразимо в ФА, если
∃a с n свободными переменными:
a(x₁\ldots{}xₙ), такая что
\begin{enumerate}
\item Eсли R(k₁\ldots{}kₙ), то ⊢ a(k₁\textasciitilde{}\ldots{}kₙ\textasciitilde{})
\item Eсли ¬R(k₁..kₙ), то ⊢ ¬a(k₁\textasciitilde{}\ldots{}kₙ\textasciitilde{})
\end{enumerate}
\end{itemize}
\subsection{Гёделева нумерация}
\label{sec-12-2}
\begin{center}
\begin{tabular}{lrl}
a & `a & описание\\
\hline
( & 3 & \\
) & 5 & \\
, & 7 & \\
¬ & 9 & \\
→ & 11 & \\
V & 13 & \\
\& & 15 & \\
∀ & 17 & \\
∃ & 19 & \\
xₖ & 21 + 6 * k & переменные\\
fⁿₖ & 23 + 6 *ᵏ * 3ⁿ & n-местные функцион. символы (', +, *)\\
Pⁿₖ & 25 + 6 *ᵏ * 3ⁿ & n-местные предикаты (=)\\
\hline
\end{tabular}
\end{center}

Последовательность значков будем составлять так:
a₁\ldots{}aₙ - наши простые числа, соответствующие char'ам, тогда
p₁$^{\text{(a₁)}}$ * p₂$^{\text{(a₂)}}$,\ldots{}pₙ$^{\text{(aₙ)}}$ - геделев нумерал стринга, составленного
из чаров.

Если a - выражение, то `a - выражение в Геделевой форме (на
практике пишут квадратные скобочки без нижних их половинок)
Тогда если a - выражение, `a\textasciitilde{} - это элемент предметного множества
ФА, соответствующий нолику с количеством черточек, равным `a.

Доказательство - это последовательность простых чисел, возведенная
в геделевы нумералы выражений, являющихся составляющими док-ва, по
порядку. Аналогично с составлением строки из символов.

Тогда определим следующие функции операций с нумералами:
\begin{itemize}
\item plog(a, b) = max n : a \% bⁿ = 0
Иногда вместо b стоит P$_{\text{b}}$, где P$_{\text{b}}$ - простое число с индексом b.
Функция берет геделев нумерал и достает у него i-й элем. последов.
\item len = max n : a \% pₙ
Возвращает длину строки$\backslash$д-ва
\item s@t = p₁$^{\text{(plog(s, 1))}}$ * \ldots{} * pₗₑₙ₍ₛ₎$^{\text{(plog(s, len(s)))}}$ *
pₗₑₙ₍ₛ₎₊₁$^{\text{(plog(t, 1))}}$ * \ldots{} * pₗₑₙ₍ₛ₎₊ₗₑₙ₍ₜ₎$^{\text{(plog(t, len(t)))}}$
Конкатенация строк
\end{itemize}
\subsection{Машина Тьюринга}
\label{sec-12-3}
Машина тьюринга состоит из ленты, головки, регистра состояния и конечной
таблицы состояний
Более формально, это 7-кортеж: <Q, Γ, b, ∑, δ, q₀, F>
Конечный список состояний, конечный алфавит, пустой символ из алфавита,
символы, которые мы можем писать (из Γ $\backslash$ b), функция таблицы состояний,
начальное состояние из Q, конечное состояние из Q.
\begin{itemize}
\item Лента - бесконечный двусвязный список, в каждой ячейке которого
содержится символ из конечного алфавита, в котором также есть
пустой символ (тут и далее  ), которым изначально заполнена вся
лента
\item Головка может находиться над элементом, писать в него и читать из
него символ. Может двигаться влево-вправо (или двигать ленту, неважно)
\item Регистр состояния хранит состояние - элемент из конечного множества
состояний машины. Есть особые состояния - стартовое и конечные.
\item Таблица состяний - таблица, хранящая данные о функции смены
состояния - foo: Γ × Q → Γ × Q × \{left, this, right\}.
Функция берет текущее состояние, читает символ на головке, потом
получает тройку, пишет новый символ, перемещается по третьему
элементу, выставляет новое состояние. Если состояние конечное, то
она останавливается.
\end{itemize}
Мы будем придерживаться нотации <\_, \_,  , \_, \_, S, F>.
\subsection{Проблема останова}
\label{sec-12-4}
Дано описание процедуры и входные данные. Функция P(a, b) определяет,
остановится ли a на входных данных b. Существует ли P?
\begin{itemize}
\item Проблема останова неразрешима на машине Тьюринга:
Пусть P существует.
Тогда S(x) = P(x, x) остановится ли функция на своем же коде
MyProg(x) = if S(x) then while(true)\{\} else 1
Рассмотрим MyProg(`MyProg)
Если оно остановится, то первое условие выполнено, тогда оно не остановится
И наоборот.
Значит, P не существует.
\end{itemize}
\subsection{Выводимость и рек. функции - Тьюринг}
\label{sec-12-5}
