mathlogic/mathlogic.org
*** Выражение машин Тьюринга через рекурсивные функции
    Мы хотим доказать, что если у нас есть какая-нибудь процедура, которую
    можно выразить в Тьюринге, то мы можем ее сделать и в формальной арифметике
    (рекурсивные функции представимы).
    Введем обозначение <st,tape,pos> = 2^(st)*3^(tape)*5^(pos)
    Такая тройка -- основная характеристика машины в данный момент.
    Будем называеть ее текущим полным состоянием, например.
    st, tape, pos - геделевы нумералы, st - нумерал из 1 элемента с состоянием,
    tape - string, обозначающий ленту (бесконечные   слева и справа не входят),
    pos - позиция в ленте.
    * p: <st, a> → <st, a, dir>
      принимает <st, a>, декодит, лезет в δ машины тьюринга, достает
      новые значения, делает из них <,,>, отдает.
    * t: <st> → 0 | 1
      Определяет, терминально ли наше состояние (0 если терминально)
    * ε - пустой символ (у нас  )
    * pb, pc кодируют β-функцией последовательность инпутов
      в последовательность аутпутов. β(p_b, p_c, x) = p(x)
    * tb, tc аналогично кодируют t
    * R<f,g>(<s_st, s_tape, s_pos>, ε, pb, pc, tb, tc, y)
      Запускает машину Тьюринга от стартового состояния, заранее
      говоря ей, сколько шагов (y) она должна сделать.
      Возвращает тройку <st, tape, pos>
    * Определим f, g
      1. Дополнительные функции
         * os(prev) = plog(prev, 1)
           Текущее состояние
         * ot(prev) = plog(prev, 2)
           Лента
         * op(prev) = plog(prev, 3)
           Позиция головки в ленте
         * nextstate(pb, pc, prev) = β(pb, pc, 2^(os(prev)) * 3^(plog(ot(prev), op(prev)))
           Реализует функцию p
         * st(pb, pc, prev) = plog(nextstate(pb, pc, prev), 1)
           Новое состояние.
         * sym(pb, pc, prev) = plog(nextstate(pb, pc, prev), 2)
           Символ который нужно писать
         * dir(pb, pc, prev) = plog(nextstate(pb, pc, prev), 3)
           Направление для перехода головки
         * repl(pb, pc, prev) = (ot(prev) / (P_op)^(plog(ot(..), op(..)))) * (P_op)^sym(..)
           Возвращает ленту, в которой удален символ в позиции op,
           и добавлен новый символ в эту же позицию.
      2. f - возвращает полное состояние машины
         f(<start_state>, ε, pb, pc, tb, tc) = <start_state>
      3. g - возвращает новое полное состояние из машины после перехода
         (пометка: 0 - nothing, 1 - right, 2 - left
         все фукнции вызываются с аргументом prev, <start_state> не используется)
         g(<start_state>, ε, pb, pc, tb, tc, y, prev) =
         |--------------------------+--------------------------+------------|
         | Condition                | Result                   | Desrc      |
         |--------------------------+--------------------------+------------|
         | dir = 0                  | <st, repl, op>           | nothing    |
         | dir = 1 & len(repl) = op | <st, repl@2^(ε), op + 1> | tape end   |
         | dir = 1                  | <st, repl, op + 1>       | move right |
         | dir = 2 & op = 0         | <st, 2^(ε)@repl, op - 1> | tape start |
         | dir = 2                  | <st, repl, op - 1>       | move left  |
         |--------------------------+--------------------------+------------|

    * Определим steps - функцию, определяющую необх. кол-во шагов
      steps(<start_state>, ε, pb, pc, tb, tc) =
      μ<β(tb, tc, plog(R<f,g>, 1))>(<start_state>, ε, pb, pc, tb, tc)
      Она найдет такое минимальное к, что состояние plog(R<f, g>(args, k), 1) терминально.
*** Выражение программы по проверке доказательства в машине тьюринга
    * Emulate(input, prog) = plog(R<f,g>(<`S, input, 0>,  , pb, pc, tb, tc, steps(-//-)), 1) == F
      Функция проверяет, правда ли получившееся терминальное состояние - ок.
      Можем давать программу такую, что она заканчивается в терминальном F(inish)
      или в терминальном FAIL
      Дает в качестве аргумента функцию перехода, pb, pc выражают prog
    * Proof(term, proof) = Emulate(proof, MY_PROOFCHECKER) && (plog(proof, len(proof)) = term)
      Проверяет, что доказательство p заканчивается корректно и его последний
      элемент - то, что мы доказываем.
    * Любая представимая в ФА ф-я является рекурсивной
      Пусть f представима
      Пусть f(x₁...xₙ) = b, тогда ⊢ φ(x₁~...xₙ~, b~)
      Всегда можно построить рекурсивную функцию G_φ(x₁...xₙ, b, p),
      утверждающую, что p - гёделев номер вывода предиката φ(x₁~...xₙ~, b~)
      Мы делаем это обычным перебором чисел, проверяем вывод нашей
      программой из домашнего задания, выраженную в тьюринге, а потом в
      рекурсивных функциях.
      Тогда f в рекурсивных функциях выражается так:
      f(x₁...xₙ) = plog(μ<S<G_φ, Uₙ₊₁,₁,... Uₙ₊₁,ₙ,
      plog(Uₙ₊₁,ₙ₊₁, 1),
      plog(Uₙ₊₁,ₙ₊₁, 2)>>(x₁...xₙ), 1)
      Такая функция берет plog(1) от первого такого минимального геделева
      номера k (геделева пара из двух элементов - <b, p>)), что
      S<G_φ, U....>(x₁...xₙ, k) = 0. Это значит, что
      G_φ(x₁...xₙ, plog(k, 1), plog(k, 2)) = 0, это значит, что
      G_φ(x₁...xₙ, b, p) = 0, то есть p - вывод φ(x₁~...xₙ~, b~).
      Этот геделев номер - b
* Ticket 11: 1т о неполноте
** Непротиворечивость, ω-непротиворечивость
   * Теория непротиворечива, если в ней нельзя вывести
     одновременно a и ¬a (что аналогично невозможности
     вывести a&¬a).
   * Теория ω-непротиворечива, если из ∀φ(x) ⊢φ(x~) следует
     ⊬ ∃p¬φ(p). Проще говоря, если мы взяли
     формулу, то невозможно вывести одновременно ∃x¬A(x)
     и A(0), A(1), ...
   * Лемма о w-# и обычной непротиворечивости
     Если теория w-непротиворечива, то она непротиворечива
     φ = x=x → x=x
     Такая формула очевидно доказуема (A → A)
     ⊢φ[x:=k] k ∈ N₀
     Но недоказуемо ∃x¬(x=x→x=x)
     А в противоречивой теории доказуемо все
