mathlogic.tex
\subsubsection{Выражение машин Тьюринга через рекурсивные функции}
\label{sec-12-5-1}
Мы хотим доказать, что если у нас есть какая-нибудь процедура, которую
можно выразить в Тьюринге, то мы можем ее сделать и в формальной арифметике
(рекурсивные функции представимы).
Введем обозначение <st,tape,pos> = 2$^{\text{(st)}}$*3$^{\text{(tape)}}$*5$^{\text{(pos)}}$
Такая тройка -- основная характеристика машины в данный момент.
Будем называеть ее текущим полным состоянием, например.
st, tape, pos - геделевы нумералы, st - нумерал из 1 элемента с состоянием,
tape - string, обозначающий ленту (бесконечные   слева и справа не входят),
pos - позиция в ленте.
\begin{itemize}
\item p: <st, a> → <st, a, dir>
принимает <st, a>, декодит, лезет в δ машины тьюринга, достает
новые значения, делает из них <,,>, отдает.
\item t: <st> → 0 | 1
Определяет, терминально ли наше состояние (0 если терминально)
\item ε - пустой символ (у нас  )
\item pb, pc кодируют β-функцией последовательность инпутов
в последовательность аутпутов. β(p$_{\text{b}}$, p$_{\text{c}}$, x) = p(x)
\item tb, tc аналогично кодируют t
\item R<f,g>(<s$_{\text{st}}$, s$_{\text{tape}}$, s$_{\text{pos}}$>, ε, pb, pc, tb, tc, y)
Запускает машину Тьюринга от стартового состояния, заранее
говоря ей, сколько шагов (y) она должна сделать.
Возвращает тройку <st, tape, pos>
\item Определим f, g
\begin{enumerate}
\item Дополнительные функции
\begin{itemize}
\item os(prev) = plog(prev, 1)
Текущее состояние
\item ot(prev) = plog(prev, 2)
Лента
\item op(prev) = plog(prev, 3)
Позиция головки в ленте
\item nextstate(pb, pc, prev) = β(pb, pc, 2$^{\text{(os(prev))}}$ * 3$^{\text{(plog(ot(prev), op(prev)))}}$
           Реализует функцию p
\item st(pb, pc, prev) = plog(nextstate(pb, pc, prev), 1)
Новое состояние.
\item sym(pb, pc, prev) = plog(nextstate(pb, pc, prev), 2)
Символ который нужно писать
\item dir(pb, pc, prev) = plog(nextstate(pb, pc, prev), 3)
Направление для перехода головки
\item repl(pb, pc, prev) = (ot(prev) / (P$_{\text{op}}$)$^{\text{(plog(ot(..), op(..)))}}$) * (P$_{\text{op}}$)$^{\text{sym}}$(..)
Возвращает ленту, в которой удален символ в позиции op,
и добавлен новый символ в эту же позицию.
\end{itemize}
\item f - возвращает полное состояние машины
f(<start$_{\text{state}}$>, ε, pb, pc, tb, tc) = <start$_{\text{state}}$>
\item g - возвращает новое полное состояние из машины после перехода
(пометка: 0 - nothing, 1 - right, 2 - left
все фукнции вызываются с аргументом prev, <start$_{\text{state}}$> не используется)
g(<start$_{\text{state}}$>, ε, pb, pc, tb, tc, y, prev) =
\begin{center}
\begin{tabular}{lll}
\hline
Condition & Result & Desrc\\
\hline
dir = 0 & <st, repl, op> & nothing\\
dir = 1 \& len(repl) = op & <st, repl@2$^{\text{(ε)}}$, op + 1> & tape end\\
dir = 1 & <st, repl, op + 1> & move right\\
dir = 2 \& op = 0 & <st, 2$^{\text{(ε)}}$@repl, op - 1> & tape start\\
dir = 2 & <st, repl, op - 1> & move left\\
\hline
\end{tabular}
\end{center}
\end{enumerate}

\item Определим steps - функцию, определяющую необх. кол-во шагов
steps(<start$_{\text{state}}$>, ε, pb, pc, tb, tc) =
μ<β(tb, tc, plog(R<f,g>, 1))>(<start$_{\text{state}}$>, ε, pb, pc, tb, tc)
Она найдет такое минимальное к, что состояние plog(R<f, g>(args, k), 1) терминально.
\end{itemize}
\subsubsection{Выражение программы по проверке доказательства в машине тьюринга}
\label{sec-12-5-2}
\begin{itemize}
\item Emulate(input, prog) = plog(R<f,g>(<`S, input, 0>,  , pb, pc, tb, tc, steps(-//-)), 1) == F
Функция проверяет, правда ли получившееся терминальное состояние - ок.
Можем давать программу такую, что она заканчивается в терминальном F(inish)
или в терминальном FAIL
Дает в качестве аргумента функцию перехода, pb, pc выражают prog
\item Proof(term, proof) = Emulate(proof, MY$_{\text{PROOFCHECKER}}$) \&\& (plog(proof, len(proof)) = term)
Проверяет, что доказательство p заканчивается корректно и его последний
элемент - то, что мы доказываем.
\item Любая представимая в ФА ф-я является рекурсивной
Пусть f представима
Пусть f(x₁\ldots{}xₙ) = b, тогда ⊢ φ(x₁\textasciitilde{}\ldots{}xₙ\textasciitilde{}, b\textasciitilde{})
Всегда можно построить рекурсивную функцию G$_{\text{φ}}$(x₁\ldots{}xₙ, b, p),
утверждающую, что p - гёделев номер вывода предиката φ(x₁\textasciitilde{}\ldots{}xₙ\textasciitilde{}, b\textasciitilde{})
Мы делаем это обычным перебором чисел, проверяем вывод нашей
программой из домашнего задания, выраженную в тьюринге, а потом в
рекурсивных функциях.
Тогда f в рекурсивных функциях выражается так:
f(x₁\ldots{}xₙ) = plog(μ<S<G$_{\text{φ}}$, Uₙ₊₁,₁,\ldots{} Uₙ₊₁,ₙ,
plog(Uₙ₊₁,ₙ₊₁, 1),
plog(Uₙ₊₁,ₙ₊₁, 2)>>(x₁\ldots{}xₙ), 1)
Такая функция берет plog(1) от первого такого минимального геделева
номера k (геделева пара из двух элементов - <b, p>)), что
S<G$_{\text{φ}}$, U\ldots{}.>(x₁\ldots{}xₙ, k) = 0. Это значит, что
G$_{\text{φ}}$(x₁\ldots{}xₙ, plog(k, 1), plog(k, 2)) = 0, это значит, что
G$_{\text{φ}}$(x₁\ldots{}xₙ, b, p) = 0, то есть p - вывод φ(x₁\textasciitilde{}\ldots{}xₙ\textasciitilde{}, b\textasciitilde{}).
Этот геделев номер - b
\end{itemize}
\section{Ticket 11: 1т о неполноте}
\label{sec-13}
\subsection{Непротиворечивость, ω-непротиворечивость}
\label{sec-13-1}
\begin{itemize}
\item Теория непротиворечива, если в ней нельзя вывести
одновременно a и ¬a (что аналогично невозможности
вывести a\&¬a).
\item Теория ω-непротиворечива, если из ∀φ(x) ⊢φ(x\textasciitilde{}) следует
⊬ ∃p¬φ(p). Проще говоря, если мы взяли
формулу, то невозможно вывести одновременно ∃x¬A(x)
и A(0), A(1), \ldots{}
\item Лемма о w-\# и обычной непротиворечивости
Если теория w-непротиворечива, то она непротиворечива
φ = x=x → x=x
Такая формула очевидно доказуема (A → A)
⊢φ[x:=k] k ∈ N₀
Но недоказуемо ∃x¬(x=x→x=x)
А в противоречивой теории доказуемо все
\end{itemize}
