mathlogic/mathlogic.org
** Прервая теорема о неполноте
   Определим отношение W₁(x, p), истинное тогда и только тогда,
   когда x - геделев номер формулы φ с единственным свободным
   аргументом x, а p - геделев номер доказательства φ("φ"). Это
   отношение выразимо в ФA, потому что мы просто пихаем это в наш
   Proof, а его мы выразили через рекурсивные функции, а они
   представимы.
   Пусть его выражает w₁(x, p);
   Рассмотрим формулу σ = ∀p¬w₁(x, p) - для любого доказательства
   оно не является доказательством самоприменения φ, то есть
   самоприменение φ недоказуемо.
   То есть если σ(`a~) истинно, то a(`a~) недоказуемо.
   В нашем случае если σ(`a~) истинно, то σ(`σ~) недоказуемо.
   1. Если формальная арифметика непротиворечива, то недоказуемо σ(`σ~)
      1) Пусть ⊢ σ(`σ~), тогда найдется геделев номер ее док-ва p,
         тогда W₁(`σ, p), то есть ⊢ w₁(`σ~, p~).
      2) С другой стороны,
         ⊢ σ(`σ~)
         ⊢ ∀p¬w₁('σ~, p)
         ∀p¬w₁(`σ~, p) → ¬w₁(`σ~, p~)
         ¬w₁(`σ~, p~)
         Тогда ФА противоречива.
   2. Если формальная арифметика w-непротиворечива, то недоказуемо ¬σ(`σ~)
      Пусть ⊢ ¬σ(`σ~), то есть ⊢ ¬∀p¬w₁(`σ~, p), что значит ∃p.w₁(`σ~, p)
      Найдется такой q, что ⊢ w₁(`σ~, q~), потому что если бы не нашелся,
      это бы значило доказуемость для каждого q ¬w₁(`σ~, q~), тогда по
      ω-непротиворечивости было бы не доказуемо ∃p¬¬w₁(`σ~, p)
      То q, что мы нашли - это номер доказательства  σ(`σ~), что и
      утверждает выражение ⊢ w₁(`σ~, q~). Но мы предполагали, что ⊢ ¬σ(`σ~).
      Противоречие.

   Нормальное доказательство общезначимости:
   Я не знаю, зачем нам второй пункт, но из первого следует, что если
   наша теория w-непротиворечива, то она непротиворечива (по лемме выше),
   значит в ней недоказуемо σ(`σ~), то есть ∀p¬w₁(`σ~, p), то есть
   по корректности последнее выражение И, но это и есть в точности определение
   σ(`σ~).

   Ненормальное д-во общезначимости:
   Итого мы доказали, что если формальная арифметика ω-непротиворечива,
   то в ней не доказуемо ни σ(`σ~) ни ¬σ(`σ~). Одно из них точно тавтология
   (в формуле нет свободных переменных). Тогда ФА неполна при условии
   ω-непротиворечивости.

   Другое доказательство общезначимости:
   ¬σ(`σ~) недоказуема
   [σ(`σ~)] = [∀p¬w₁(`σ~, p)] =
   1. И если [¬w₁(`σ~, a)] = И для какого-то а
   2. Л иначе

   Это значит, что
   И если [w₁(`σ~, a)] = Л
   [w₁(`σ~, a)] = Л, докажем от противного
   Пусть [σ(`σ~)] = Л,
   [∀p¬w₁(`σ~, p)] = Л
   [¬∀p¬w₁(`σ~, p)] = И
   [∃p.w₁(`σ~, p)] = И
   [w₁(`σ~, a)] = И для какого-то а
   то есть a доказывает σ(`σ~)
   ???

   тогда по определению w₁ существует
   доказательство σ(`σ~),
** Пример w-противоречивой, но непротиворечивой теории (при усл. непрот. ФА)
   Добавим в ФА аксиому Г: ¬σ(`σ~)
   Тогда по контрпозиции 1п2 она w-противоречива.
   Если бы мы могли доказать противоречивость нашей системы, то
   ФА была бы противоречива, тогда хз
   ¬σ(`σ~) ⊢ σ(`σ~)&¬σ(`σ~)
   ⊢ σ(`σ~)
   Но мы предположили что ¬σ(`σ~)
** Форма Россера
   Если формальная арифметика непротиворечива, то в ней найдется
   такая формула φ, что ⊬φ и ⊬¬φ
* Ticket 12: 2т о неполноте
** Consis, Условия выводимости Гильберта-Бернайса
   Определим Consis как утверждение, показывающее
   непротиворечивость ФА - отсутствие φ : ⊢ φ, ¬φ. Поскольку
   в противоречивой теории выводится что угодно, возьмем что-то
   недоказуемое, типа 1=0.
   Consis = ∀p(¬Proof('(1=0)~, p))

   Определим отношение Sub(a, b, c) истинно, если
   a, b - `a, `b & c = `a[x:=b] или
   a V b не геделев номер и c = 0

   Пусть Sub(a, b, c) выражает τ(a, b, c)

   * Лемма о самоприменении
     a(x) - формула, тогда ∃b такой что
     1. ⊢ a(`b~) → b
     2. ⊢ b → a(`b~)

     b₀(x) = ∀t(τ(x, x, t) → a(t))
     b = b₀(`b₀~)
     1. a(`b~) ⊢ a(`b~)
        a(`b~) ⊢ τ(`b₀~, `b₀~, `b~) → a(`b~)    акс 1 + MP
        a(`b~) ⊢ ⊤ → (τ(`b₀~, `b₀~, `b~) → a(`b~))
        a(`b~) ⊢ ⊤ → ∀t(τ(`b₀~, `b₀~, t) → a(t))
        a(`b~) ⊢ ∀t(τ(`b₀~, `b₀~, t) → a(t))
        a(`b~) ⊢ b
     3. b ⊢ ∀t(τ(`b₀~, `b₀~, t) → a(t))    тут почти a ⊢ a написано
        b ⊢ τ(`b₀~, `b₀~, `b~)             по выразимости
        b ⊢ τ(`b₀~, `b₀~, `b~) → a(`b~)    сняли квантор с 1
        b → a(`b~)

   * Условия Гильберта-Бернайса
   Пусть πg(x, p) выражает Proof(x, p)
   πr(x) = ∃t πg(x, t) тогда если
   1. ⊢ a , то ⊢πr(`a~)
   2. ⊢ πr(`a~) → πr(`πr(`a~)~)
   3. ⊢ πr(`a~) → πr(`(a → b)~) → πr(`b~)
** Вторая теорема о неполноте
*** Рукомашеское доказательство без условий Г-Б
    * Если арифметика непротиворечива, в ней нет д-ва Consis
      рассмотрим Consis → σ(`σ~).
      Тогда если Consis доказуемо, то σ(`σ~) недоказуемо.
      То есть это формулировка 1.1 Гёделя о неполноте.
      Тогда если у нас будет Consis, мы сможем доказать
      σ(`σ), тогда 1.1 фейлится. Значит Consis недоказуемо.

    * Доказательство того, что Consis недостаточно формален
      Заменим Consis в д-ве на
      Proof1(a, x) = Proof(a, x)&¬Proof(`(1=0),x)
      Consis1 = ∀x¬Proof1(`(1=0),x)
      Если арифметика непротиворечива, то Proof1(a, x) = Proof(a, x)
      Если арифметика противоречива, то Consis1 доказуема как и все
      остальное.
      Ну давайте менять.

      Поменяли. Смотрим. хехехе, давайте докажем Consis1:
      ¬(π(x) & ¬π(x))              доказуемо в ИВ
      ⊤
      ⊤ → ¬(π(x) & ¬π(x))          1 акс, MP
      ¬(π(x) & ¬π(x))
      ∀x(¬(π(x) & ¬π(x)))

      Тогда выходит, что мы можем доказать противоречивость арифметики.
      Но это не так, бага вот в чем:
      Замена consis на consis1 неоправдана - в consis1 есть
      формула 1=0, на которой ее результат не вычисляется, а
      постулируется.
      Чтобы выражать Consis абстрактно, существуют условия выводимости
      Гильберта-Бернайса.

      Докажем, что consis1 не удовлетворяет 3 свойству Г-Б
      Пусть Proof1(x,p) выражает π1.
      ⊢ π1(`a~) → π1(`a→b~) → π1(`b~) оценим при a=(2=0), b=(1=0)
      ?       → (   true  →  false)
      ?       → false
      Если эта формула верна, то ⊢ π1(`a~)
      Тогда если π1(`a~), то Proof(2=0, x)&¬Proof(`1=0, x) = И
      Это значит что теория противоречива, потому что в ней выводимо 2=0,
      но она непротиворечива, потому что недоказуемо 1=0. →←
