mathlogic.tex
\subsection{Прервая теорема о неполноте}
\label{sec-13-2}
Определим отношение W₁(x, p), истинное тогда и только тогда,
когда x - геделев номер формулы φ с единственным свободным
аргументом x, а p - геделев номер доказательства φ("φ"). Это
отношение выразимо в ФA, потому что мы просто пихаем это в наш
Proof, а его мы выразили через рекурсивные функции, а они
представимы.
Пусть его выражает w₁(x, p);
Рассмотрим формулу σ = ∀p¬w₁(x, p) - для любого доказательства
оно не является доказательством самоприменения φ, то есть
самоприменение φ недоказуемо.
То есть если σ(`a\textasciitilde{}) истинно, то a(`a\textasciitilde{}) недоказуемо.
В нашем случае если σ(`a\textasciitilde{}) истинно, то σ(`σ\textasciitilde{}) недоказуемо.
\begin{enumerate}
\item Если формальная арифметика непротиворечива, то недоказуемо σ(`σ\textasciitilde{})
\begin{enumerate}
\item Пусть ⊢ σ(`σ\textasciitilde{}), тогда найдется геделев номер ее док-ва p,
тогда W₁(`σ, p), то есть ⊢ w₁(`σ\textasciitilde{}, p\textasciitilde{}).
\item С другой стороны,
⊢ σ(`σ\textasciitilde{})
⊢ ∀p¬w₁('σ\textasciitilde{}, p)
∀p¬w₁(`σ\textasciitilde{}, p) → ¬w₁(`σ\textasciitilde{}, p\textasciitilde{})
¬w₁(`σ\textasciitilde{}, p\textasciitilde{})
Тогда ФА противоречива.
\end{enumerate}
\item Если формальная арифметика w-непротиворечива, то недоказуемо ¬σ(`σ\textasciitilde{})
Пусть ⊢ ¬σ(`σ\textasciitilde{}), то есть ⊢ ¬∀p¬w₁(`σ\textasciitilde{}, p), что значит ∃p.w₁(`σ\textasciitilde{}, p)
Найдется такой q, что ⊢ w₁(`σ\textasciitilde{}, q\textasciitilde{}), потому что если бы не нашелся,
это бы значило доказуемость для каждого q ¬w₁(`σ\textasciitilde{}, q\textasciitilde{}), тогда по
ω-непротиворечивости было бы не доказуемо ∃p¬¬w₁(`σ\textasciitilde{}, p)
То q, что мы нашли - это номер доказательства  σ(`σ\textasciitilde{}), что и
утверждает выражение ⊢ w₁(`σ\textasciitilde{}, q\textasciitilde{}). Но мы предполагали, что ⊢ ¬σ(`σ\textasciitilde{}).
Противоречие.
\end{enumerate}

Нормальное доказательство общезначимости:
Я не знаю, зачем нам второй пункт, но из первого следует, что если
наша теория w-непротиворечива, то она непротиворечива (по лемме выше),
значит в ней недоказуемо σ(`σ\textasciitilde{}), то есть ∀p¬w₁(`σ\textasciitilde{}, p), то есть
по корректности последнее выражение И, но это и есть в точности определение
σ(`σ\textasciitilde{}).

Ненормальное д-во общезначимости:
Итого мы доказали, что если формальная арифметика ω-непротиворечива,
то в ней не доказуемо ни σ(`σ\textasciitilde{}) ни ¬σ(`σ\textasciitilde{}). Одно из них точно тавтология
(в формуле нет свободных переменных). Тогда ФА неполна при условии
ω-непротиворечивости.

Другое доказательство общезначимости:
¬σ(`σ\textasciitilde{}) недоказуема
[σ(`σ\textasciitilde{})] = [∀p¬w₁(`σ\textasciitilde{}, p)] =
\begin{enumerate}
\item И если [¬w₁(`σ\textasciitilde{}, a)] = И для какого-то а
\item Л иначе
\end{enumerate}

Это значит, что
И если [w₁(`σ\textasciitilde{}, a)] = Л
[w₁(`σ\textasciitilde{}, a)] = Л, докажем от противного
Пусть [σ(`σ\textasciitilde{})] = Л,
[∀p¬w₁(`σ\textasciitilde{}, p)] = Л
[¬∀p¬w₁(`σ\textasciitilde{}, p)] = И
[∃p.w₁(`σ\textasciitilde{}, p)] = И
[w₁(`σ\textasciitilde{}, a)] = И для какого-то а
то есть a доказывает σ(`σ\textasciitilde{})
???

тогда по определению w₁ существует
доказательство σ(`σ\textasciitilde{}),
\subsection{Пример w-противоречивой, но непротиворечивой теории (при усл. непрот. ФА)}
\label{sec-13-3}
Добавим в ФА аксиому Г: ¬σ(`σ\textasciitilde{})
Тогда по контрпозиции 1п2 она w-противоречива.
Если бы мы могли доказать противоречивость нашей системы, то
ФА была бы противоречива, тогда хз
¬σ(`σ\textasciitilde{}) ⊢ σ(`σ\textasciitilde{})\&¬σ(`σ\textasciitilde{})
⊢ σ(`σ\textasciitilde{})
Но мы предположили что ¬σ(`σ\textasciitilde{})
\subsection{Форма Россера}
\label{sec-13-4}
Если формальная арифметика непротиворечива, то в ней найдется
такая формула φ, что ⊬φ и ⊬¬φ
\section{Ticket 12: 2т о неполноте}
\label{sec-14}
\subsection{Consis, Условия выводимости Гильберта-Бернайса}
\label{sec-14-1}
Определим Consis как утверждение, показывающее
непротиворечивость ФА - отсутствие φ : ⊢ φ, ¬φ. Поскольку
в противоречивой теории выводится что угодно, возьмем что-то
недоказуемое, типа 1=0.
Consis = ∀p(¬Proof('(1=0)\textasciitilde{}, p))

Определим отношение Sub(a, b, c) истинно, если
a, b - `a, `b \& c = `a[x:=b] или
a V b не геделев номер и c = 0

Пусть Sub(a, b, c) выражает τ(a, b, c)

\begin{itemize}
\item Лемма о самоприменении
a(x) - формула, тогда ∃b такой что
\begin{enumerate}
\item ⊢ a(`b\textasciitilde{}) → b
\item ⊢ β → a(`b\textasciitilde{})
\end{enumerate}
b₀(x) = ∀t(τ(x, x, t) → a(t))
b = b₀(`b₀\textasciitilde{})
\begin{enumerate}
\item a(`b\textasciitilde{}) ⊢ a(`b\textasciitilde{})
a(`b\textasciitilde{}) ⊢ τ(`b₀\textasciitilde{}, `b₀\textasciitilde{}, `b\textasciitilde{}) → a(`b\textasciitilde{})    акс 1 + MP
a(`b\textasciitilde{}) ⊢ ⊤ → (τ(`b₀\textasciitilde{}, `b₀\textasciitilde{}, `b\textasciitilde{}) → a(`b\textasciitilde{}))
a(`b\textasciitilde{}) ⊢ ⊤ → ∀t(τ(`b₀\textasciitilde{}, `b₀\textasciitilde{}, t) → a(t))
a(`b\textasciitilde{}) ⊢ ∀t(τ(`b₀\textasciitilde{}, `b₀\textasciitilde{}, t) → a(t))
a(`b\textasciitilde{}) ⊢ b
\item b ⊢ ∀t(τ(`b₀\textasciitilde{}, `b₀\textasciitilde{}, t) → a(t))    тут почти a ⊢ a написано
b ⊢ τ(`b₀\textasciitilde{}, `b₀\textasciitilde{}, `b\textasciitilde{})             по выразимости
b ⊢ τ(`b₀\textasciitilde{}, `b₀\textasciitilde{}, `b\textasciitilde{}) → a(`b\textasciitilde{})    сняли квантор с 1
b → a(`b\textasciitilde{})
\end{enumerate}

\item Условия Гильберта-Бернайса
\end{itemize}
Пусть πg(x, p) выражает Proof(x, p)
πr(x) = ∃t πg(x, t) тогда если
\begin{enumerate}
\item ⊢ a , то ⊢πr(`a\textasciitilde{})
\item ⊢ πr(`a\textasciitilde{}) → πr(`πr(`a\textasciitilde{})\textasciitilde{})
\item ⊢ πr(`a\textasciitilde{}) → πr(`(a → b)\textasciitilde{}) → πr(`b\textasciitilde{})
\end{enumerate}
\subsection{Вторая теорема о неполноте}
\label{sec-14-2}
\subsubsection{Рукомашеское доказательство без условий Г-Б}
\label{sec-14-2-1}
\begin{itemize}
\item Если арифметика непротиворечива, в ней нет д-ва Consis
рассмотрим Consis → σ(`σ\textasciitilde{}).
Тогда если Consis доказуемо, то σ(`σ\textasciitilde{}) недоказуемо.
То есть это формулировка 1.1 Гёделя о неполноте.
Тогда если у нас будет Consis, мы сможем доказать
σ(`σ), тогда 1.1 фейлится. Значит Consis недоказуемо.

\item Доказательство того, что Consis недостаточно формален
Заменим Consis в д-ве на
Proof1(a, x) = Proof(a, x)\&¬Proof(`(1=0),x)
Consis1 = ∀x¬Proof1(`(1=0),x)
Если арифметика непротиворечива, то Proof1(a, x) = Proof(a, x)
Если арифметика противоречива, то Consis1 доказуема как и все
остальное.
Ну давайте менять.

Поменяли. Смотрим. хехехе, давайте докажем Consis1:
¬(π(x) \& ¬π(x))              доказуемо в ИВ
⊤
⊤ → ¬(π(x) \& ¬π(x))          1 акс, MP
¬(π(x) \& ¬π(x))
∀x(¬(π(x) \& ¬π(x)))

Тогда выходит, что мы можем доказать противоречивость арифметики.
Но это не так, бага вот в чем:
Замена consis на consis1 неоправдана - в consis1 есть
формула 1=0, на которой ее результат не вычисляется, а
постулируется.
Чтобы выражать Consis абстрактно, существуют условия выводимости
Гильберта-Бернайса.

Докажем, что consis1 не удовлетворяет 3 свойству Г-Б
Пусть Proof1(x,p) выражает π1.
⊢ π1(`a\textasciitilde{}) → π1(`a→b\textasciitilde{}) → π1(`b\textasciitilde{}) оценим при a=(2=0), b=(1=0)
?       → (   true  →  false)
?       → false
Если эта формула верна, то ⊢ π1(`a\textasciitilde{})
Тогда если π1(`a\textasciitilde{}), то Proof(2=0, x)\&¬Proof(`1=0, x) = И
Это значит что теория противоречива, потому что в ней выводимо 2=0,
но она непротиворечива, потому что недоказуемо 1=0. →←
\end{itemize}
