mathlogic/mathlogic.org
*** Доказательство 2 теоремы Гёделя о неполноте
    Пусть π удовлетворяет условиям Г-Б
    Consis = ¬π(1=0)
    ФА непротиворечива
    Тогда ⊬ Consis

    1. По лемме о самоприменении
       1. ¬π(γ) → γ
       2. γ → ¬π(γ)
       3. ¬γ → π(γ)                            контрпозиция
       4. π(γ) → ¬γ
    2. π(γ) → π(¬γ)
       1. π(γ) ⊢ π(`π(γ)~)                     ГБ2
       2. ⊢ π(π(γ) → ¬γ)                       ГБ1 от 1.4
       3. ⊢ π(π(γ)) → π(π(γ) → ¬γ) → π(¬(γ))   ГБ3
       4. π(γ) ⊢ π(¬γ)                         2MP (2.1, 2.2)
    3. ⊢ π(α → β → γ) and ⊢ π(α) → π(β) => ⊢ π(α) → π(γ)
       1. π(α → β → γ) → π(α) → π(b → γ)        ГБ3
       2. π(β → γ) → π(β) → π(γ)                ГБ3
       3. π(α) → π(β → γ)                       MP 1, given
       4. π(α) → π(β)                           given
       5. π(α) → π(γ)                           занести под дедукцию, ГБ3
    4. ⊢ π(γ) → π(1=0)
       1. γ → ¬γ → (1=0)                        10i в ИИВ, выводима в предикатах
       2. ⊢ π(γ → ¬γ → (1=0))                   ГБ1
       3. π(γ) → π(¬γ)                          2
       4. ⊢ π(γ) → π(1=0)                       MP 4.2 4.3
    5. ⊬ Consis
       ⊢ ¬π(1=0) → ¬π(γ)                        контрапозиция 4
       ⊢ Consis → ¬π(γ)                         the same
       ] ⊢ Consis, тогда ⊢ ¬π(γ)
       ⊢ ¬π(γ) → γ => ⊢ γ => ⊢ π(γ)            1.1, ГБ1
       ⊢ ¬π(γ), ⊢ π(γ)  →←
* Ticket 13: ТМ
** Теория множеств
   Значит это такая теория первого порядка.
   В сигнатуре модели есть один пред.символ - ∈
   Добавляем связку a ←→ b = (a → b) & (b → a)
   σ ∈ Θ => ∀x(x ∈ σ → x ∈ Θ)
   σ = Θ => σ ∈ Θ & Θ ∈ σ
   ∅ : ∀x(¬x ∈ ∅)
   x ∩ y = z, тогда ∀t(t ∈ z ←→ t ∈ x & t ∈ y)
   Dj(x) ∀a∀b(a ∈ x & b ∈ x & a ≠ b → a ∩ b = ∅)
   X(a) - мн-во всех x пересекающихся ровно в одном эл-те с каждым из а
   и содержащих элементы из ∪a.
   X({{1, 2}, {2', 3}}) = {{2, 3}, {1, 2'}}
*** Если существует мн-во, то существует пустое мн-во
    Аксиома выделения:
    ∀x∃b∀y(y ∈ b ←→ (y ∈ x & φ(y)))
    Возьмем наше существующее мн-во x
    ∃b∀y(y ∈ b ←→ (y ∈ x & φ(y)))
    Пусть φ(y) = ⊥
    тогда подставим ∅ вместо b:
    ∀y(y ∈ ∅ ←→ (y ∈ x & ⊥))
    Это выполняется вроде.
*** Если x, то найдется {x}
    ∀x∃{x}∀y(y ∈ {x} → y = x)
    1. Пусть x ≠ ∅
       {x} = {y | y ∈ {x, y} & y ≠ ∅}
       по аксиоме объединения ∃p∀y(y ∈ p ←→ ∃s(y ∈ s & s ∈ x))
       ∀y(y ∈ {x, ∅} ←→ ∃s(y ∈ s & s ∈ x))

       или по аксиоме пары
       ∃p(x ∈ p & ∅ ∈ p & ∀z(z ∈ p → (x = z V y = z)))
       x ∈ {x, ∅} & ∅ ∈ {x, ∅} & ∀z(z ∈ {x, ∅} → ...}

       ДГ руками помахал тут, ну и я помахаю по причине
       отсутствия времени доказывать

       А, нет, вот, кажется:
       По аксиоме степени ∀x∃{x, ∅}∀y(y ∈ {x, ∅} ←→ y ∈ x)
       ∀x∃{x, ∅}∀y((y ∈ {x, ∅} → y ∈ x)&(y ∈ x → y ∈ {x, ∅}))
       ¬y ∈ ∅, значит (y ∈ x → y ∈ x) = ⊤
       ∀x∃{x, ∅}∀y((y ∈ {x, ∅} → y ∈ x)&⊤)
       ∀x∃{x, ∅}∀y(y ∈ {x, ∅} → y = x)   более слабое условие
    2. x = ∅
       P(∅) = {∅}
*** ∃!x(∀y.¬(y ∈ x))
    ∃x(∀y.¬(y ∈ x)) & ∀a∀b((∀y.¬(y ∈ a)) & (∀y.¬(y ∈ b)) → a = b)
    Первое по определению пустого множества и аксиоме выделения с ⊥
    ∀y.(¬y ∈ {}) & ∀y.(¬y ∈ {}) → ∀p((p∈x → p∈y) & (p∈y → p∈x))
    Второе как-то через ∅₁ ∈ ∅₂ и обратное включение
    На основании того, что мы подставляем наши пустые множества, импликация
    вырождается в ⊤ → ⊤
*** x ∩ y существует
    по теореме выделения
    ∀x∃b∀y(y ∈ b ←→ (y ∈ x & φ(y)))
    ∀y(y ∈ x ∩ y ←→ (y ∈ x & t ∈ y))
** Аксиоматика ZFC
*** Аксиома равенства
    ∀x∀y∀z((x = y & y ∈ z) → x ∈ z)
    Eсли два множества равны, то любой элемент лежащий в первом,
    лежит и во втором
*** Аксиома пары
    ∀x∀y(¬(x=y) → ∃p(x ∈ p & y ∈ p & ∀z(z ∈ p → (x = z V y = z))))
    x ≠ y, тогда сущ. {x, y}
*** Аксиома объединений
    ∀x(∃y(y∈x) → ∃p∀y(y ∈ p ←→ ∃s(y ∈ s & s ∈ x)))
    Eсли x не пусто, то из любого семейства множеств можно
    образовать „кучу-малу“, то есть такое множество p,
    каждый элемент y которого принадлежит по меньшей мере
    одному множеству s данного семейства s x
*** Аксиома степени
    ∀x∃p∀y(y ∈ p ←→ y ∈ x)
    P(x) - множество степени x (не путать с 2ˣ - булеаном)
    Это типа мы взяли наш x, и из его элементов объединением и
    пересечением например понаобразовывали кучу множеств, а потом
    положили их в p.
*** Схема аксиом выделения
    ∀x∃b∀y(y ∈ b ←→ (y ∈ x & φ(y)))
    Для нашего множества x мы можем подобрать множество побольше,
    на котором для всех элементов, являющихся подмножеством x
    выполняется предикат.
*** Аксиома выбора (не входит в ZF по дефолту)
    Если a = Dj(x) и a ≠ 0, то x ∈ a ≠ 0
*** Аксиома бесконечности
    ∃N(∅ ∈ N & ∀x(x ∈ N → x ∪ {x} ∈ N))
*** Аксиома фундирования
    ∀x(x = ∅ V ∃y(y ∈ x & y ∩ x = ∅))
    ∀x(x ≠ ∅ → ∃y(y ∈ x & y ∩ x = ∅))
    Равноценные формулы.

    Я бы сказал, что это звучит как-то типа
    "не существует бесконечно вложенных множеств"
*** Схема аксиом подстановки
    ∀x∃!y.φ(x,y) → ∀a∃b∀c(c ∈ b ←→ (∃d.(d ∈ a & φ(d, c))))
    Пусть формула φ такова, что для при любом x найдется единственный y
    такой, чтобы она была истинна на x, y, тогда для любого a
    найдется множество b, каждому элементу которого c можно сопоставить
    подмножество a и наша функция будет верна на нем и на c
    Типа для хороших функций мы можем найти множество с отображением из
    его элементов в подмножество нашего по предикату.
* Ticket 14: oрдиналы
** Ординальные числа
   * Определение вполне упорядоченного множества (фундированное
     с линейныи порядком).
   * Определение транзитивного множества
     Множество X транзитивно, если
     ∀a∀b((a ∈ b & b ∈ x) → a ∈ x)
   * Ординал - транзитивное вполне упорядоченное отношением ∈ мн-во
   * Верхняя грань множества ординалов S
     C | {C = min(X) & C ∈ X | X = {z | ∀(y∈S)(z ≥ y)}}
     C = Upb(S)
     Upb({∅}) = {∅}
   * Successor ordinal (сакцессорный ординал?)
     Это b = a' = a ∪ {a}
   * Предельны ординал
     Ординал, не являющийся ни 0 ни successor'ом.
   * Недостижимый ординал
     ε - такой ординал, что ε = w^ε
     ε₀ = Upb(w, w^w, w^w^w, w^w^w^w, ...) - минимальный из ε
   * Канторова форма - форма вида ∑(a*w^b+c), где b - ординал, последовательность
     строго убывает по b. Есть слабая канторова форма, где вместо a (a ∈ N)
     пишут a раз w^b. В канторовой форме приятно заниматься сложениями и
     прочим, потому что всякие upb - слишком ниочем.
** Операции над ординальными числами
*** Стабилизация убывающей последовательности
    Допустим, что есть убывающая последовательность ординалов x₁,x₂...
    Возьмем ординал x₁ + 1 = x₀. Тогда {x₁, x₂, ...} ∈ x₀. x₀ не пусто,
    значит там есть минимальный элемент по определению порядка на ординале.
    Пусть этот элемент - m. Тогда поскольку m ∈ x₀, то m = xᵢ для какого-то
    i нашей убывающей последовательности.
    1. Последовательность убывает нестрого.
       Тогда все xₖ ≤ m, для k > i. Это выполняется, если xₖ = xᵢ, тогда
       последовательность стабилизируется в m.
    2. Последовательность убывает строго.
       Тогда все xₖ < m для k > i, но m - минимум множества. Противоречие.
       Убывающей строго последовательности ординалов не существует.
*** Арифметические операции через Upb
    Пусть lim(a) = предельный ординал a

    x + 0       = x
    x + c'      = (x + c)'
    x + lim(a)  = Upb{x + c | c < a}

    x * 0       = 0
    x * c'      = x * c + x
    x * lim(a)  = Upb{x * c | c < a}

    x ^ 0       = 1
    x ^ c'      = xᶜ * x
    x ^ lim(a)  = Upb{xᶜ | c < a}

    Ну вот короче можно так, только приходится много думать
    как реализовывать Upb. Или только у меня так.

    2^w = Upb(2, 4, 8, ...) = w
