mathlogic.tex
\subsubsection{Доказательство 2 теоремы Гёделя о неполноте}
\label{sec-14-2-2}
Пусть π удовлетворяет условиям Г-Б
Consis = ¬π(1=0)
ФА непротиворечива
Тогда ⊬ Consis

\begin{enumerate}
\item По лемме о самоприменении
\begin{enumerate}
\item ¬π(γ) → γ
\item γ → ¬π(γ)
\item ¬γ → π(γ)                            контрпозиция
\item π(γ) → ¬γ
\end{enumerate}
\item π(γ) → π(¬γ)
\begin{enumerate}
\item π(γ) ⊢ π(`π(γ)\textasciitilde{})                     ГБ2
\item ⊢ π(π(γ) → ¬γ)                       ГБ1 от 1.4
\item ⊢ π(π(γ)) → π(π(γ) → ¬γ) → π(¬(γ))   ГБ3
\item π(γ) ⊢ π(¬γ)                         2MP (2.1, 2.2)
\end{enumerate}
\item ⊢ π(α → β → γ) and ⊢ π(α) → π(β) => ⊢ π(α) → π(γ)
\begin{enumerate}
\item π(α → β → γ) → π(α) → π(b → γ)        ГБ3
\item π(β → γ) → π(β) → π(γ)                ГБ3
\item π(α) → π(β → γ)                       MP 1, given
\item π(α) → π(β)                           given
\item π(α) → π(γ)                           занести под дедукцию, ГБ3
\end{enumerate}
\item ⊢ π(γ) → π(1=0)
\begin{enumerate}
\item γ → ¬γ → (1=0)                        10i в ИИВ, выводима в предикатах
\item ⊢ π(γ → ¬γ → (1=0))                   ГБ1
\item π(γ) → π(¬γ)                          2
\item ⊢ π(γ) → π(1=0)                       MP 4.2 4.3
\end{enumerate}
\item ⊬ Consis
⊢ ¬π(1=0) → ¬π(γ)                        контрапозиция 4
⊢ Consis → ¬π(γ)                         the same
] ⊢ Consis, тогда ⊢ ¬π(γ)
⊢ ¬π(γ) → γ => ⊢ γ => ⊢ π(γ)            1.1, ГБ1
⊢ ¬π(γ), ⊢ π(γ)  →←
\end{enumerate}
\section{Ticket 13: ТМ}
\label{sec-15}
\subsection{Теория множеств}
\label{sec-15-1}
   Значит это такая теория первого порядка.
   В сигнатуре модели есть один пред.символ - ∈
   Добавляем связку a ←→ b = (a → b) \& (b → a)
   σ ∈ Θ => ∀x(x ∈ σ → x ∈ Θ)
o   σ = Θ => σ ∈ Θ \& Θ ∈ σ
   ∅ : ∀x(¬x ∈ ∅)
   x ∩ y = z, тогда ∀t(t ∈ z ←→ t ∈ x \& t ∈ y)
   Dj(x) ∀a∀b(a ∈ x \& b ∈ x \& a ≠ b → a ∩ b = ∅)
   X(a) - мн-во всех x пересекающихся ровно в одном эл-те с каждым из а
   и содержащих элементы из ∪a.
   X(\{\{1, 2\}, \{2', 3\}\}) = \{\{2, 3\}, \{1, 2'\}\}
\subsubsection{Если существует мн-во, то существует пустое мн-во}
\label{sec-15-1-1}
Аксиома выделения:
∀x∃b∀y(y ∈ b ←→ (y ∈ x \& φ(y)))
Возьмем наше существующее мн-во x
∃b∀y(y ∈ b ←→ (y ∈ x \& φ(y)))
Пусть φ(y) = ⊥
тогда подставим ∅ вместо b:
∀y(y ∈ ∅ ←→ (y ∈ x \& ⊥))
Это выполняется вроде.
\subsubsection{Если x, то найдется \{x\}}
\label{sec-15-1-2}
∀x∃\{x\}∀y(y ∈ \{x\} → y = x)
\begin{enumerate}
\item Пусть x ≠ ∅
\{x\} = \{y | y ∈ \{x, y\} \& y ≠ ∅\}
по аксиоме объединения ∃p∀y(y ∈ p ←→ ∃s(y ∈ s \& s ∈ x))
∀y(y ∈ \{x, ∅\} ←→ ∃s(y ∈ s \& s ∈ x))

или по аксиоме пары
∃p(x ∈ p \& ∅ ∈ p \& ∀z(z ∈ p → (x = z V y = z)))
x ∈ \{x, ∅\} \& ∅ ∈ \{x, ∅\} \& ∀z(z ∈ \{x, ∅\} → \ldots{}\}

ДГ руками помахал тут, ну и я помахаю по причине
отсутствия времени доказывать

А, нет, вот, кажется:
По аксиоме степени ∀x∃\{x, ∅\}∀y(y ∈ \{x, ∅\} ←→ y ∈ x)
∀x∃\{x, ∅\}∀y((y ∈ \{x, ∅\} → y ∈ x)\&(y ∈ x → y ∈ \{x, ∅\}))
¬y ∈ ∅, значит (y ∈ x → y ∈ x) = ⊤
∀x∃\{x, ∅\}∀y((y ∈ \{x, ∅\} → y ∈ x)\&⊤)
∀x∃\{x, ∅\}∀y(y ∈ \{x, ∅\} → y = x)   более слабое условие
\item x = ∅
P(∅) = \{∅\}
\end{enumerate}
\subsubsection{∃!x(∀y.¬(y ∈ x))}
\label{sec-15-1-3}
∃x(∀y.¬(y ∈ x)) \& ∀a∀b((∀y.¬(y ∈ a)) \& (∀y.¬(y ∈ b)) → a = b)
Первое по определению пустого множества и аксиоме выделения с ⊥
∀y.(¬y ∈ \{\}) \& ∀y.(¬y ∈ \{\}) → ∀p((p∈x → p∈y) \& (p∈y → p∈x))
Второе как-то через ∅₁ ∈ ∅₂ и обратное включение
На основании того, что мы подставляем наши пустые множества, импликация
вырождается в ⊤ → ⊤
\subsubsection{x ∩ y существует}
\label{sec-15-1-4}
по теореме выделения
∀x∃b∀y(y ∈ b ←→ (y ∈ x \& φ(y)))
∀y(y ∈ x ∩ y ←→ (y ∈ x \& t ∈ y))
\subsection{Аксиоматика ZFC}
\label{sec-15-2}
\subsubsection{Аксиома равенства}
\label{sec-15-2-1}
∀x∀y∀z((x = y \& y ∈ z) → x ∈ z)
Eсли два множества равны, то любой элемент лежащий в первом,
лежит и во втором
\subsubsection{Аксиома пары}
\label{sec-15-2-2}
∀x∀y(¬(x=y) → ∃p(x ∈ p \& y ∈ p \& ∀z(z ∈ p → (x = z V y = z))))
x ≠ y, тогда сущ. \{x, y\}
\subsubsection{Аксиома объединений}
\label{sec-15-2-3}
∀x(∃y(y∈x) → ∃p∀y(y ∈ p ←→ ∃s(y ∈ s \& s ∈ x)))
Eсли x не пусто, то из любого семейства множеств можно
образовать „кучу-малу“, то есть такое множество p,
каждый элемент y которого принадлежит по меньшей мере
одному множеству s данного семейства s x
\subsubsection{Аксиома степени}
\label{sec-15-2-4}
∀x∃p∀y(y ∈ p ←→ y ∈ x)
P(x) - множество степени x (не путать с 2ˣ - булеаном)
Это типа мы взяли наш x, и из его элементов объединением и
пересечением например понаобразовывали кучу множеств, а потом
положили их в p.
\subsubsection{Схема аксиом выделения}
\label{sec-15-2-5}
∀x∃b∀y(y ∈ b ←→ (y ∈ x \& φ(y)))
Для нашего множества x мы можем подобрать множество побольше,
на котором для всех элементов, являющихся подмножеством x
выполняется предикат.
\subsubsection{Аксиома выбора (не входит в ZF по дефолту)}
\label{sec-15-2-6}
Если a = Dj(x) и a ≠ 0, то x ∈ a ≠ 0
\subsubsection{Аксиома бесконечности}
\label{sec-15-2-7}
∃N(∅ ∈ N \& ∀x(x ∈ N → x ∪ \{x\} ∈ N))
\subsubsection{Аксиома фундирования}
\label{sec-15-2-8}
∀x(x = ∅ V ∃y(y ∈ x \& y ∩ x = ∅))
∀x(x ≠ ∅ → ∃y(y ∈ x \& y ∩ x = ∅))
Равноценные формулы.

Я бы сказал, что это звучит как-то типа
"не существует бесконечно вложенных множеств"
\subsubsection{Схема аксиом подстановки}
\label{sec-15-2-9}
∀x∃!y.φ(x,y) → ∀a∃b∀c(c ∈ b ←→ (∃d.(d ∈ a \& φ(d, c))))
Пусть формула φ такова, что для при любом x найдется единственный y
такой, чтобы она была истинна на x, y, тогда для любого a
найдется множество b, каждому элементу которого c можно сопоставить
подмножество a и наша функция будет верна на нем и на c
Типа для хороших функций мы можем найти множество с отображением из
его элементов в подмножество нашего по предикату.
\section{Ticket 14: oрдиналы}
\label{sec-16}
\subsection{Ординальные числа}
\label{sec-16-1}
\begin{itemize}
\item Определение вполне упорядоченного множества (фундированное
с линейныи порядком).
\item Определение транзитивного множества
Множество X транзитивно, если
∀a∀b((a ∈ b \& b ∈ x) → a ∈ x)
\item Ординал - транзитивное вполне упорядоченное отношением ∈ мн-во
\item Верхняя грань множества ординалов S
C | \{C = min(X) \& C ∈ X | X = \{z | ∀(y∈S)(z ≥ y)\}\}
C = Upb(S)
Upb(\{∅\}) = \{∅\}
\item Successor ordinal (сакцессорный ординал?)
Это b = a' = a ∪ \{a\}
\item Предельны ординал
Ординал, не являющийся ни 0 ни successor'ом.
\item Недостижимый ординал
ε - такой ординал, что ε = w$^{\text{ε}}$
ε₀ = Upb(w, w$^{\text{w}}$, w$^{\text{w}}$$^{\text{w}}$, w$^{\text{w}}$$^{\text{w}}$$^{\text{w}}$, \ldots{}) - минимальный из ε
\item Канторова форма - форма вида ∑(a*w$^{\text{b}}$+c), где b - ординал, последовательность
строго убывает по b. Есть слабая канторова форма, где вместо a (a ∈ N)
пишут a раз w$^{\text{b}}$. В канторовой форме приятно заниматься сложениями и
прочим, потому что всякие upb - слишком ниочем.
\end{itemize}
\subsection{Операции над ординальными числами}
\label{sec-16-2}
\subsubsection{Стабилизация убывающей последовательности}
\label{sec-16-2-1}
Допустим, что есть убывающая последовательность ординалов x₁,x₂\ldots{}
Возьмем ординал x₁ + 1 = x₀. Тогда \{x₁, x₂, \ldots{}\} ∈ x₀. x₀ не пусто,
значит там есть минимальный элемент по определению порядка на ординале.
Пусть этот элемент - m. Тогда поскольку m ∈ x₀, то m = xᵢ для какого-то
i нашей убывающей последовательности.
\begin{enumerate}
\item Последовательность убывает нестрого.
Тогда все xₖ ≤ m, для k > i. Это выполняется, если xₖ = xᵢ, тогда
последовательность стабилизируется в m.
\item Последовательность убывает строго.
Тогда все xₖ < m для k > i, но m - минимум множества. Противоречие.
Убывающей строго последовательности ординалов не существует.
\end{enumerate}
\subsubsection{Арифметические операции через Upb}
\label{sec-16-2-2}
Пусть lim(a) = предельный ординал a

x + 0       = x
x + c'      = (x + c)'
x + lim(a)  = Upb\{x + c | c < a\}

x * 0       = 0
x * c'      = x * c + x
x * lim(a)  = Upb\{x * c | c < a\}

x \^{} 0       = 1
x \^{} c'      = xᶜ * x
x \^{} lim(a)  = Upb\{xᶜ | c < a\}

Ну вот короче можно так, только приходится много думать
как реализовывать Upb. Или только у меня так.

2$^{\text{w}}$ = Upb(2, 4, 8, \ldots{}) = w
