mathlogic/mathlogic.org
*** Арифметические операции через Канторову форму
    Хорошо описано в этой статье:
    [[http://www.google.ru/url?sa=t&rct=j&q=&esrc=s&source=web&cd=1&ved=0CB4QFjAA&url=http://www.ccs.neu.edu/home/pete/pub/cade-algorithms-ordinal-arithmetic.pdf&ei=FDW6VJOYNuvXyQPd0ILQBQ&usg=AFQjCNENBOBOdKbbqBYN3iFhmAu_jFD2Sw&sig2=1UISFzJ_21I8f1YScX7Tkw&bvm=bv.83829542,d.bGQ&cad=rjt][Algorithms for Ordinal Arithmetic]]
    Переписывать довольно громоздко, учитывая количество вспомогательных
    функций. Есть в моем гитхабе (/volhovm/mathlogic/) реализованное
* Ticket 15: кардиналы
** Кардинальные числа
   Будем называть множества равномощными, если найдется биекция.
   Будем называть A не превышающим по мощности B, если найдется
   инъекция A → B (|A| ≤ |B|)
   Будем называть А меньше по мощности, чем B, если |A| ≤ |B| & |A| ≠ |B|
   Кардинальное число - число, оценивающее мощность множества.
   Кардинальное число ℵ - это ординальное число a, такое что
   ∀ x ≤ a |x| ≤ |a|
   ℵ₀ = w по определению; ℵ₁ = минимальный кардинал, следующий за ℵ₀
   Кардинальное число ℶ - это ординальное число а, такое что
   ℶᵢ = P(ℶᵢ₋₁)
   ℶ₀ = ℵ₀
   Континуум-гипотеза формулируется таким образом: |P(ℵ₀)| = ℵ₁ или ℶ₁ = ℵ₁
   В 40 году Гёдель доказал недоказуемость отрицания Континуум-гипотезы
   в терминах ZFC, в 60 Коэн сделал то же самое но без отрицания. Это все
   в условиях непротиворечивости ФА. То есть в ZFC нельзя доказать или
   опровергнуть континуум-гипотезу.
   Сложение кардинальных чисел - |A| + |B| = |A∪B| если в них
   нету общих элементов, иначе max(|A|, |B|), поскольку мы можем
   построить двумерную таблицу из перес. элементов.
   Остальное есть на вики и вряд ли нужно вообще.
** Диагональный метод Кантора
   Докажем, что для любого множества |x| < |P(x)|
   Воспользуемся диагональным методом Kантора
   Пусть |x|=|P(x)|
   Выпишем таблицу, в которой  столбцу p и строке q соответствует
   1, если в множестве X лежит p, а в множестве P(X) лежит
   множество, содержащее в себе p. Построим ключевое мн-во t:
   элемент лежит в t, если на i-й диагональной позиции не стоит 1
   и наоборот. То есть это множество всех таких элементов из X,
   которым по биекции соответствует множество о чем угодно, но не
   о самом элементе (не включающее элемент).
   t состоит из подмножеств X, тогда оно должно лежать в P(X).
   Докажем, что строка t не присутствует в таблице, сравнив ее с
   каждой другой строкой - от каждой n-й строки отличается в n-й
   столбце по построению.
   Противоречие - t нет в таблице, но t ∈ P(X).
** Теорема Лёвингейма-Скулема
   * Назовем мощностью модели мощность ее носителя (V или P или V∪P).
     M - модель, |M| - ее мощность, ну ясно.
   * Элементарная подмодель
     Пусть M - модель фс первого порядка с носителем D. Пусть определено
     D₁ ⊂ D, тогда структура M₁ построенная на D₁ так, что в ее интерпретации
     лежит все, что и в интерпретации M, кроме элементов, взаимодействующих
     с M \ M₁ (сужение области определения на D₁), называется *элементарной*
     *подмоделью*, если:
     1. Любая функция ФС, над которой рассматривается M, замкнута на
        D₁ (то есть если a ∈ D₁, b ∈ D₁, ... то f(a, b, ...) ∈ D₁)
     2. Любая формула A(x₁...xₙ) теории при любых аргументах из D₁,
        истинная в M истинна и в M₁.
   * Элементарная подмодель теории - модель теории
     Рассмотрим формулу А, она общазначима в М, значит и в М₁, тогда M₁ корректна.
   * Счетно-аксиоматизируемая теория - множество аксиом ФС имеет мощность ℵ₀
   * ФА и ТМ счетно-аксоиматизируемые
   * Пусть M - модель, T - мн-во формул теории. Тогда ∃M₁ : |M₁| = max(|T|, ℵ₀)
     Нужно построить необходимое предметное множество и доказать,
     что модель на нем - это подмодель.
     1. Построение множества
        Пусть у нас есть множество D', тогда D'' = D' ∪ P, где P - некоторое
        множество формул добавленное при рассмотрении формул D' по одной.
        A(y, x₁...xₙ) - n-местная формула из Т. Фиксируем x₁...xₙ из D'.
        * Если А = И или А = Л (тождественно) при любом y ∈ D - пропустим формулу
        * Если А = И или А = Л при каких-то y ∈ D' - пропустим формулу
        * ∃y: A(y,..) = И, но при этом ∀y∈D' A(y,..) = Л - тогда добавим один из
          тех у, на которых формула истинна, в D''. Добавим еще констант, которые
          нужны для вычисления А. Типа если В D' не хватает переменных для того,
          чтобы показать что A может принимать истинностное значение, сгенерим
          и добавим такое.
        Переход от предыдущего множества к текущему увеличивает его не более чем на
        ℵ₀ * |T| * |D'| - max(ℵ₀, T)
        Рассмотрим D₀, D₀ ⊂ D такое, что в него входят те элементы носителя,
        соответствующие константам, упоминающимся в Т. Если оно пустое -- добавим
        какую-нибудь константу из D. Оно ляжет в начало счетной последовательности
        D₀ ⊂ D₁ ⊂ ... (каждый переход описан выше). D* = ∪Dᵢ.
        D* - нужное нам множество. |D*| = max(ℵ₀, T)
     2. Проверка структуры
        Индукция по структуре.
        * База. Предикат.
          P(f₁(x₁...xₙ), ..., fₖ(x₁...xₙ)). Если x₁...xₙ взяты из D*, то они были
          добавлены на некотором шаге, значит ∃t | xᵢ ∈ Dₜ. Тогда на шаге Dₜ₊₁
          лежат результаты функций f₁...fₖ. по построению. Тогда оценка формулы
          сохраняется.
        * Переход
          Связки X&Y, XVY, X→Y, ¬X работают на сужении модели и оценка сохр.
          * ∃yB(y, x₁...xₙ). Фиксируем x₁...xₙ из D*.
            1. A была тождественно истинна или ложна - все ОК
            2. А принимала значения разных знаков
               Каждый xᵢ добавлен на каком-то шаге, тогда возьмем максимальный
               шаг t, в Dₜ₊₁ уже лежат все эти xᵢ.
               Тогда по построению Dₜ₊₁ мы добавили нужный y такой что B(y, x₁...xₙ)
               определено и выполнено в M.
               Значит B выполнено в M* по индукции, тогда A истинна в M*.
        * ∀yB(y, x₁...xₙ).
          1. Тождественно - ОК
          2. Принимает значения разных знаков
             Если оно истинно в M, тогда оно истинно в M* по 1 пункту перехода.
             Если ∀yB(y, x₁...xₙ) было ложно на t-шаге, тогда на t+1 шаге мы
             здоровски исправили ситуацию, положив в мир y на котором оно истинно.
             Если оно было истинно, то по пункту 2 пошло дальше.

          Таким образом, D* - подмодель нашего множества, |D*| = ℵ₀ + |T|
** Парадокс Скулема
   Мнимый парадокс Сколема формулируется так:
   Возьмем теорию, прикрутим модель с аксиоматикой ZF. Модель
   будет счетно-аксиоматизируемой потому что ZF.
   Утверждается, что в ZF ⊢ ∃x(|x| = ℶ₁) - это доказывает диагон.
   метод Кантора.
   Тогда получается что по теореме Лёвингейма-Скулема у нашей
   модели есть подмодель размером ℵ₀ + ℵ₀(счетно-акс) = ℵ₀, но
   мы можем взять то самое x | |x| = ℶ₁, и его занумеровать, выходит.

   Формальный подход не допускает этого конфликта ввиду одного
   простого факта:
   Рассмотрим отношение существования несчетного мн-ва в R.
   ZF ⊢ ¬∃f(f - биецкия между w и P(w)) & ∃f(f - биецкия между w и w∪w)
   // второе гарантирует счетность
   Первый аргумент конъюнкции - ¬∃f(∀x∀y(<x,y>∈f ←→ x∈A&x∈B))
   <x,y> - пара (типа {x, y, {x}})
   Тогда это значит, что в носителе модели нет такого f, что он
   бы представлял собой объединение пар.
   Собственно, по теореме Лёвингейма-Скулема у нас любая подмодель
   будет иметь счетный носитель. Нет никакого противоречия, потому
   что мы все еще работаем со счетным количеством множеств, а
   отсутствие биекции все так же выражается отсутствием множества
   в носителе.
* Ticket 16: неполнота ФА
** Теорема о трансфинитной индукции
   Пусть есть формула с одной свободной переменной a(x)
   a истинна, если
   1. a(0)
   2. Если для любого конечного p - ординала мы можем
      показать следование { a(q) & q < p => a(p) }, то a(p) истинно.

   Без док-ва, не требуется.

