mathlogic/mathlogic.org
** Построение S∞
   Мы строим еще одну теорию I порядка.
   По сути, мы вкладываем ФА в нашу теорию так, что
   любое доказательство ФА работает в S∞ и мы можем доказать
   доказать непротиворечивость любого "импортированного" д-ва

   1. Формулы:
      Оставим связки ∀x, V, ¬
      Заметим, что {V, ¬} полно для {0, 1}.
   2. Доказательство
      Доказательством является дерево утверждений, в
      узлах которого правли, причем если дерево
      растет вверх, то правила действуют сверху вниз.
   3. Аксиомы:
      1. все термы ФА без переменных типа θ₁=θ₂ (корректные)
      2. все термы вида ¬(θ₁=θ₂) если [θ₁]≠[θ₂] (некорректные, все остальн.)
   4. Правила:
      Примечание: в правилах используются боковые формулы,
      они могут отсутствовать. Это сделано для формализации
      того факта, что мы можем применять правило для двух любых
      элементов нашей дизъюнкции или вроде того.
      Примечение: org-mode подчеркивает a, если "_a_"
      1) Структурные
         1. Перестановка
            _aVbVγVσ_
            aVγVbVσ
         2. Сокращение
            _aVbVbVγ_
            aVbVγ
      2) Сильные
         1. Ослабление
            _γ_
            aVγ
         2. Де-Морган
            _(¬a)Vγ_(¬b)Vγ_
            ¬(aVb)Vγ
         3. Отрицание
            _aVγ___
            (¬¬a)Vγ
         4. Квантификация
            _¬a(t)Vγ_
            ¬∀x.a(x)Vγ
         5. Бесконечная индукция
            _a(0~)Vγ_a(1~)Vγ_ ... _a(r~)Vγ_...
            ∀xa(x)Vγ
      3) Сечение (для облегчения жизни)
         _γVa_¬aVδ_
         γVδ
   5. Порядки
      Каждой формуле в дереве соответствует порядок, причем
      посылке и заключению (выше и ниже ___) слабого правила
      вывода соответствует один порядок, а порядковое число,
      отнесенное заключению сильного правила или сечения, больше
      порядковых чисел, отнесенных соотвтетствующим посылкам.
      Порядковые числа - это ординалы, они могут быть достижимыми,
      но не конечными - пусть формула какая-нибудь околорекурсивная
      типа Ф(x): Ф(0) = A → A, Ф(1) = A → A → A, Ф(2) = A → A → A → A.
      Тогда пусть мы хотим доказать ∀x.Ф(x) - по бесконечной
      индукции порядок термов будет увеличиваться, а порядок
      ∀x.Ф(x) будет w. Именно из-за этого факта мы используем
      в доказательстве теоремы об устранении сечений трансфинитную
      индукцию по порядку - ведь обычной индукции мало для порядков
      больших w.
   6. Степень
      Степень сечения - количество связок в ¬a.
      Степень доказательства - наибольшая степень сечения в дереве.
      Степень всегда конечна - любая формула в ФА содержит конечное
      число связок, а при трансляции нет возможности увеличить
      их количество. Тогда трансфинитная индукция по термам, в
      которых в сечении количество связок растет до бесконечности,
      невозможно.

   * Нитью называется последовательность формул от начальной до
     конечной. Все нити в доказательстве конечны, поскольку если в начальной
     формуле стоит ординал, последовательность в нити не возрастает, а эти
     числа убывают с применением строгого правила или сечения. Мы знаем,
     что строго убывающая бесконечная последовательность ординалов не существует.
     Добавим правило, что последовательность применения слабых правил подряд
     была всегда конечна
   * Теорема в S∞ - выражение, которое может стоять в заключительной формуле
     вывода
** Теоремы об эквивалентности ФА и S∞
*** Лемма 1: В S∞ выводимо AV¬A
    А либо корректна, либо некорректна, тогда
    _A_
    ¬AVA     ослабление

    _¬A_
    _AV¬A_   ослабление
    _¬AVA_   перестановка
*** Лемма 2: В S∞ выводимо s≠tV¬A(s)VA(t)
    Если выводимо A(s), s = t, то выводимо A(t) (все вхождения меняем)
    если s=t, то выводимо ¬A(t)VA(t), потом сделаем ослабление
    если s≠t, то она аксиома (некорректная) и ослабим.
*** Лемма 3: всякая выводимая в S замкнутая формула А является теоремой S∞
    Докажем, что если что-то доказуемо в ФА, то его эквивалент
    доказуем и в S∞.
    ⊢ₚₐA => ⊢ₛA'
    Схема док-ва
    Рассмотрим доказательство в ФА, оно состоит из
    β₁'...βₙ', оттранслируем каждое в βᵢ ∈ S∞ (по полноте {¬, V} это возможно)
    Тогда можно сделать дерево, в котором начальные формулы - аксиомы S,
    а правила вывода - MP, GEN.

    Рассмотрим формулу A = βᵢ
    1. B → C → B, те ¬B V (¬ C V B)
       Из замкнутости A следует замкнутость B
       ¬B V B выводима по Л1, тогда ослабим с ¬C, переставим.
    2. (B → C) → (B → C → D) → B → D
       ¬(¬B V C) V (¬(¬B V (¬C V D)) V (¬B V D))
       По Л1 выводимо ¬(¬B V C) V (¬B V C),
       (¬B V ¬C V D) V ¬(¬B V ¬C V D)
       Тогда можно по перестановке, сечению (с С) и сокращению
       доказать (B → C → D) → (B → C) → (B → D)
       что одно и то же, см дедукцию в предикатах
    3. (B → C) → (B → ¬C) → ¬B
       ¬(¬B V C) V ¬(¬B V ¬C) V ¬B
       1. ¬B V B                        л1
       2. ¬¬¬B V B                      отрицание
       3. ¬(¬¬B V C) V ¬¬¬B V B         ослабление
       4. ¬¬¬B V ¬(¬¬B V C) V B         перестановка
       5. ¬¬¬B V B V ¬¬C                аналогично + еще перестановка
       6. ¬C V ¬¬C                      лемма
       7. ¬C V B V ¬¬C                  ослабление + перестановка
       8. ¬(¬¬B V C) V B V ¬¬C          де-морган от 6 и 8
       9. ¬¬C V ¬(¬¬B V C) V B          перестановка 8
       10. ¬(¬¬B V ¬C) V ¬(¬¬B V C) V B де-морган от 4 и 9
       Ну вот мы доказали что-то очень похожее на то, что нужно было.
       Там контрпозиция, шмяк шмяк, готово.
    4. Видимо, примерно все формулы так доказываются.
    5. ∀x.B(x) → B(t)
       ¬∀x.B(x) V B(t)
       По л1 ¬B(t) V B(t), потом квантификация по 1 элем.
    6. B(t) → ∃x.B(x)
       B(t) → ¬∀x.B(x) (что заметно отличается от ∀x.¬B(x))
       ¬B(t) V ¬∀x.B(x)
       Не, я не знаю. Но точно можно! По бесконечной индукции мож как-то.
       Или там сечение хитрое.

    А еще есть аксиомы ФА
    1. a = b → a' = b'
       ¬(a = b) V a' = b'
       * если a = b, то a' = b', это аксиома S∞,
         тогда по ослаблению добавим ¬(a = b)
       * если a ≠ b, то она же и аксиома
    2. a = b → a = c → b = c
       a ≠ b V a ≠ c V b = c
       a ≠ b V ¬(x = c) @ b V (x = c) @ c     по лемме 2
    3. a' = b' → a = b
       Аналогично 1
    4. ¬(a' = 0)
       Аксиома, поскольку a' всегда имеет с 0 разные значения
    5. a + b' = (a + b)'
       TODO
    6. a + 0 = a
       Аксиома, поскольку это вседа равенство
    7. a * 0 = 0
       аналогично 6
    8. a * b' = a * b + a
       TODO
    9. φ[x:=0] & ∀x.(φ → φ[x:=x']) → φ
       ¬B(0) V ¬∀x(¬B(x)VB(x')) V B(0)         лемма 1 и перестановка
       ¬B(0) V ¬(¬B(0) V B(1)) V ...           можно показать по индукции
       ... V ¬(¬B(k) V B(k')) V B(k')   (ослабление, перестановка, де-морган)
       ¬B(0) V ¬(∀x(¬B(x) V B(x'))) V B(k')    k раз квантификация, перестановки, сокращ.
       Применим бесконечную индукцию относительно первого
       и третьего терма и получим что надо.

    Окей, с аксиомами разобрались.
    И еще есть два правила вывода
    1. MP
       B            условие
       ¬B V A       условие
       A            сечение
    2. GEN
       B(x)         условие
       Продвигаясь от этой формулы вверх можно поменять все
       x на k, тогда верно
       ⊢ B(k)
       На основании принципа бесконечной индукции доказываем ∀xB(x)
    3. A → B(t) => A → ∀x.B(x)
       ¬A V B
       Заменим все вхождения перменной в доказательстве в
       ФА формулы ¬A V B на 0, 1, 2...,
       тогда по бесконечной индукции:
       ¬A V B(0), ¬A V B(1), ... ⊢ ¬A V ∀x.B   (только B(0) V ¬A везде)
    4. A(t) → B => ∃x.A(x) → B
       ¬A V B ⊢ ¬¬∀x.(¬A(x)) → B
       Заменим все вхождения свободной перменной t в ФА на конкретные.
       Получим счетное мн-во д-в ¬A(0) V B, ¬A(1) V B, ...
       по беск. индукции
       ∀x.¬A(x) V B
       ¬¬∀x.¬A(x) V B -  навесили двойное отрицание
*** Следствие: непротиворечивость S∞ влечет непротиворечивость S
    Пусть в S доказуемо ¬(0=0), тогда оно доказуемо и в
    S∞, тогда
    _AV0=0_¬(0=0)VA_          Аргументы получаются по ослаблению
    _AVA_
    A
** Теорема Генцена об устранении сечений
