mathlogic.tex

\subsection{Построение S∞}
\label{sec-18-2}
Мы строим еще одну теорию I порядка.
По сути, мы вкладываем ФА в нашу теорию так, что
любое доказательство ФА работает в S∞ и мы можем доказать
доказать непротиворечивость любого "импортированного" д-ва

\begin{enumerate}
\item Формулы:
Оставим связки ∀x, V, ¬
Заметим, что \{V, ¬\} полно для \{0, 1\}.
\item Доказательство
Доказательством является дерево утверждений, в
узлах которого правли, причем если дерево
растет вверх, то правила действуют сверху вниз.
\item Аксиомы:
\begin{enumerate}
\item все термы ФА без переменных типа θ₁=θ₂ (корректные)
\item все термы вида ¬(θ₁=θ₂) если [θ₁]≠[θ₂] (некорректные, все остальн.)
\end{enumerate}
\item Правила:
Примечание: в правилах используются боковые формулы,
они могут отсутствовать. Это сделано для формализации
того факта, что мы можем применять правило для двух любых
элементов нашей дизъюнкции или вроде того.
Примечение: org-mode подчеркивает a, если "$_{\text{a}}$\_"
\begin{enumerate}
\item Структурные
\begin{enumerate}
\item Перестановка
\uline{aVbVγVσ}
aVγVbVσ
\item Сокращение
\uline{aVbVbVγ}
aVbVγ
\end{enumerate}
\item Сильные
\begin{enumerate}
\item Ослабление
\uline{γ}
aVγ
\item Де-Морган
\uline{(¬a)Vγ$_{\text{(¬b)}}$Vγ}
¬(aVb)Vγ
\item Отрицание
\uline{aVγ\_\_}
(¬¬a)Vγ
\item Квантификация
\uline{¬a(t)Vγ}
¬∀x.a(x)Vγ
\item Бесконечная индукция
\uline{a(0\textasciitilde{})Vγ$_{\text{a}}$(1\textasciitilde{})Vγ} \ldots{} \uline{a(r\textasciitilde{})Vγ}\ldots{}
∀xa(x)Vγ
\end{enumerate}
\item Сечение (для облегчения жизни)
\uline{γVa$_{\text{¬aVδ}}$}
γVδ
\end{enumerate}
\item Порядки
Каждой формуле в дереве соответствует порядок, причем
посылке и заключению (выше и ниже \uline{\_}) слабого правила
вывода соответствует один порядок, а порядковое число,
отнесенное заключению сильного правила или сечения, больше
порядковых чисел, отнесенных соотвтетствующим посылкам.
Порядковые числа - это ординалы, они могут быть достижимыми,
но не конечными - пусть формула какая-нибудь околорекурсивная
типа Ф(x): Ф(0) = A → A, Ф(1) = A → A → A, Ф(2) = A → A → A → A.
Тогда пусть мы хотим доказать ∀x.Ф(x) - по бесконечной
индукции порядок термов будет увеличиваться, а порядок
∀x.Ф(x) будет w. Именно из-за этого факта мы используем
в доказательстве теоремы об устранении сечений трансфинитную
индукцию по порядку - ведь обычной индукции мало для порядков
больших w.
\item Степень
Степень сечения - количество связок в ¬a.
Степень доказательства - наибольшая степень сечения в дереве.
Степень всегда конечна - любая формула в ФА содержит конечное
число связок, а при трансляции нет возможности увеличить
их количество. Тогда трансфинитная индукция по термам, в
которых в сечении количество связок растет до бесконечности,
невозможно.

\item Нитью называется последовательность формул от начальной до
конечной. Все нити в доказательстве конечны, поскольку если в начальной
формуле стоит ординал, последовательность в нити не возрастает, а эти
числа убывают с применением строгого правила или сечения. Мы знаем,
что строго убывающая бесконечная последовательность ординалов не существует.
Добавим правило, что последовательность применения слабых правил подряд
была всегда конечна
\item Теорема в S∞ - выражение, которое может стоять в заключительной формуле
вывода
\end{enumerate}
\subsection{Теоремы об эквивалентности ФА и S∞}
\label{sec-18-3}
\subsubsection{Лемма 1: В S∞ выводимо AV¬A}
\label{sec-18-3-1}
А либо корректна, либо некорректна, тогда
\uline{A}
¬AVA     ослабление

\uline{¬A}
\uline{AV¬A}   ослабление
\uline{¬AVA}   перестановка
\subsubsection{Лемма 2: В S∞ выводимо s≠tV¬A(s)VA(t)}
\label{sec-18-3-2}
Если выводимо A(s), s = t, то выводимо A(t) (все вхождения меняем)
если s=t, то выводимо ¬A(t)VA(t), потом сделаем ослабление
если s≠t, то она аксиома (некорректная) и ослабим.
\subsubsection{Лемма 3: всякая выводимая в S замкнутая формула А является теоремой S∞}
\label{sec-18-3-3}
Докажем, что если что-то доказуемо в ФА, то его эквивалент
доказуем и в S∞.
⊢ₚₐA => ⊢ₛA'
Схема док-ва
Рассмотрим доказательство в ФА, оно состоит из
β₁'\ldots{}βₙ', оттранслируем каждое в βᵢ ∈ S∞ (по полноте \{¬, V\} это возможно)
Тогда можно сделать дерево, в котором начальные формулы - аксиомы S,
а правила вывода - MP, GEN.

Рассмотрим формулу A = βᵢ
\begin{enumerate}
\item B → C → B, те ¬B V (¬ C V B)
Из замкнутости A следует замкнутость B
¬B V B выводима по Л1, тогда ослабим с ¬C, переставим.
\item (B → C) → (B → C → D) → B → D
¬(¬B V C) V (¬(¬B V (¬C V D)) V (¬B V D))
По Л1 выводимо ¬(¬B V C) V (¬B V C),
(¬B V ¬C V D) V ¬(¬B V ¬C V D)
Тогда можно по перестановке, сечению (с С) и сокращению
доказать (B → C → D) → (B → C) → (B → D)
что одно и то же, см дедукцию в предикатах
\item (B → C) → (B → ¬C) → ¬B
¬(¬B V C) V ¬(¬B V ¬C) V ¬B
\begin{enumerate}
\item ¬B V B                        л1
\item ¬¬¬B V B                      отрицание
\item ¬(¬¬B V C) V ¬¬¬B V B         ослабление
\item ¬¬¬B V ¬(¬¬B V C) V B         перестановка
\item ¬¬¬B V B V ¬¬C                аналогично + еще перестановка
\item ¬C V ¬¬C                      лемма
\item ¬C V B V ¬¬C                  ослабление + перестановка
\item ¬(¬¬B V C) V B V ¬¬C          де-морган от 6 и 8
\item ¬¬C V ¬(¬¬B V C) V B          перестановка 8
\item ¬(¬¬B V ¬C) V ¬(¬¬B V C) V B де-морган от 4 и 9
\end{enumerate}
Ну вот мы доказали что-то очень похожее на то, что нужно было.
Там контрпозиция, шмяк шмяк, готово.
\item Видимо, примерно все формулы так доказываются.
\item ∀x.B(x) → B(t)
¬∀x.B(x) V B(t)
По л1 ¬B(t) V B(t), потом квантификация по 1 элем.
\item B(t) → ∃x.B(x)
B(t) → ¬∀x.B(x) (что заметно отличается от ∀x.¬B(x))
¬B(t) V ¬∀x.B(x)
Не, я не знаю. Но точно можно! По бесконечной индукции мож как-то.
Или там сечение хитрое.
\end{enumerate}

А еще есть аксиомы ФА
\begin{enumerate}
\item a = b → a' = b'
¬(a = b) V a' = b'
\begin{itemize}
\item если a = b, то a' = b', это аксиома S∞,
тогда по ослаблению добавим ¬(a = b)
\item если a ≠ b, то она же и аксиома
\end{itemize}
\item a = b → a = c → b = c
a ≠ b V a ≠ c V b = c
a ≠ b V ¬(x = c) @ b V (x = c) @ c     по лемме 2
\item a' = b' → a = b
Аналогично 1
\item ¬(a' = 0)
Аксиома, поскольку a' всегда имеет с 0 разные значения
\item a + b' = (a + b)'
TODO
\item a + 0 = a
Аксиома, поскольку это вседа равенство
\item a * 0 = 0
аналогично 6
\item a * b' = a * b + a
TODO
\item φ[x:=0] \& ∀x.(φ → φ[x:=x']) → φ
¬B(0) V ¬∀x(¬B(x)VB(x')) V B(0)         лемма 1 и перестановка
¬B(0) V ¬(¬B(0) V B(1)) V \ldots{}           можно показать по индукции
\ldots{} V ¬(¬B(k) V B(k')) V B(k')   (ослабление, перестановка, де-морган)
¬B(0) V ¬(∀x(¬B(x) V B(x'))) V B(k')    k раз квантификация, перестановки, сокращ.
Применим бесконечную индукцию относительно первого
и третьего терма и получим что надо.
\end{enumerate}

Окей, с аксиомами разобрались.
И еще есть два правила вывода
\begin{enumerate}
\item MP
B            условие
¬B V A       условие
A            сечение
\item GEN
B(x)         условие
Продвигаясь от этой формулы вверх можно поменять все
x на k, тогда верно
⊢ B(k)
На основании принципа бесконечной индукции доказываем ∀xB(x)
\item A → B(t) => A → ∀x.B(x)
¬A V B
Заменим все вхождения перменной в доказательстве в
ФА формулы ¬A V B на 0, 1, 2\ldots{},
тогда по бесконечной индукции:
¬A V B(0), ¬A V B(1), \ldots{} ⊢ ¬A V ∀x.B   (только B(0) V ¬A везде)
\item A(t) → B => ∃x.A(x) → B
¬A V B ⊢ ¬¬∀x.(¬A(x)) → B
Заменим все вхождения свободной перменной t в ФА на конкретные.
Получим счетное мн-во д-в ¬A(0) V B, ¬A(1) V B, \ldots{}
по беск. индукции
∀x.¬A(x) V B
¬¬∀x.¬A(x) V B -  навесили двойное отрицание
\end{enumerate}
\subsubsection{Следствие: непротиворечивость S∞ влечет непротиворечивость S}
\label{sec-18-3-4}
Пусть в S доказуемо ¬(0=0), тогда оно доказуемо и в
S∞, тогда
\uline{AV0=0$_{\text{¬}}$(0=0)VA}          Аргументы получаются по ослаблению
\uline{AVA}
A
