mathlogic/mathlogic.org
*** Лемма: сильные правила 2, 3, 5 обратимы
    Правила обратимы и их д-во имеет порядок и степень не больше,
    чем первоначальное
    Нам дают доказательство формулы, мы строим новое дерево,
    в котором из результата следуют посылки.
    1. Правило Де-Моргана
       ¬(B V E) V D
       Рассмотрим вывод формулы. Проследим вхождения
       подформул ¬(B V E)  вормулы, которые соответствуют
       вхождению в конечную формулу (то есть не те, которые
       исчезают в сечении). Мы пройдем через всякий случай
       применения слабого правила и сильные, когда ¬(B V E)
       является боковой формулой. Остановка произойдет
       либо в ослаблении ( F ⊢ ¬(B V E) V F ) либо в Де-Моргане
       ( ¬B V F, ¬E V F ⊢ ¬(B V E) V F ). Совокупность таких
       вхождений формулы назовем ее *историей*.
       Если все вхождения формулы ¬(B V E) в ее истории заменить
       на ¬B, то в результате получится вывод ¬B V D. Аналогично
       можем вывести ¬E V D.
    2. Правило отрицания
       ¬¬B V D
       Заменим все вхождения ¬¬B в ее истории на B, получим
       вывод B V D
    3. Бесконечная индукция
       ∀xB(x) V D
       Заменим все вхождения ∀xB(x) в ее истории (1 элемент) на
       B(k) (причем если мы уткнулись в бесконечную индукцию,
       выберем только ту ветку, которая соответствует B(k))
       Тогда для любого k получим вывод B(k)
*** Теорема: устранение сечения
    Если для A в S∞ существует вывод (m, a), то существует
    вывод в S∞ (n, 2ᵃ), где n < m
    Докажем через трансфинитную индукцию по порядку a вывода A
    * База: порядок вывода 0
      Вывод не содержит сечений и его степень 0
    * Переход: пусть теорема верна для выводов порядков меньших a
      Будем продвигаться вверх по выводу, пока не встретим первое
      применение сильного правила или сечения.
      1. Сильное правило
         Пусть его посылки занумерованы порядковыми числами aₗ
         Согласно индуктивному предположению, для этих посылок
         существует дерево вывода F со степенью < m и порядком 2^(aᵢ).
         Заменим таким деревом то поддерево данного дерева вывода,
         заключительной формулой которого служит рассматриваемое
         вхождение F. Сделав так со всеми посылками мы получим новое
         дерево для A, отнесем ему порядковое число 2ᵃ > 2^(aᵢ)
         (пояснение от меня, потому что я чет долго доганял - каждую
         посылку заменяем по индукции на ее модное новое дерево
         от нее самой же).
      2. Сечение
         Значит имеем что-то на уровне
         _CVB__¬BVD_
         CVD
         Согласно индуктивному предположению для CVB и ¬BVD существуют
         выводы степеней меньших m и порядков 2^a₁, 2^a₂. Рассмотрим
         разные случаи строения B:
         1) B - это элементарная формула. Одна из формул B и ¬B есть
            аксиома. Пусть K - та, которая не аксиома.
            По предположениию поддерево основного дерева вывода с K
            может быть заменено другим со степенью n и порядка 2^(a_i)
            (i = 1 или 2, смотря в какой посылке K).
            В этом новом дереве расмотрим историю K, начальные формулы
            в которой могут возникнуть только по ослаблению (а исчезать
            по сечению). Поэтому удаление всех вхождений K из истории
            приводит к построению дерева вывода для D или C порядка
            2^aᵢ. Отсюда с помощью ослабления получаем дерево вывода
            для C V D порядка 2^a. Степень меньше m (одно сечение убрали).
         2) B - это ¬E, тогда посылки выглядят как
            CV¬E, ¬¬EVD
            Существует дерево вывода для ¬¬EVD степени < m и порядка 2^a₂
            В силу леммы об обратимости можно построить дерево вывода
            EVD порядка 2^a₂ степени < m
            Кроме того существует дерево вывода степени < m и порядка 2^a₁
            для левой посылки, тогда построим из них новое дерево
            вывода
            _EVD_   _CV¬E_
            _DVE__¬EVC_
            _DVC_
            CVD
            Степень выделенного здесь сечения на единицу меньше общего
            числа связок и кванторов в ¬E, которое само по себе ≤ m.
            Формуле CVD можно присвоить порядковое число C V D по свойству
            посылок новог сечения.
         3) B - это EVF, посылки:
            CVEVF, ¬(EVF)VD
            Существует дерево вывода для правой посылки < m и порядка 2^a₂,
            по лемме об обратимости существуют выводы степеней < m и порядка
            2^a₂ для ¬EVD и ¬FVD (по Де-Моргану). По предположению индукции
            есть еще дерево вывода для левой посылки.
            Из последних трех построим такое:
            _CVEVF__¬FVD_
               _CVEVD_
               _CVDVE____¬EVD_
                   _CVDVD_
            CVD
            Степень сечения уменьшили (в каждом на 1), в формуле
            CVEVD можно дать порядок 2^max(a₁, a₂)+1, а остальным - 2^a
         4) B - это ∀xE, посылки:
            CV∀xE  (¬∀xE)VD
            По индуктивному предположению для левой посылки можно построить
            дерево вывода (< m,2^a₁). В силу указания в начале 2 леммы о
            эквивалентности S∞ и ФА (если ⊢A(t), t=s, то ⊢A(s)) и леммы
            об обратимости для любого постоянного терма z существует вывод
            CVE(z).
            Можем и правую посылку заменить (< m, 2^a₂) по инд.предположению
            Тогда в правой посылке история ¬(∀xE) может начинаться либо
            с ослабления либо с квантификации.
            Заменим на C все такие начала - если это ослабление, то просто
            подменим вместо ¬(∀xE) новое C, если квантификация, то
            _¬E(t)VF___         _CVE(t)__¬E(t)VF_   //первое мы взяли из левой посылки
            ¬(∀xE(x))VF   =>          CVF
            В результате мы получили дерево вывода CVD
            Степень меньше m, поскольку связку мы одну убрали
            *тут еще ОЧЕНЬ АДОВЫЕ оценки порядка CVD, но он 2^a*
*** Следствие: устранение всех сечений
    Воспользуемся леммой об устранении сечения, пока степень вывода
    не станет равна нулю. Тогда порядок будет что-то на уровне степенной
    башни из двоек, в вершине которой первоначальная степень, а количество
    двоек -- количество применения леммы.
*** Следствие: S∞ непротивроечива
    Если S∞ противоречива, в ней докажется 0≠0V0≠0V...V0≠0.
    В ее истории появление 0≠0 может быть только из-за ослабления,
    но тогда посылкой ослабления тоже будет 0≠0. Если в д-ве есть
    сечения, мы можем перестроить его, устранив все сечения, а затем провести
    рассуждения вновь и увидеть, что такая формула недоказуема, а значит
    S∞ непротиворечива, значит и ФА тоже непротиворечива.
* Ключевые фигуры
  * Станислав Яськовски - 1906
    Aлгебра Яськовского, один из первых исследователей ИИВ
  * Герхард Генцен - 1909
    Теорема об устранении сечения (1935)
  * Курт Гёдель - 1906
    Теоремы о непротиворечивости - 1930
    Чуть ли не все остальное
  * Сол Крипке - 1940
    Семантика Крипке - 1960-1970
  * Дэвид Гильберт - 1862, Пауль Бернайс - 1888
    Основания математики - 1934, 39
  * Их достаточно много, а времени мало.
